-- --------------------------------------------------------
-- 主机:                           127.0.0.1
-- 服务器版本:                        8.0.17 - MySQL Community Server - GPL
-- 服务器OS:                        Win64
-- HeidiSQL 版本:                  10.2.0.5599
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;


-- Dumping database structure for newstars
CREATE DATABASE IF NOT EXISTS `newstars` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `newstars`;

-- Dumping structure for table newstars.account_coinkind_s
CREATE TABLE IF NOT EXISTS `account_coinkind_s` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `userid` int(11) DEFAULT NULL,
  `coinkind` int(11) DEFAULT NULL,
  `coinvalue` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

-- Dumping data for table newstars.account_coinkind_s: ~0 rows (大约)
/*!40000 ALTER TABLE `account_coinkind_s` DISABLE KEYS */;
/*!40000 ALTER TABLE `account_coinkind_s` ENABLE KEYS */;

-- Dumping structure for table newstars.account_info_t
CREATE TABLE IF NOT EXISTS `account_info_t` (
  `userid` int(11) NOT NULL,
  `reg_ip_prov` varchar(45) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL,
  `reg_ip_city` varchar(100) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL,
  `login_ip_prov` varchar(50) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL,
  `login_ip_area` varchar(45) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL,
  `frist_pay_num` double DEFAULT NULL,
  `frist_paytime` bigint(20) DEFAULT NULL,
  `sum_water` double DEFAULT NULL,
  `sum_pay` double DEFAULT NULL,
  `count_pay` double DEFAULT NULL,
  `avg_pay` double DEFAULT NULL,
  `sum_exchange` double DEFAULT NULL,
  `sum_settle_pay` double DEFAULT NULL,
  `count_settle_pay` double DEFAULT NULL,
  `avg_settle_pay` double DEFAULT NULL,
  `updatetime` bigint(20) DEFAULT NULL,
  PRIMARY KEY (`userid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

-- Dumping data for table newstars.account_info_t: ~0 rows (大约)
/*!40000 ALTER TABLE `account_info_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `account_info_t` ENABLE KEYS */;

-- Dumping structure for table newstars.account_paoku
CREATE TABLE IF NOT EXISTS `account_paoku` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `machineid` varchar(45) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL,
  `amount` decimal(18,2) DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `machineid_UNIQUE` (`machineid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

-- Dumping data for table newstars.account_paoku: ~0 rows (大约)
/*!40000 ALTER TABLE `account_paoku` DISABLE KEYS */;
/*!40000 ALTER TABLE `account_paoku` ENABLE KEYS */;

-- Dumping structure for table newstars.account_s
CREATE TABLE IF NOT EXISTS `account_s` (
  `userid` int(11) NOT NULL AUTO_INCREMENT,
  `accountname` varchar(45) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL,
  `password` varchar(45) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL,
  `coin` int(11) DEFAULT '0',
  PRIMARY KEY (`userid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

-- Dumping data for table newstars.account_s: ~0 rows (大约)
/*!40000 ALTER TABLE `account_s` DISABLE KEYS */;
/*!40000 ALTER TABLE `account_s` ENABLE KEYS */;

-- Dumping structure for table newstars.account_t
CREATE TABLE IF NOT EXISTS `account_t` (
  `userid` int(11) NOT NULL AUTO_INCREMENT COMMENT '用户ID',
  `accountname` varchar(45) DEFAULT NULL COMMENT '账号名',
  `password` varchar(45) DEFAULT NULL COMMENT '秘密',
  `machineid` varchar(45) DEFAULT NULL COMMENT '机器码',
  `ipaddr` varchar(45) DEFAULT NULL COMMENT 'IP地址',
  `reg_ip` varchar(45) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL COMMENT 'IP地址',
  `iparea` varchar(45) DEFAULT NULL COMMENT 'IP区域',
  `nickname` varchar(45) DEFAULT NULL COMMENT '昵称',
  `acctype` int(11) DEFAULT NULL COMMENT '账号类型',
  `faceid` int(11) DEFAULT NULL COMMENT '头像ID',
  `sexuatily` int(11) DEFAULT NULL COMMENT '性别',
  `platformid` int(11) DEFAULT NULL COMMENT '渠道ID',
  `mobile` varchar(45) DEFAULT NULL COMMENT '手机号码',
  `bindtime` bigint(20) DEFAULT '0' COMMENT '手机绑定时间',
  `status` int(11) DEFAULT NULL COMMENT '账号状体',
  `createtime` bigint(20) DEFAULT NULL COMMENT '创建时间',
  `logintime` bigint(20) DEFAULT NULL COMMENT '登陆时间',
  `logouttime` bigint(20) DEFAULT NULL COMMENT '登出时间',
  `token` varchar(45) DEFAULT NULL COMMENT 'token值',
  `game_id` int(11) NOT NULL DEFAULT '0' COMMENT '平台id',
  `faceframeid` int(11) DEFAULT '0',
  `playerchanid` int(11) DEFAULT '0',
  PRIMARY KEY (`userid`),
  UNIQUE KEY `accountname_UNIQUE` (`accountname`),
  KEY `Index_game_id` (`game_id`)
) ENGINE=InnoDB AUTO_INCREMENT=682500 DEFAULT CHARSET=utf8 COMMENT='账号表';

-- Dumping data for table newstars.account_t: ~0 rows (大约)
/*!40000 ALTER TABLE `account_t` DISABLE KEYS */;
INSERT INTO `account_t` (`userid`, `accountname`, `password`, `machineid`, `ipaddr`, `reg_ip`, `iparea`, `nickname`, `acctype`, `faceid`, `sexuatily`, `platformid`, `mobile`, `bindtime`, `status`, `createtime`, `logintime`, `logouttime`, `token`, `game_id`, `faceframeid`, `playerchanid`) VALUES
	(4127, 'a50150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '简阳', '会员a50250', 3, 20, 0, 1, '', 0, 1, 1511778203, 1511778203, NULL, NULL, 0, 0, 0),
	(4128, 'a50250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '潍坊', '会员a50350', 3, 28, 0, 1, '', 0, 1, 1511778212, 1511778212, NULL, NULL, 0, 0, 0),
	(4129, 'a50350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '天津', '会员a50450', 3, 24, 0, 1, '', 0, 1, 1511778213, 1511778213, NULL, NULL, 0, 0, 0),
	(4130, 'a50450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '重庆', '会员a50550', 3, 6, 0, 1, '', 0, 1, 1511778213, 1511778213, NULL, NULL, 0, 0, 0),
	(4131, 'a50550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '香港', '会员a50650', 3, 32, 0, 1, '', 0, 1, 1511778213, 1511778213, NULL, NULL, 0, 0, 0),
	(4132, 'a50650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '澳门', '会员a50750', 3, 16, 0, 1, '', 0, 1, 1511778213, 1511778213, NULL, NULL, 0, 0, 0),
	(4133, 'a50750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '石家庄', '会员a50850', 3, 4, 0, 1, '', 0, 1, 1511778213, 1511778213, NULL, NULL, 0, 0, 0),
	(4134, 'a50850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '沧州', '会员a50950', 3, 21, 0, 1, '', 0, 1, 1511778213, 1511778213, NULL, NULL, 0, 0, 0),
	(4135, 'a50950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '承德', '会员a51050', 3, 12, 0, 1, '', 0, 1, 1511778213, 1511778213, NULL, NULL, 0, 0, 0),
	(4136, 'a51050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '秦皇岛', '会员a51150', 3, 8, 0, 1, '', 0, 1, 1511778213, 1511778213, NULL, NULL, 0, 0, 0),
	(4137, 'a51150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '唐山', '会员a51250', 3, 31, 0, 1, '', 0, 1, 1511778213, 1511778213, NULL, NULL, 0, 0, 0),
	(4138, 'a51250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '保定', '会员a51350', 3, 1, 0, 1, '', 0, 1, 1511778213, 1511778213, NULL, NULL, 0, 0, 0),
	(4139, 'a51350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '廊坊', '会员a51450', 3, 3, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4140, 'a51450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '邢台', '会员a51550', 3, 6, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4141, 'a51550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '衡水', '会员a51650', 3, 1, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4142, 'a51650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '张家口', '会员a51750', 3, 11, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4143, 'a51750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '邯郸', '会员a51850', 3, 18, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4144, 'a51850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '任丘', '会员a51950', 3, 24, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4145, 'a51950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '河间', '会员a52050', 3, 6, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4146, 'a52050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '泊头', '会员a52150', 3, 9, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4147, 'a52150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '武安', '会员a52250', 3, 30, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4148, 'a52250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '沙河', '会员a52350', 3, 25, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4149, 'a52350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '南宫', '会员a52450', 3, 28, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4150, 'a52450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '深州', '会员a52550', 3, 20, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4151, 'a52550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '冀州', '会员a52650', 3, 12, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4152, 'a52650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '黄骅', '会员a52750', 3, 10, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4153, 'a52750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '高碑店', '会员a52850', 3, 32, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4154, 'a52850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '安国', '会员a52950', 3, 12, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4155, 'a52950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '涿州', '会员a53050', 3, 11, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4156, 'a53050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '定州', '会员a53150', 3, 15, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4157, 'a53150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '三河', '会员a53250', 3, 18, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4158, 'a53250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '霸州', '会员a53350', 3, 18, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4159, 'a53350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '迁安', '会员a53450', 3, 22, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4160, 'a53450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '遵化', '会员a53550', 3, 15, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4161, 'a53550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '鹿泉', '会员a53650', 3, 19, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4162, 'a53650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '新乐', '会员a53750', 3, 27, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4163, 'a53750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '晋州', '会员a53850', 3, 2, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4164, 'a53850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '藁城', '会员a53950', 3, 16, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4165, 'a53950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '辛集', '会员a54050', 3, 21, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4166, 'a54050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '太原', '会员a54150', 3, 27, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4167, 'a54150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '长治', '会员a54250', 3, 24, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4168, 'a54250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '大同', '会员a54350', 3, 27, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4169, 'a54350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '阳泉', '会员a54450', 3, 21, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4170, 'a54450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '朔州', '会员a54550', 3, 31, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4171, 'a54550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '临汾', '会员a54650', 3, 21, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4172, 'a54650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '晋城', '会员a54750', 3, 20, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4173, 'a54750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '忻州', '会员a54850', 3, 10, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4174, 'a54850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '运城', '会员a54950', 3, 5, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4175, 'a54950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '晋中', '会员a55050', 3, 6, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4176, 'a55050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '吕梁', '会员a55150', 3, 3, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4177, 'a55150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '古交', '会员a55250', 3, 32, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4178, 'a55250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '潞城', '会员a55350', 3, 11, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4179, 'a55350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '高平', '会员a55450', 3, 13, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4180, 'a55450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '原平', '会员a55550', 3, 27, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4181, 'a55550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '孝义', '会员a55650', 3, 19, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4182, 'a55650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '汾阳', '会员a55750', 3, 16, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4183, 'a55750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '介休', '会员a55850', 3, 27, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4184, 'a55850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '侯马', '会员a55950', 3, 29, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4185, 'a55950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '霍州', '会员a56050', 3, 11, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4186, 'a56050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '永济', '会员a56150', 3, 26, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4187, 'a56150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '河津', '会员a56250', 3, 15, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4188, 'a56250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '沈阳', '会员a56350', 3, 5, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4189, 'a56350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '大连', '会员a56450', 3, 10, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4190, 'a56450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '本溪', '会员a56550', 3, 6, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4191, 'a56550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '阜新', '会员a56650', 3, 25, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4192, 'a56650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '葫芦岛', '会员a56750', 3, 13, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4193, 'a56750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '盘锦', '会员a56850', 3, 27, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4194, 'a56850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '铁岭', '会员a56950', 3, 19, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4195, 'a56950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '丹东', '会员a57050', 3, 20, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4196, 'a57050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '锦州', '会员a57150', 3, 29, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4197, 'a57150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '营口', '会员a57250', 3, 19, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4198, 'a57250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '鞍山', '会员a57350', 3, 15, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4199, 'a57350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '辽阳', '会员a57450', 3, 28, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4200, 'a57450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '抚顺', '会员a57550', 3, 22, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4201, 'a57550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '朝阳', '会员a57650', 3, 17, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4202, 'a57650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '瓦房店', '会员a57750', 3, 17, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4203, 'a57750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '兴城', '会员a57850', 3, 9, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4204, 'a57850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '新民', '会员a57950', 3, 18, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4205, 'a57950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '普兰店', '会员a58050', 3, 28, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4206, 'a58050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '庄河', '会员a58150', 3, 31, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4207, 'a58150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '北票', '会员a58250', 3, 17, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4208, 'a58250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '凌源', '会员a58350', 3, 4, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4209, 'a58350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '调兵山', '会员a58450', 3, 26, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4210, 'a58450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '开原', '会员a58550', 3, 32, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4211, 'a58550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '灯塔', '会员a58650', 3, 1, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4212, 'a58650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '海城', '会员a58750', 3, 32, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4213, 'a58750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '凤城', '会员a58850', 3, 27, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4214, 'a58850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '东港', '会员a58950', 3, 3, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4215, 'a58950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '大石桥', '会员a59050', 3, 14, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4216, 'a59050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '盖州', '会员a59150', 3, 15, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4217, 'a59150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '凌海', '会员a59250', 3, 31, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4218, 'a59250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '北镇', '会员a59350', 3, 26, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4219, 'a59350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '长春', '会员a59450', 3, 10, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4220, 'a59450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '白城', '会员a59550', 3, 10, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4221, 'a59550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '白山', '会员a59650', 3, 12, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4222, 'a59650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '吉林', '会员a59750', 3, 7, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4223, 'a59750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '辽源', '会员a59850', 3, 20, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4224, 'a59850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '四平', '会员a59950', 3, 27, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4225, 'a59950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '通化', '会员a60050', 3, 32, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4226, 'a60050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '松原', '会员a60150', 3, 28, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4227, 'a60150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '延边', '会员a60250', 3, 23, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4228, 'a60250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '珲春', '会员a60350', 3, 1, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4229, 'a60350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '龙井', '会员a60450', 3, 10, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4230, 'a60450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '舒兰', '会员a60550', 3, 16, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4231, 'a60550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '临江', '会员a60650', 3, 4, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4232, 'a60650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '公主岭', '会员a60750', 3, 6, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4233, 'a60750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '梅河口', '会员a60850', 3, 31, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4234, 'a60850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '德惠', '会员a60950', 3, 1, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4235, 'a60950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '九台', '会员a61050', 3, 10, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4236, 'a61050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '榆树', '会员a61150', 3, 12, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4237, 'a61150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '磐石', '会员a61250', 3, 10, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4238, 'a61250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '蛟河', '会员a61350', 3, 28, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4239, 'a61350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '桦甸', '会员a61450', 3, 29, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4240, 'a61450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '洮南', '会员a61550', 3, 29, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4241, 'a61550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '大安', '会员a61650', 3, 31, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4242, 'a61650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '双辽', '会员a61750', 3, 25, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4243, 'a61750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '集安', '会员a61850', 3, 6, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4244, 'a61850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '图们', '会员a61950', 3, 12, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4245, 'a61950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '敦化', '会员a62050', 3, 10, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4246, 'a62050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '和龙', '会员a62150', 3, 13, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4247, 'a62150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '哈尔滨', '会员a62250', 3, 17, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4248, 'a62250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '大庆', '会员a62350', 3, 32, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4249, 'a62350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '大兴安岭', '会员a62450', 3, 25, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4250, 'a62450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '鹤岗', '会员a62550', 3, 3, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4251, 'a62550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '黑河', '会员a62650', 3, 17, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4252, 'a62650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '鸡西', '会员a62750', 3, 32, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4253, 'a62750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '佳木斯', '会员a62850', 3, 18, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4254, 'a62850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '牡丹江', '会员a62950', 3, 26, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4255, 'a62950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '七台河', '会员a63050', 3, 23, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4256, 'a63050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '双鸭山', '会员a63150', 3, 20, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4257, 'a63150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '齐齐哈尔', '会员a63250', 3, 21, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4258, 'a63250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '伊春', '会员a63350', 3, 19, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4259, 'a63350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '绥化', '会员a63450', 3, 13, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4260, 'a63450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '虎林', '会员a63550', 3, 0, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4261, 'a63550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '五常', '会员a63650', 3, 9, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4262, 'a63650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '密山', '会员a63750', 3, 13, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4263, 'a63750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '宁安', '会员a63850', 3, 24, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4264, 'a63850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '漠河', '会员a63950', 3, 20, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4265, 'a63950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '海伦', '会员a64050', 3, 0, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4266, 'a64050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '肇东', '会员a64150', 3, 10, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4267, 'a64150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '安达', '会员a64250', 3, 26, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4268, 'a64250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '海林', '会员a64350', 3, 16, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4269, 'a64350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '绥芬河', '会员a64450', 3, 18, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4270, 'a64450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '富锦', '会员a64550', 3, 8, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4271, 'a64550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '同江', '会员a64650', 3, 10, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4272, 'a64650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '铁力', '会员a64750', 3, 5, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4273, 'a64750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '五大连池', '会员a64850', 3, 1, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4274, 'a64850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '北安', '会员a64950', 3, 9, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4275, 'a64950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '讷河', '会员a65050', 3, 18, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4276, 'a65050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '阿城', '会员a65150', 3, 22, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4277, 'a65150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '尚志', '会员a65250', 3, 3, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4278, 'a65250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '双城', '会员a65350', 3, 19, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4279, 'a65350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '南京', '会员a65450', 3, 4, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4280, 'a65450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '苏州', '会员a65550', 3, 16, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4281, 'a65550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '扬州', '会员a65650', 3, 16, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4282, 'a65650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '无锡', '会员a65750', 3, 27, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4283, 'a65750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '南通', '会员a65850', 3, 7, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4284, 'a65850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '常州', '会员a65950', 3, 21, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4285, 'a65950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '连云港', '会员a66050', 3, 13, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4286, 'a66050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '徐州', '会员a66150', 3, 30, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4287, 'a66150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '镇江', '会员a66250', 3, 16, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4288, 'a66250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '淮安', '会员a66350', 3, 22, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4289, 'a66350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '宿迁', '会员a66450', 3, 17, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4290, 'a66450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '泰州', '会员a66550', 3, 26, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4291, 'a66550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '太仓', '会员a66650', 3, 19, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4292, 'a66650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '盐城', '会员a66750', 3, 20, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4293, 'a66750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '高邮', '会员a66850', 3, 20, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4294, 'a66850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '新沂', '会员a66950', 3, 2, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4295, 'a66950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '金坛', '会员a67050', 3, 14, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4296, 'a67050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '溧阳', '会员a67150', 3, 17, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4297, 'a67150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '淮阴', '会员a67250', 3, 29, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4298, 'a67250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '江宁', '会员a67350', 3, 17, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4299, 'a67350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '睢宁', '会员a67450', 3, 18, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4300, 'a67450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '清江', '会员a67550', 3, 5, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4301, 'a67550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '昆山', '会员a67650', 3, 7, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4302, 'a67650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '常熟', '会员a67750', 3, 15, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4303, 'a67750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '江阴', '会员a67850', 3, 13, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4304, 'a67850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '宜兴', '会员a67950', 3, 12, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4305, 'a67950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '邳州', '会员a68050', 3, 31, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4306, 'a68050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '张家港', '会员a68150', 3, 23, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4307, 'a68150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '吴江', '会员a68250', 3, 10, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4308, 'a68250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '如皋', '会员a68350', 3, 15, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4309, 'a68350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '海门', '会员a68450', 3, 20, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4310, 'a68450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '启东', '会员a68550', 3, 6, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4311, 'a68550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '大丰', '会员a68650', 3, 23, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4312, 'a68650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '东台', '会员a68750', 3, 28, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4313, 'a68750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '仪征', '会员a68850', 3, 18, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4314, 'a68850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '扬中', '会员a68950', 3, 23, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4315, 'a68950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '句容', '会员a69050', 3, 29, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4316, 'a69050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '丹阳', '会员a69150', 3, 12, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4317, 'a69150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '兴化', '会员a69250', 3, 6, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4318, 'a69250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '姜堰', '会员a69350', 3, 29, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4319, 'a69350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '泰兴', '会员a69450', 3, 28, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4320, 'a69450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '靖江', '会员a69550', 3, 26, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4321, 'a69550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '杭州', '会员a69650', 3, 28, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4322, 'a69650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '宁波', '会员a69750', 3, 19, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4323, 'a69750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '温州', '会员a69850', 3, 15, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4324, 'a69850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '丽水', '会员a69950', 3, 7, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4325, 'a69950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '奉化', '会员a70050', 3, 24, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4326, 'a70050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '宁海', '会员a70150', 3, 6, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4327, 'a70150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '临海', '会员a70250', 3, 0, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4328, 'a70250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '三门', '会员a70350', 3, 32, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4329, 'a70350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '绍兴', '会员a70450', 3, 25, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4330, 'a70450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '舟山', '会员a70550', 3, 12, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4331, 'a70550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '义乌', '会员a70650', 3, 0, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4332, 'a70650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '北仑', '会员a70750', 3, 31, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4333, 'a70750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '慈溪', '会员a70850', 3, 30, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4334, 'a70850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '象山', '会员a70950', 3, 10, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4335, 'a70950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '余姚', '会员a71050', 3, 9, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4336, 'a71050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '天台', '会员a71150', 3, 11, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4337, 'a71150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '温岭', '会员a71250', 3, 9, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4338, 'a71250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '仙居', '会员a71350', 3, 25, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4339, 'a71350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '台州', '会员a71450', 3, 4, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4340, 'a71450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '嘉兴', '会员a71550', 3, 31, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4341, 'a71550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '湖州', '会员a71650', 3, 24, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4342, 'a71650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '衢州', '会员a71750', 3, 31, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4343, 'a71750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '金华', '会员a71850', 3, 0, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4344, 'a71850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '余杭', '会员a71950', 3, 7, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4345, 'a71950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '德清', '会员a72050', 3, 17, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4346, 'a72050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '海宁', '会员a72150', 3, 15, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4347, 'a72150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '临安', '会员a72250', 3, 18, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4348, 'a72250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '富阳', '会员a72350', 3, 29, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4349, 'a72350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '建德', '会员a72450', 3, 26, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4350, 'a72450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '平湖', '会员a72550', 3, 22, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4351, 'a72550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '桐乡', '会员a72650', 3, 32, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4352, 'a72650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '诸暨', '会员a72750', 3, 3, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4353, 'a72750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '上虞', '会员a72850', 3, 8, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4354, 'a72850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '嵊州', '会员a72950', 3, 12, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4355, 'a72950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '江山', '会员a73050', 3, 28, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4356, 'a73050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '兰溪', '会员a73150', 3, 13, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4357, 'a73150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '永康', '会员a73250', 3, 27, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4358, 'a73250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '东阳', '会员a73350', 3, 22, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4359, 'a73350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '瑞安', '会员a73450', 3, 16, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4360, 'a73450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '乐清', '会员a73550', 3, 18, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4361, 'a73550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '龙泉', '会员a73650', 3, 29, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4362, 'a73650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '合肥', '会员a73750', 3, 11, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4363, 'a73750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '黄山', '会员a73850', 3, 0, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4364, 'a73850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '芜湖', '会员a73950', 3, 3, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4365, 'a73950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '铜陵', '会员a74050', 3, 2, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4366, 'a74050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '安庆', '会员a74150', 3, 24, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4367, 'a74150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '滁州', '会员a74250', 3, 20, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4368, 'a74250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '宣城', '会员a74350', 3, 31, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4369, 'a74350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '阜阳', '会员a74450', 3, 8, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4370, 'a74450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '淮北', '会员a74550', 3, 13, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4371, 'a74550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '蚌埠', '会员a74650', 3, 26, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4372, 'a74650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '池州', '会员a74750', 3, 18, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4373, 'a74750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '青阳', '会员a74850', 3, 9, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4374, 'a74850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '九华山景区', '会员a74950', 3, 21, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4375, 'a74950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '黄山景区', '会员a75050', 3, 30, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4376, 'a75050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '巢湖', '会员a75150', 3, 10, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4377, 'a75150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '亳州', '会员a75250', 3, 28, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4378, 'a75250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '马鞍山', '会员a75350', 3, 6, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4379, 'a75350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '宿州', '会员a75450', 3, 7, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4380, 'a75450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '六安', '会员a75550', 3, 10, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4381, 'a75550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '淮南', '会员a75650', 3, 4, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4382, 'a75650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '绩溪', '会员a75750', 3, 6, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4383, 'a75750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '界首', '会员a75850', 3, 8, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4384, 'a75850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '明光', '会员a75950', 3, 11, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4385, 'a75950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '天长', '会员a76050', 3, 14, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4386, 'a76050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '桐城', '会员a76150', 3, 11, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4387, 'a76150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '宁国', '会员a76250', 3, 18, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4388, 'a76250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '福州', '会员a76350', 3, 23, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4389, 'a76350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '厦门', '会员a76450', 3, 29, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4390, 'a76450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '泉州', '会员a76550', 3, 26, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4391, 'a76550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '漳州', '会员a76650', 3, 23, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4392, 'a76650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '龙岩', '会员a76750', 3, 8, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4393, 'a76750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '三明', '会员a76850', 3, 2, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4394, 'a76850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '南平', '会员a76950', 3, 15, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4395, 'a76950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '永安', '会员a77050', 3, 13, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4396, 'a77050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '宁德', '会员a77150', 3, 14, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4397, 'a77150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '莆田', '会员a77250', 3, 16, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4398, 'a77250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '闽侯', '会员a77350', 3, 31, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4399, 'a77350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '福鼎', '会员a77450', 3, 28, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4400, 'a77450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '罗源', '会员a77550', 3, 26, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4401, 'a77550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '徐州', '会员182*****269', 3, 19, 0, 1, '', 0, 2, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4402, 'a77650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '天津', '会员189*****039', 3, 22, 0, 1, '', 0, 2, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4403, 'a77750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '澳门', '会员178*****504', 3, 16, 0, 1, '', 0, 2, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4404, 'a77850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '广西', '会员152*****774', 3, 14, 0, 1, '', 0, 2, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4405, 'a77950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '合肥', '会员176*****074', 3, 28, 0, 1, '', 0, 2, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4406, 'a78050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '北京', '会员151*****475', 3, 18, 0, 1, '', 0, 2, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4407, 'a78150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '厦门', '会员155*****793', 3, 27, 0, 1, '', 0, 2, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4408, 'a78250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '唐山', '会员130*****316', 3, 25, 0, 1, '', 0, 2, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4409, 'a78350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '江苏', '会员184*****077', 3, 19, 0, 1, '', 0, 2, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4410, 'a78450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '山西', '会员172*****260', 3, 1, 0, 1, '', 0, 2, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4411, 'a78550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '邵阳', '会员155*****983', 3, 15, 0, 1, '', 0, 2, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4412, 'a78650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '荆州', '会员139*****574', 3, 11, 0, 1, '', 0, 2, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4413, 'a78750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '龙海', '会员a78850', 3, 18, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4414, 'a78850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '南安', '会员a78950', 3, 27, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4415, 'a78950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '建瓯', '会员a79050', 3, 22, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4416, 'a79050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '武夷山', '会员a79150', 3, 12, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4417, 'a79150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '南昌', '会员a79250', 3, 17, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4418, 'a79250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '九江', '会员a79350', 3, 21, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4419, 'a79350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '赣州', '会员a79450', 3, 30, 0, 1, '', 0, 1, 1511778214, 1511778214, NULL, NULL, 0, 0, 0),
	(4420, 'a79450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '景德镇', '会员a79550', 3, 30, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4421, 'a79550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '萍乡', '会员a79650', 3, 14, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4422, 'a79650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '新余', '会员a79750', 3, 3, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4423, 'a79750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '吉安', '会员a79850', 3, 9, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4424, 'a79850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '宜春', '会员a79950', 3, 29, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4425, 'a79950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '抚州', '会员a80050', 3, 5, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4426, 'a80050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '上饶', '会员a80150', 3, 30, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4427, 'a80150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '鹰潭', '会员a80250', 3, 16, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4428, 'a80250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '陵川', '会员a80350', 3, 16, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4429, 'a80350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '瑞金', '会员a80450', 3, 13, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4430, 'a80450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '井冈山', '会员a80550', 3, 18, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4431, 'a80550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '瑞昌', '会员a80650', 3, 30, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4432, 'a80650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '乐平', '会员a80750', 3, 1, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4433, 'a80750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '南康', '会员a80850', 3, 28, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4434, 'a80850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '德兴', '会员a80950', 3, 25, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4435, 'a80950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '丰城', '会员a81050', 3, 1, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4436, 'a81050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '樟树', '会员a81150', 3, 31, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4437, 'a81150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '高安', '会员a81250', 3, 24, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4438, 'a81250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '贵溪', '会员a81350', 3, 0, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4439, 'a81350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '济南', '会员a81450', 3, 3, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4440, 'a81450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '青岛', '会员a81550', 3, 11, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4441, 'a81550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '烟台', '会员a81650', 3, 10, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4442, 'a81650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '威海', '会员a81750', 3, 15, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4443, 'a81750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '潍坊', '会员a81850', 3, 23, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4444, 'a81850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '德州', '会员a81950', 3, 29, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4445, 'a81950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '滨州', '会员a82050', 3, 7, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4446, 'a82050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '东营', '会员a82150', 3, 23, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4447, 'a82150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '聊城', '会员a82250', 3, 22, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4448, 'a82250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '菏泽', '会员a82350', 3, 2, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4449, 'a82350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '济宁', '会员a82450', 3, 6, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4450, 'a82450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '临沂', '会员a82550', 3, 32, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4451, 'a82550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '淄博', '会员a82650', 3, 28, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4452, 'a82650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '泰安', '会员a82750', 3, 18, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4453, 'a82750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '枣庄', '会员a82850', 3, 23, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4454, 'a82850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '日照', '会员a82950', 3, 9, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4455, 'a82950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '莱芜', '会员a83050', 3, 6, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4456, 'a83050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '海阳', '会员a83150', 3, 20, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4457, 'a83150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '平度', '会员a83250', 3, 13, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4458, 'a83250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '莱阳', '会员a83350', 3, 31, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4459, 'a83350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '青州', '会员a83450', 3, 4, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4460, 'a83450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '肥城', '会员a83550', 3, 29, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4461, 'a83550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '章丘', '会员a83650', 3, 16, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4462, 'a83650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '即墨', '会员a83750', 3, 10, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4463, 'a83750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '利津', '会员a83850', 3, 20, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4464, 'a83850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '武城', '会员a83950', 3, 3, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4465, 'a83950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '桓台', '会员a84050', 3, 10, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4466, 'a84050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '沂源', '会员a84150', 3, 10, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4467, 'a84150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '曲阜', '会员a84250', 3, 0, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4468, 'a84250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '龙口', '会员a84350', 3, 6, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4469, 'a84350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '胶州', '会员a84450', 3, 19, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4470, 'a84450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '胶南', '会员a84550', 3, 13, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4471, 'a84550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '莱西', '会员a84650', 3, 24, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4472, 'a84650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '临清', '会员a84750', 3, 22, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4473, 'a84750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '乐陵', '会员a84850', 3, 31, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4474, 'a84850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '禹城', '会员a84950', 3, 27, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4475, 'a84950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '安丘', '会员a85050', 3, 27, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4476, 'a85050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '昌邑', '会员a85150', 3, 32, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4477, 'a85150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '高密', '会员a85250', 3, 10, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4478, 'a85250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '诸城', '会员a85350', 3, 3, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4479, 'a85350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '寿光', '会员a85450', 3, 13, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4480, 'a85450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '栖霞', '会员a85550', 3, 18, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4481, 'a85550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '莱州', '会员a85650', 3, 0, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4482, 'a85650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '蓬莱', '会员a85750', 3, 7, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4483, 'a85750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '招远', '会员a85850', 3, 19, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4484, 'a85850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '文登', '会员a85950', 3, 27, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4485, 'a85950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '荣成', '会员a86050', 3, 10, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4486, 'a86050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '乳山', '会员a86150', 3, 2, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4487, 'a86150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '滕州', '会员a86250', 3, 2, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4488, 'a86250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '兖州', '会员a86350', 3, 11, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4489, 'a86350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '邹城', '会员a86450', 3, 21, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4490, 'a86450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '新泰', '会员a86550', 3, 25, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4491, 'a86550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '郑州', '会员a86650', 3, 9, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4492, 'a86650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '安阳', '会员a86750', 3, 6, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4493, 'a86750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '济源', '会员a86850', 3, 4, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4494, 'a86850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '鹤壁', '会员a86950', 3, 8, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4495, 'a86950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '焦作', '会员a87050', 3, 32, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4496, 'a87050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '开封', '会员a87150', 3, 31, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4497, 'a87150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '濮阳', '会员a87250', 3, 28, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4498, 'a87250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '三门峡', '会员a87350', 3, 21, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4499, 'a87350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '驻马店', '会员a87450', 3, 9, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4500, 'a87450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '商丘', '会员a87550', 3, 8, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4501, 'a87550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '新乡', '会员a87650', 3, 29, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4502, 'a87650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '信阳', '会员a87750', 3, 19, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4503, 'a87750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '许昌', '会员a87850', 3, 21, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4504, 'a87850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '周口', '会员a87950', 3, 17, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4505, 'a87950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '南阳', '会员a88050', 3, 6, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4506, 'a88050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '洛阳', '会员a88150', 3, 15, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4507, 'a88150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '平顶山', '会员a88250', 3, 32, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4508, 'a88250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '漯河', '会员a88350', 3, 25, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4509, 'a88350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '中牟', '会员a88450', 3, 4, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4510, 'a88450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '洛宁', '会员a88550', 3, 4, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4511, 'a88550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '荥阳', '会员a88650', 3, 7, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4512, 'a88650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '登封', '会员a88750', 3, 15, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4513, 'a88750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '项城', '会员a88850', 3, 11, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4514, 'a88850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '灵宝', '会员a88950', 3, 15, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4515, 'a88950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '义马', '会员a89050', 3, 24, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4516, 'a89050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '舞钢', '会员a89150', 3, 20, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4517, 'a89150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '长葛', '会员a89250', 3, 5, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4518, 'a89250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '禹州', '会员a89350', 3, 14, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4519, 'a89350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '林州', '会员a89450', 3, 19, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4520, 'a89450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '辉县', '会员a89550', 3, 13, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4521, 'a89550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '卫辉', '会员a89650', 3, 4, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4522, 'a89650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '沁阳', '会员a89750', 3, 18, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4523, 'a89750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '孟州', '会员a89850', 3, 30, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4524, 'a89850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '偃师', '会员a89950', 3, 16, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4525, 'a89950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '新密', '会员a90050', 3, 20, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4526, 'a90050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '登封', '会员a90150', 3, 0, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4527, 'a90150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '新郑', '会员a90250', 3, 25, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4528, 'a90250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '汝州', '会员a90350', 3, 18, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4529, 'a90350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '永城', '会员a90450', 3, 4, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4530, 'a90450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '邓州', '会员a90550', 3, 14, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4531, 'a90550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '巩义', '会员a90650', 3, 14, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4532, 'a90650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '武汉', '会员a90750', 3, 0, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4533, 'a90750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '十堰', '会员a90850', 3, 12, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4534, 'a90850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '宜昌', '会员a90950', 3, 20, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4535, 'a90950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '鄂州', '会员a91050', 3, 7, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4536, 'a91050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '黄石', '会员a91150', 3, 31, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4537, 'a91150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '襄樊', '会员a91250', 3, 25, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4538, 'a91250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '荆州', '会员a91350', 3, 14, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4539, 'a91350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '荆门', '会员a91450', 3, 7, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4540, 'a91450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '孝感', '会员a91550', 3, 11, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4541, 'a91550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '黄冈', '会员a91650', 3, 27, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4542, 'a91650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '咸宁', '会员a91750', 3, 24, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4543, 'a91750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '随州', '会员a91850', 3, 4, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4544, 'a91850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '恩施', '会员a91950', 3, 12, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4545, 'a91950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '仙桃', '会员a92050', 3, 29, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4546, 'a92050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '天门', '会员a92150', 3, 27, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4547, 'a92150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '潜江', '会员a92250', 3, 28, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4548, 'a92250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '神农架', '会员a92350', 3, 31, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4549, 'a92350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '沙市', '会员a92450', 3, 21, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4550, 'a92450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '老河口', '会员a92550', 3, 19, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4551, 'a92550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '利川', '会员a92650', 3, 6, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4552, 'a92650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '当阳', '会员a92750', 3, 1, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4553, 'a92750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '枝江', '会员a92850', 3, 1, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4554, 'a92850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '宜都', '会员a92950', 3, 24, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4555, 'a92950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '松滋', '会员a93050', 3, 27, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4556, 'a93050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '洪湖', '会员a93150', 3, 10, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4557, 'a93150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '石首', '会员a93250', 3, 13, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4558, 'a93250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '赤壁', '会员a93350', 3, 17, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4559, 'a93350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '大冶', '会员a93450', 3, 18, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4560, 'a93450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '麻城', '会员a93550', 3, 31, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4561, 'a93550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '武穴', '会员a93650', 3, 30, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4562, 'a93650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '广水', '会员a93750', 3, 21, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4563, 'a93750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '安陆', '会员a93850', 3, 10, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4564, 'a93850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '应城', '会员a93950', 3, 5, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4565, 'a93950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '汉川', '会员a94050', 3, 30, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4566, 'a94050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '钟祥', '会员a94150', 3, 22, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4567, 'a94150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '宜城', '会员a94250', 3, 9, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4568, 'a94250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '枣阳', '会员a94350', 3, 21, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4569, 'a94350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '丹江口', '会员a94450', 3, 30, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4570, 'a94450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '长沙', '会员a94550', 3, 19, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4571, 'a94550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '张家界', '会员a94650', 3, 4, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4572, 'a94650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '株洲', '会员a94750', 3, 10, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4573, 'a94750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '韶山', '会员a94850', 3, 28, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4574, 'a94850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '衡阳', '会员a94950', 3, 1, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4575, 'a94950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '郴州', '会员a95050', 3, 20, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4576, 'a95050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '冷水江', '会员a95150', 3, 28, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4577, 'a95150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '娄底', '会员a95250', 3, 28, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4578, 'a95250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '耒阳', '会员a95350', 3, 9, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4579, 'a95350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '永州', '会员a95450', 3, 3, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4580, 'a95450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '湘乡', '会员a95550', 3, 20, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4581, 'a95550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '湘潭', '会员a95650', 3, 32, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4582, 'a95650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '常德', '会员a95750', 3, 29, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4583, 'a95750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '益阳', '会员a95850', 3, 14, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4584, 'a95850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '怀化', '会员a95950', 3, 8, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4585, 'a95950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '邵阳', '会员a96050', 3, 5, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4586, 'a96050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '岳阳', '会员a96150', 3, 24, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4587, 'a96150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '吉首', '会员a96250', 3, 31, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4588, 'a96250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '大庸', '会员a96350', 3, 28, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4589, 'a96350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '韶山', '会员a96450', 3, 23, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4590, 'a96450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '常宁', '会员a96550', 3, 2, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4591, 'a96550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '浏阳', '会员a96650', 3, 16, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4592, 'a96650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '津市', '会员a96750', 3, 31, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4593, 'a96750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '沅江', '会员a96850', 3, 7, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4594, 'a96850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '汨罗', '会员a96950', 3, 24, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4595, 'a96950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '临湘', '会员a97050', 3, 28, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4596, 'a97050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '醴陵', '会员a97150', 3, 28, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4597, 'a97150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '资兴', '会员a97250', 3, 9, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4598, 'a97250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '武冈', '会员a97350', 3, 8, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4599, 'a97350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '洪江', '会员a97450', 3, 2, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4600, 'a97450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '广州', '会员a97550', 3, 29, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4601, 'a97550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '深圳', '会员a97650', 3, 5, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4602, 'a97650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '珠海', '会员a97750', 3, 17, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4603, 'a97750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '东莞', '会员a97850', 3, 22, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4604, 'a97850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '佛山', '会员a97950', 3, 28, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4605, 'a97950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '潮州', '会员a98050', 3, 1, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4606, 'a98050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '汕头', '会员a98150', 3, 22, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4607, 'a98150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '湛江', '会员a98250', 3, 9, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4608, 'a98250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '中山', '会员a98350', 3, 11, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4609, 'a98350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '惠州', '会员a98450', 3, 23, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4610, 'a98450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '河源', '会员a98550', 3, 25, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4611, 'a98550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '揭阳', '会员a98650', 3, 16, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4612, 'a98650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '梅州', '会员a98750', 3, 29, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4613, 'a98750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '肇庆', '会员a98850', 3, 29, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4614, 'a98850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '茂名', '会员a98950', 3, 10, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4615, 'a98950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '云浮', '会员a99050', 3, 13, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4616, 'a99050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '阳江', '会员a99150', 3, 13, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4617, 'a99150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '江门', '会员a99250', 3, 11, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4618, 'a99250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '韶关', '会员a99350', 3, 15, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4619, 'a99350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '乐昌', '会员a99450', 3, 17, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4620, 'a99450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '化州', '会员a99550', 3, 24, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4621, 'a99550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '从化', '会员a99650', 3, 10, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4622, 'a99650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '鹤山', '会员a99750', 3, 31, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4623, 'a99750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '汕尾', '会员a99850', 3, 20, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4624, 'a99850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '清远', '会员a99950', 3, 22, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4625, 'a99950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '顺德', '会员a100050', 3, 7, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4626, 'a100050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '雷州', '会员a100150', 3, 31, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4627, 'a100150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '廉江', '会员a100250', 3, 4, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4628, 'a100250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '吴川', '会员a100350', 3, 18, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4629, 'a100350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '高州', '会员a100450', 3, 5, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4630, 'a100450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '信宜', '会员a100550', 3, 28, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4631, 'a100550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '阳春', '会员a100650', 3, 28, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4632, 'a100650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '罗定', '会员a100750', 3, 31, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4633, 'a100750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '四会', '会员a100850', 3, 8, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4634, 'a100850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '高要', '会员a100950', 3, 20, 0, 1, '', 0, 1, 1511778215, 1511778215, NULL, NULL, 0, 0, 0),
	(4635, 'a100950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '开平', '会员a101050', 3, 21, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4636, 'a101050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '台山', '会员a101150', 3, 4, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4637, 'a101150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '恩平', '会员a101250', 3, 19, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4638, 'a101250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '陆丰', '会员a101350', 3, 12, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4639, 'a101350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '普宁', '会员a101450', 3, 29, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4640, 'a101450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '兴宁', '会员a101550', 3, 20, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4641, 'a101550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '南雄', '会员a101650', 3, 10, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4642, 'a101650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '连州', '会员a101750', 3, 19, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4643, 'a101750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '英德', '会员a101850', 3, 20, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4644, 'a101850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '增城', '会员a101950', 3, 12, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4645, 'a101950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '南宁', '会员a102050', 3, 18, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4646, 'a102050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '柳州', '会员a102150', 3, 20, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4647, 'a102150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '北海', '会员a102250', 3, 4, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4648, 'a102250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '百色', '会员a102350', 3, 12, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4649, 'a102350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '梧州', '会员a102450', 3, 9, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4650, 'a102450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '贺州', '会员a102550', 3, 18, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4651, 'a102550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '玉林', '会员a102650', 3, 14, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4652, 'a102650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '河池', '会员a102750', 3, 6, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4653, 'a102750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '桂林', '会员a102850', 3, 25, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4654, 'a102850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '钦州', '会员a102950', 3, 21, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4655, 'a102950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '防城港', '会员a103050', 3, 1, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4656, 'a103050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '来宾', '会员a103150', 3, 5, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4657, 'a103150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '崇左', '会员a103250', 3, 11, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4658, 'a103250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '贵港', '会员a103350', 3, 21, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4659, 'a103350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '北流', '会员a103450', 3, 22, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4660, 'a103450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '宜州', '会员a103550', 3, 23, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4661, 'a103550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '桂平', '会员a103650', 3, 30, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4662, 'a103650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '岑溪', '会员a103750', 3, 12, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4663, 'a103750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '东兴', '会员a103850', 3, 17, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4664, 'a103850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '凭祥', '会员a103950', 3, 13, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4665, 'a103950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '合山', '会员a104050', 3, 18, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4666, 'a104050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '海口', '会员a104150', 3, 27, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4667, 'a104150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '三亚', '会员a104250', 3, 32, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4668, 'a104250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '琼海', '会员a104350', 3, 26, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4669, 'a104350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '儋州', '会员a104450', 3, 0, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4670, 'a104450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '文昌', '会员a104550', 3, 29, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4671, 'a104550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '万宁', '会员a104650', 3, 25, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4672, 'a104650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '东方', '会员a104750', 3, 2, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4673, 'a104750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '五指山', '会员a104850', 3, 25, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4674, 'a104850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '成都', '会员a104950', 3, 17, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4675, 'a104950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '内江', '会员a105050', 3, 4, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4676, 'a105050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '峨眉山', '会员a105150', 3, 21, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4677, 'a105150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '绵阳', '会员a105250', 3, 32, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4678, 'a105250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '宜宾', '会员a105350', 3, 18, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4679, 'a105350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '泸州', '会员a105450', 3, 2, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4680, 'a105450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '攀枝花', '会员a105550', 3, 18, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4681, 'a105550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '自贡', '会员a105650', 3, 10, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4682, 'a105650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '资阳', '会员a105750', 3, 2, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4683, 'a105750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '崇州', '会员a105850', 3, 17, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4684, 'a105850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '西昌', '会员a105950', 3, 8, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4685, 'a105950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '都江堰', '会员a106050', 3, 32, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4686, 'a106050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '遂宁', '会员a106150', 3, 4, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4687, 'a106150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '乐山', '会员a106250', 3, 27, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4688, 'a106250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '达州', '会员a106350', 3, 4, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4689, 'a106350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '江油', '会员a106450', 3, 27, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4690, 'a106450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '大邑', '会员a106550', 3, 27, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4691, 'a106550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '金堂', '会员a106650', 3, 0, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4692, 'a106650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '德阳', '会员a106750', 3, 25, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4693, 'a106750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '南充', '会员a106850', 3, 29, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4694, 'a106850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '广安', '会员a106950', 3, 26, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4695, 'a106950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '广元', '会员a107050', 3, 19, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4696, 'a107050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '巴中', '会员a107150', 3, 22, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4697, 'a107150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '雅安', '会员a107250', 3, 1, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4698, 'a107250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '眉山', '会员a107350', 3, 18, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4699, 'a107350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '阿坝', '会员a107450', 3, 31, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4700, 'a107450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '甘孜', '会员a107550', 3, 20, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4701, 'a107550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '三台', '会员a107650', 3, 27, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4702, 'a107650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '丹棱', '会员a107750', 3, 26, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4703, 'a107750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '梁平', '会员a107850', 3, 12, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4704, 'a107850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '万县', '会员a107950', 3, 13, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4705, 'a107950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '广汉', '会员a108050', 3, 15, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4706, 'a108050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '汶川县', '会员a108150', 3, 22, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4707, 'a108150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '什邡', '会员a108250', 3, 28, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4708, 'a108250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '彭州', '会员a108350', 3, 30, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4709, 'a108350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '绵竹', '会员a108450', 3, 14, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4710, 'a108450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '邛崃', '会员a108550', 3, 32, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4711, 'a108550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '阆中', '会员a108650', 3, 19, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4712, 'a108650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '华蓥', '会员a108750', 3, 21, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4713, 'a108750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '万源', '会员a108850', 3, 15, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4714, 'a108850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '简阳', '会员a108950', 3, 14, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4715, 'a108950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '贵阳', '会员a109050', 3, 21, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4716, 'a109050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '安顺', '会员a109150', 3, 25, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4717, 'a109150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '铜仁', '会员a109250', 3, 8, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4718, 'a109250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '六盘水', '会员a109350', 3, 20, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4719, 'a109350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '遵义', '会员a109450', 3, 26, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4720, 'a109450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '毕节', '会员a109550', 3, 12, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4721, 'a109550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '兴义', '会员a109650', 3, 24, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4722, 'a109650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '凯里', '会员a109750', 3, 18, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4723, 'a109750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '都匀', '会员a109850', 3, 3, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4724, 'a109850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '福泉', '会员a109950', 3, 6, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4725, 'a109950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '仁怀', '会员a110050', 3, 24, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4726, 'a110050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '赤水', '会员a110150', 3, 3, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4727, 'a110150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '清镇', '会员a110250', 3, 32, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4728, 'a110250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '昆明', '会员a110350', 3, 3, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4729, 'a110350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '西双版纳', '会员a110450', 3, 9, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4730, 'a110450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '大理', '会员a110550', 3, 11, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4731, 'a110550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '德宏', '会员a110650', 3, 24, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4732, 'a110650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '思茅', '会员a110750', 3, 9, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4733, 'a110750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '玉溪', '会员a110850', 3, 20, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4734, 'a110850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '曲靖', '会员a110950', 3, 30, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4735, 'a110950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '保山', '会员a111050', 3, 1, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4736, 'a111050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '昭通', '会员a111150', 3, 10, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4737, 'a111150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '临沧', '会员a111250', 3, 1, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4738, 'a111250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '丽江', '会员a111350', 3, 6, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4739, 'a111350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '文山', '会员a111450', 3, 27, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4740, 'a111450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '个旧', '会员a111550', 3, 12, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4741, 'a111550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '楚雄', '会员a111650', 3, 6, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4742, 'a111650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '迪庆', '会员a111750', 3, 25, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4743, 'a111750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '宜良', '会员a111850', 3, 16, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4744, 'a111850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '沅江', '会员a111950', 3, 13, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4745, 'a111950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '安宁', '会员a112050', 3, 16, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4746, 'a112050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '宣威', '会员a112150', 3, 10, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4747, 'a112150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '瑞丽', '会员a112250', 3, 15, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4748, 'a112250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '开远', '会员a112350', 3, 24, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4749, 'a112350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '景洪', '会员a112450', 3, 15, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4750, 'a112450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '拉萨', '会员a112550', 3, 6, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4751, 'a112550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '那曲', '会员a112650', 3, 5, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4752, 'a112650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '昌都', '会员a112750', 3, 10, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4753, 'a112750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '山南', '会员a112850', 3, 29, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4754, 'a112850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '日喀则', '会员a112950', 3, 8, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4755, 'a112950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '阿里', '会员a113050', 3, 23, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4756, 'a113050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '林芝', '会员a113150', 3, 3, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4757, 'a113150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '西安', '会员a113250', 3, 24, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4758, 'a113250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '宝鸡', '会员a113350', 3, 15, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4759, 'a113350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '延安', '会员a113450', 3, 2, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4760, 'a113450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '兴平', '会员a113550', 3, 19, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4761, 'a113550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '咸阳', '会员a113650', 3, 11, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4762, 'a113650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '铜川', '会员a113750', 3, 5, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4763, 'a113750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '渭南', '会员a113850', 3, 6, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4764, 'a113850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '汉中', '会员a113950', 3, 5, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4765, 'a113950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '榆林', '会员a114050', 3, 6, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4766, 'a114050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '安康', '会员a114150', 3, 5, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4767, 'a114150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '商洛', '会员a114250', 3, 22, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4768, 'a114250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '周至', '会员a114350', 3, 13, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4769, 'a114350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '韩城', '会员a114450', 3, 9, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4770, 'a114450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '华阴', '会员a114550', 3, 16, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4771, 'a114550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '兰州', '会员a114650', 3, 1, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4772, 'a114650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '嘉峪关', '会员a114750', 3, 24, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4773, 'a114750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '酒泉', '会员a114850', 3, 29, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4774, 'a114850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '临夏', '会员a114950', 3, 4, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4775, 'a114950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '白银', '会员a115050', 3, 28, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4776, 'a115050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '天水', '会员a115150', 3, 29, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4777, 'a115150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '武威', '会员a115250', 3, 28, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4778, 'a115250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '张掖', '会员a115350', 3, 10, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4779, 'a115350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '平凉', '会员a115450', 3, 10, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4780, 'a115450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '庆阳', '会员a115550', 3, 5, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4781, 'a115550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '定西', '会员a115650', 3, 9, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4782, 'a115650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '陇南', '会员a115750', 3, 3, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4783, 'a115750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '甘南', '会员a115850', 3, 7, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4784, 'a115850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '敦煌', '会员a115950', 3, 21, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4785, 'a115950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '金昌', '会员a116050', 3, 25, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4786, 'a116050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '玉门', '会员a116150', 3, 22, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4787, 'a116150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '西宁', '会员a116250', 3, 12, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4788, 'a116250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '海东', '会员a116350', 3, 0, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4789, 'a116350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '海北', '会员a116450', 3, 17, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4790, 'a116450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '黄南', '会员a116550', 3, 7, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4791, 'a116550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '海南', '会员a116650', 3, 9, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4792, 'a116650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '果洛', '会员a116750', 3, 2, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4793, 'a116750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '海西', '会员a116850', 3, 21, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4794, 'a116850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '玉树', '会员a116950', 3, 7, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4795, 'a116950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '格尔木', '会员a117050', 3, 11, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4796, 'a117050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '呼和浩特', '会员a117150', 3, 31, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4797, 'a117150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '呼伦贝尔', '会员a117250', 3, 12, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4798, 'a117250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '包头', '会员a117350', 3, 21, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4799, 'a117350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '赤峰', '会员a117450', 3, 10, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4800, 'a117450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '鄂尔多斯', '会员a117550', 3, 17, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4801, 'a117550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '巴彦淖尔盟', '会员a117650', 3, 28, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4802, 'a117650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '阿拉善盟', '会员a117750', 3, 11, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4803, 'a117750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '兴安盟', '会员a117850', 3, 9, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4804, 'a117850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '通辽', '会员a117950', 3, 5, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4805, 'a117950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '乌海', '会员a118050', 3, 15, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4806, 'a118050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '乌兰察布盟', '会员a118150', 3, 19, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4807, 'a118150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '锡林郭勒盟', '会员a118250', 3, 14, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4808, 'a118250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '满洲里', '会员a118350', 3, 19, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4809, 'a118350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '扎兰屯', '会员a118450', 3, 28, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4810, 'a118450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '牙克石', '会员a118550', 3, 27, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4811, 'a118550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '根河', '会员a118650', 3, 17, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4812, 'a118650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '额尔古纳', '会员a118750', 3, 4, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4813, 'a118750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '阿尔山', '会员a118850', 3, 27, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4814, 'a118850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '霍林郭勒', '会员a118950', 3, 18, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4815, 'a118950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '二连浩特', '会员a119050', 3, 20, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4816, 'a119050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '丰镇', '会员a119150', 3, 19, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4817, 'a119150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '银川', '会员a119250', 3, 31, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4818, 'a119250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '石嘴山', '会员a119350', 3, 8, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4819, 'a119350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '吴忠', '会员a119450', 3, 4, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4820, 'a119450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '固原', '会员a119550', 3, 7, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4821, 'a119550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '中卫', '会员a119650', 3, 6, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4822, 'a119650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '灵武', '会员a119750', 3, 10, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4823, 'a119750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '青铜峡', '会员a119850', 3, 15, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4824, 'a119850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '乌鲁木齐', '会员a119950', 3, 23, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4825, 'a119950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '克拉玛依', '会员a120050', 3, 17, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4826, 'a120050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '哈密', '会员a120150', 3, 32, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4827, 'a120150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '喀什', '会员a120250', 3, 3, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4828, 'a120250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '吐鲁番', '会员a120350', 3, 15, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4829, 'a120350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '石河子', '会员a120450', 3, 6, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4830, 'a120450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '图木舒克', '会员a120550', 3, 14, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4831, 'a120550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '和田', '会员a120650', 3, 23, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4832, 'a120650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '昌吉', '会员a120750', 3, 30, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4833, 'a120750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '阿图什', '会员a120850', 3, 28, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4834, 'a120850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '库尔勒', '会员a120950', 3, 14, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4835, 'a120950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '博乐', '会员a121050', 3, 13, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4836, 'a121050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '伊宁', '会员a121150', 3, 12, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4837, 'a121150', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '阿拉尔', '会员a121250', 3, 20, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4838, 'a121250', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '阿克苏', '会员a121350', 3, 29, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4839, 'a121350', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '五家渠', '会员a121450', 3, 15, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4840, 'a121450', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '北屯', '会员a121550', 3, 26, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4841, 'a121550', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '阜康', '会员a121650', 3, 10, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4842, 'a121650', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '米泉', '会员a121750', 3, 28, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4843, 'a121750', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '奎屯', '会员a121850', 3, 20, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4844, 'a121850', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '塔城', '会员a121950', 3, 19, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4845, 'a121950', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '乌苏', '会员a122050', 3, 11, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0),
	(4846, 'a122050', '@!#$qaz', 'robot@!#$qaz', '8.8.8.8', NULL, '阿勒泰', '会员a122150', 3, 4, 0, 1, '', 0, 1, 1511778216, 1511778216, NULL, NULL, 0, 0, 0);
/*!40000 ALTER TABLE `account_t` ENABLE KEYS */;

-- Dumping structure for table newstars.activity_t
CREATE TABLE IF NOT EXISTS `activity_t` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `type` int(11) DEFAULT NULL COMMENT '1：连赢活动',
  `gameid` int(11) NOT NULL DEFAULT '0' COMMENT '平台',
  `gamekindid` int(11) DEFAULT NULL COMMENT '游戏类型',
  `roomids` varchar(200) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL COMMENT '游戏房间',
  `name` varchar(45) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL COMMENT '活动名称',
  `texttime` varchar(45) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL COMMENT '活动时间',
  `textdescribe` varchar(10000) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL COMMENT '活动描述',
  `active` tinyint(1) DEFAULT '0' COMMENT '0:未开启 1:已开启',
  `duplicate` tinyint(1) DEFAULT '0' COMMENT '0:重复 1:不重复',
  `starttime` bigint(20) DEFAULT NULL COMMENT '开始时间',
  `endtime` bigint(20) DEFAULT NULL COMMENT '结束时间',
  `dupstarttime` bigint(20) DEFAULT NULL COMMENT '重复开始时间',
  `dupendtime` bigint(20) DEFAULT NULL COMMENT '重复结束时间',
  `dupdaysofweek` varchar(45) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL COMMENT '1-2-4-..',
  `duptime` varchar(45) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL COMMENT '重复时间段',
  `status` tinyint(1) DEFAULT '0' COMMENT '0：未发布 1:发布',
  `updatetime` bigint(20) DEFAULT NULL COMMENT '更新时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='活动表';

-- Dumping data for table newstars.activity_t: ~0 rows (大约)
/*!40000 ALTER TABLE `activity_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `activity_t` ENABLE KEYS */;

-- Dumping structure for table newstars.activity_winner_t
CREATE TABLE IF NOT EXISTS `activity_winner_t` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `activityid` int(11) NOT NULL COMMENT '活动ID',
  `rank` int(11) NOT NULL COMMENT '排名',
  `userid` int(11) NOT NULL COMMENT '用户ID',
  `username` varchar(45) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT '' COMMENT '用户名',
  `times` int(11) NOT NULL COMMENT '连赢次数',
  `payoff` decimal(18,3) DEFAULT '0.000' COMMENT '活动中赢取金额',
  `award` decimal(18,3) DEFAULT '0.000' COMMENT '奖励金币',
  `status` tinyint(1) DEFAULT '0' COMMENT '0：未发奖 1:已发奖',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='活动获奖表';

-- Dumping data for table newstars.activity_winner_t: ~0 rows (大约)
/*!40000 ALTER TABLE `activity_winner_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `activity_winner_t` ENABLE KEYS */;

-- Dumping structure for table newstars.address_t
CREATE TABLE IF NOT EXISTS `address_t` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `game_id` int(11) NOT NULL DEFAULT '0' COMMENT '平台',
  `website` text CHARACTER SET utf8 COLLATE utf8_bin COMMENT '官网',
  `gamesite_chinese` text CHARACTER SET utf8 COLLATE utf8_bin COMMENT '国内服务器',
  `gamesite_foreign` text CHARACTER SET utf8 COLLATE utf8_bin COMMENT '国外服务器',
  `updatesite` text CHARACTER SET utf8 COLLATE utf8_bin COMMENT '热更服务器',
  `updatesite_foreign` text CHARACTER SET utf8 COLLATE utf8_bin,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8 COLLATE=utf8_bin ROW_FORMAT=DYNAMIC COMMENT='服务器列表';

-- Dumping data for table newstars.address_t: ~0 rows (大约)
/*!40000 ALTER TABLE `address_t` DISABLE KEYS */;
INSERT INTO `address_t` (`id`, `game_id`, `website`, `gamesite_chinese`, `gamesite_foreign`, `updatesite`, `updatesite_foreign`) VALUES
	(1, 0, '192.168.1.8', '192.168.1.8', '192.168.1.8', '192.168.1.8', NULL);
/*!40000 ALTER TABLE `address_t` ENABLE KEYS */;

-- Dumping structure for table newstars.agency_exchange_t
CREATE TABLE IF NOT EXISTS `agency_exchange_t` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `channel` tinyint(4) NOT NULL DEFAULT '0' COMMENT '兑换渠道',
  `kid` int(11) NOT NULL COMMENT '渠道商兑换记录id',
  `submit_money` decimal(18,2) NOT NULL DEFAULT '0.00' COMMENT '提交金额',
  `ex_name` varchar(45) NOT NULL COMMENT '提现名字',
  `ex_account` varchar(128) NOT NULL DEFAULT '' COMMENT '提现账号',
  `status` tinyint(4) NOT NULL DEFAULT '0' COMMENT '提现状态',
  `tradeno` varchar(64) DEFAULT NULL COMMENT '流水号',
  `orderamount` decimal(18,2) DEFAULT NULL COMMENT '实际转账金额',
  `orderid` varchar(45) DEFAULT NULL COMMENT '订单号',
  `payaccount` varchar(45) DEFAULT NULL COMMENT '执行转账的支付宝账户',
  `bankcode` varchar(45) DEFAULT NULL COMMENT '银行代码',
  `telephone` varchar(45) DEFAULT NULL COMMENT '手机号',
  `arrivaltime` bigint(20) DEFAULT '0' COMMENT '回调时间',
  `resultmsg` varchar(128) DEFAULT '' COMMENT '回调信息',
  `platform` int(11) NOT NULL DEFAULT '0' COMMENT '平台',
  PRIMARY KEY (`id`),
  UNIQUE KEY `k_id_UNIQUE` (`kid`),
  UNIQUE KEY `orderid_UNIQUE` (`orderid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='渠道商兑换订单';

-- Dumping data for table newstars.agency_exchange_t: ~0 rows (大约)
/*!40000 ALTER TABLE `agency_exchange_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `agency_exchange_t` ENABLE KEYS */;

-- Dumping structure for table newstars.agency_t
CREATE TABLE IF NOT EXISTS `agency_t` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `name` varchar(45) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '代理商名称',
  `device` tinyint(4) NOT NULL DEFAULT '0' COMMENT '设备类型',
  `wechat` varchar(50) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL COMMENT '微信',
  `q_q` varchar(50) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL COMMENT 'qq',
  `user_id` int(11) NOT NULL COMMENT '账号id',
  `work` tinyint(1) NOT NULL DEFAULT '0' COMMENT '上班状态',
  `is_show` tinyint(1) DEFAULT '0' COMMENT '展示状态',
  `platformid` int(11) DEFAULT '-1' COMMENT '渠道id',
  `game_id` int(11) NOT NULL DEFAULT '0' COMMENT '平台',
  PRIMARY KEY (`id`),
  UNIQUE KEY `agency_t_user_id_uindex` (`user_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='展示代理商';

-- Dumping data for table newstars.agency_t: ~0 rows (大约)
/*!40000 ALTER TABLE `agency_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `agency_t` ENABLE KEYS */;

-- Dumping structure for table newstars.ai_config_t
CREATE TABLE IF NOT EXISTS `ai_config_t` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `type` int(11) DEFAULT NULL,
  `config` blob,
  `des` varchar(128) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `type_UNIQUE` (`type`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

-- Dumping data for table newstars.ai_config_t: ~0 rows (大约)
/*!40000 ALTER TABLE `ai_config_t` DISABLE KEYS */;
INSERT INTO `ai_config_t` (`id`, `type`, `config`, `des`) VALUES
	(3, 1, _binary 0xFF92FF8F03010108515A4E4E4261736501FF9000010A010742616E6B657230010400010742616E6B657231010400010742616E6B657232010400010742616E6B657233010400010742616E6B6572340104000107506C61796572350104000108506C6179657231300104000108506C6179657231350104000108506C6179657232300104000108506C617965723235010400000017FF900132013C013C0114010A0150013C011E0114010A00, '经典抢庄概率'),
	(4, 2, _binary 0x1CFF910401010B515A4E4E4D696E674D617001FF9200010401FF90000029FF8F030102FF9000010301024944010400010642616E6B65720104000106506C6179657201040000007AFF9200100A010A0102010A000E010E01040114001401140106011E0000030A00040104020A000801080108013200100110010401140018011801060128001A011A01080128001C011C0108012800020102020A00060106020A000C010C01040114001201120106011E001601160106011E001E011E0108013200, '明牌抢庄概率');
/*!40000 ALTER TABLE `ai_config_t` ENABLE KEYS */;

-- Dumping structure for table newstars.apple_receipt_t
CREATE TABLE IF NOT EXISTS `apple_receipt_t` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `receipt` text COMMENT '支付凭证',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='苹果支付凭证';

-- Dumping data for table newstars.apple_receipt_t: ~0 rows (大约)
/*!40000 ALTER TABLE `apple_receipt_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `apple_receipt_t` ENABLE KEYS */;

-- Dumping structure for procedure newstars.calc_wagency_reve
DELIMITER //
CREATE DEFINER=`root`@`%` PROCEDURE `calc_wagency_reve`()
begin
	declare i int;
	declare lastdaystr varchar(32);
	DECLARE t_error INTEGER DEFAULT 0;
	DECLARE CONTINUE HANDLER FOR SQLEXCEPTION SET t_error=1;-- 异常时设置为1

	START TRANSACTION;
	select  date_format(date_sub(now(), interval 1 day), '%Y%m%d') into lastdaystr;

	update  wagency_user_t w , vip_level_t v   set w.syncrevenue=v.svipvalue
	where v.userid=w.userid and v.svipvalue>syncrevenue;

	insert into wagency_reve_record_t(userid,startrevenue,endrevenue,bizdate,createtime)  
	select userid,revenue,syncrevenue,lastdaystr,unix_timestamp() from wagency_user_t
	where syncrevenue>revenue;

	-- 计算1级级代理返利明细
	insert into wagency_amount_detail_t(userid,playeruid,amount,bizdate,issum,createtime)   
	select   parentuid as agencyuid,userid as playerid, TRUNCATE((syncrevenue-revenue)*0.15,2) as agencyamout ,lastdaystr,0,unix_timestamp() from wagency_user_t t
	where parentuid>0
	and syncrevenue>revenue;

	-- 计算1级级代理税收返利
	insert into wagency_amount_record_t(userid,direamount,otheramount,bizdate,createtime)   
	select userid,sum(amount) as rewards,0.0 as otheramount, lastdaystr as bizdate,unix_timestamp() from wagency_amount_detail_t
	where bizdate=lastdaystr
	group by userid;

	-- 计算2-8级级代理税收返利
	delete from  wagency_amount_tmp_t;
    set i = 2;
    while i < 9 do 
		insert into wagency_amount_tmp_t(userid,amount,agencylevel,bizdate)
		select agencyuid ,sum(rewards),i as lvl ,lastdaystr from (
		select SUBSTRING_INDEX( SUBSTRING_INDEX(parentuids,',',-(i+1)),',',1) as agencyuid,TRUNCATE( (syncrevenue-revenue)*power (0.15,i),2)  as rewards  from wagency_user_t t
		where FIND_IN_SET(parentuid,parentuids) >=i
		and syncrevenue>revenue) t
		group by agencyuid;
        set i = i + 1; 
    end while;  

	-- 返利明细累计
	insert into wagency_amount_detailsum_t(userid,playeruid,amount,createtime)
	select userid,playeruid,0,unix_timestamp()
	from wagency_amount_detail_t t1
	where bizdate =lastdaystr
	and not exists (
	select 1 from wagency_amount_detailsum_t t2 where t1.userid=t2.userid and t1.playeruid=t2.playeruid 
	);
	update wagency_amount_detailsum_t t1,wagency_amount_detail_t t2
	set t1.amount=t1.amount+t2.amount,t2.issum=1
	where  t1.userid=t2.userid and t1.playeruid=t2.playeruid  and t2.bizdate=lastdaystr and t2.issum=0;

	-- 更新数据到返利记录表
	insert into wagency_amount_record_t(userid,direamount,otheramount,bizdate,createtime)  
	select  userid, 0,0,bizdate,unix_timestamp() from wagency_amount_tmp_t  t
	where 
	not exists  (
	select  1 from wagency_amount_record_t t2 where t.userid=t2.userid and t2.bizdate=lastdaystr);

	update wagency_amount_record_t t1 , (
	select userid,sum(amount) as rewards,bizdate  from wagency_amount_tmp_t
	group by userid,bizdate) t2
	set otheramount=rewards
	where t1.userid=t2.userid and t1.bizdate=t2.bizdate;

	-- 更新全民代理用户返利信息
	update wagency_user_t u ,
	(select userid, TRUNCATE(direamount,2)+TRUNCATE(otheramount,2) as total from wagency_amount_record_t
	where bizdate=lastdaystr 
	and amountstatus=0
	) r set u.ungetamount=u.ungetamount+r.total
	 where u.userid=r.userid;
	update wagency_amount_record_t set amountstatus=1 where bizdate=lastdaystr  and amountstatus=0;
	update wagency_user_t set  revenue=syncrevenue  where syncrevenue>revenue;

	-- 周榜数据
	delete from  wagency_weektop_t;
	insert into wagency_weektop_t(userid,nickname,amount)  
	select t1.userid,t1.nickname,t2.amount from account_t t1, ( 
		select userid, sum(direamount+otheramount) as amount from wagency_amount_record_t
		where bizdate between  date_format(date_add( now(), interval -(date_format(curdate(),'%w')+6)%7 day),'%Y%m%d') and date_format(date_add( now(), interval -1 day),'%Y%m%d')
		group by userid 
		order by amount desc
		limit 50) t2
		where t1.userid=t2.userid;

        IF t_error = 1 THEN
            ROLLBACK;
			insert into wagency_eventlog_t(errcode,errmsg,bizdate,createtime)
			values(1,'计算返利发生异常',lastdaystr,unix_timestamp());
        ELSE
            COMMIT;
			insert into wagency_eventlog_t(errcode,errmsg,bizdate,createtime)
			values(0,'',lastdaystr,unix_timestamp());
        END IF;
end//
DELIMITER ;

-- Dumping structure for event newstars.cleanluckylist
DELIMITER //
CREATE DEFINER=`root`@`%` EVENT `cleanluckylist` ON SCHEDULE EVERY 1 DAY STARTS '2019-04-18 00:00:00' ON COMPLETION PRESERVE ENABLE DO TRUNCATE TABLE lucky_list_t ;//
DELIMITER ;

-- Dumping structure for table newstars.cloud_activity_t
CREATE TABLE IF NOT EXISTS `cloud_activity_t` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `user_id` int(11) DEFAULT NULL,
  `type` int(11) DEFAULT NULL,
  `giveamount` decimal(18,3) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `sIndex` (`user_id`,`type`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

-- Dumping data for table newstars.cloud_activity_t: ~0 rows (大约)
/*!40000 ALTER TABLE `cloud_activity_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `cloud_activity_t` ENABLE KEYS */;

-- Dumping structure for procedure newstars.day_plan
DELIMITER //
CREATE DEFINER=`root`@`%` PROCEDURE `day_plan`()
BEGIN
insert into sync_t(ts) value(unix_timestamp(now())) ;
END//
DELIMITER ;

-- Dumping structure for procedure newstars.delete_setttle
DELIMITER //
CREATE DEFINER=`root`@`%` PROCEDURE `delete_setttle`()
BEGIN

	declare iSettleid int default 0;
    declare iBettime bigint default 0;
    declare iDays int default 60;
    set iDays = 7;

    
	SELECT settleid ,bettime into iSettleid, iBettime FROM newstars.settlement_dt_t  limit 1000,1;
    if iBettime < (unix_timestamp(now()) -86400*iDays) and iSettleid > 0  then 
    delete from newstars.settlement_dt_t where settleid <= iSettleid;
    end if;
    
    set iSettleid = 0;
    set iBettime = 0;
    
	SELECT settleid ,bettime into iSettleid, iBettime FROM newstars.settlement_baccarat_t  limit 1000,1;
    if iBettime < (unix_timestamp(now()) -86400*iDays) and iSettleid > 0  then 
    delete from newstars.settlement_baccarat_t where settleid <= iSettleid;
    end if;
    
    set iSettleid = 0;
    set iBettime = 0;
    
	SELECT settleid ,bettime into iSettleid, iBettime FROM newstars.settlement_benz_t  limit 1000,1;
    if iBettime < (unix_timestamp(now()) -86400*iDays) and iSettleid > 0  then 
    delete from newstars.settlement_benz_t where settleid <= iSettleid;
    end if;
    
    set iSettleid = 0;
    set iBettime = 0;
    
	SELECT settleid ,bettime into iSettleid, iBettime FROM newstars.settlement_fish_t  limit 1000,1;
    if iBettime < (unix_timestamp(now()) -86400*iDays) and iSettleid > 0  then 
    delete from newstars.settlement_fish_t where settleid <= iSettleid;
    end if;
    
    set iSettleid = 0;
    set iBettime = 0;
    
	SELECT settleid ,bettime into iSettleid, iBettime FROM newstars.settlement_ox100_t  limit 1000,1;
    if iBettime < (unix_timestamp(now()) -86400*iDays) and iSettleid > 0  then 
    delete from newstars.settlement_ox100_t where settleid <= iSettleid;
    end if;
    
    set iSettleid = 0;
    set iBettime = 0;
    
	SELECT settleid ,bettime into iSettleid, iBettime FROM newstars.settlement_redblack_t  limit 1000,1;
    if iBettime < (unix_timestamp(now()) -86400*iDays) and iSettleid > 0  then 
    delete from newstars.settlement_redblack_t where settleid <= iSettleid;
    end if;
    
	set iSettleid = 0;
    set iBettime = 0;
    
	SELECT settleid ,bettime into iSettleid, iBettime FROM newstars.settlement_t  limit 1000,1;
    if iBettime < (unix_timestamp(now()) -86400*iDays) and iSettleid > 0  then 
    delete from newstars.settlement_t where settleid <= iSettleid;
    end if;
    
	set iSettleid = 0;
    set iBettime = 0;
    
	SELECT settleid ,bettime into iSettleid, iBettime FROM newstars.settlement_threecard_t  limit 1000,1;
    if iBettime < (unix_timestamp(now()) -86400*iDays) and iSettleid > 0  then 
    delete from newstars.settlement_threecard_t where settleid <= iSettleid;
    end if;
    
	set iSettleid = 0;
    set iBettime = 0;
    
	SELECT settleid ,bettime into iSettleid, iBettime FROM newstars.settlement_ox5_t  limit 1000,1;
    if iBettime < (unix_timestamp(now()) -86400*iDays) and iSettleid > 0  then 
    delete from newstars.settlement_ox5_t where settleid <= iSettleid;
    end if;
    
END//
DELIMITER ;

-- Dumping structure for table newstars.exchange_t
CREATE TABLE IF NOT EXISTS `exchange_t` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `device` tinyint(4) NOT NULL DEFAULT '0' COMMENT '设备类型',
  `channel` tinyint(4) NOT NULL DEFAULT '0' COMMENT '兑换渠道 0:支付宝 1:银行卡',
  `user_id` int(11) NOT NULL COMMENT '玩家id',
  `submit_money` decimal(18,2) NOT NULL DEFAULT '0.00' COMMENT '提交金额',
  `ex_name` varchar(45) NOT NULL COMMENT '提现名称',
  `ex_account` varchar(128) NOT NULL DEFAULT '' COMMENT '提现账号',
  `apply_time` bigint(20) NOT NULL DEFAULT '0' COMMENT '兑换申请时间',
  `day_key` int(11) DEFAULT NULL COMMENT '当天日期',
  `hour_key` int(11) unsigned zerofill DEFAULT NULL COMMENT '小时',
  `status` tinyint(4) NOT NULL DEFAULT '0' COMMENT '提现状态',
  `exchange_re_id` int(11) DEFAULT NULL COMMENT '兑换结果返回单号',
  `machineid` varchar(45) DEFAULT NULL COMMENT '机器码',
  `ip` varchar(45) DEFAULT NULL COMMENT '兑换ip',
  `tradeno` varchar(64) DEFAULT NULL COMMENT '流水号',
  `servercharge` decimal(18,2) DEFAULT NULL COMMENT '手续费',
  `orderamount` decimal(18,2) DEFAULT NULL COMMENT '实付金额',
  `orderid` varchar(45) DEFAULT NULL COMMENT '订单号',
  `payaccount` varchar(45) DEFAULT NULL COMMENT '付款账号',
  `bankcode` varchar(45) DEFAULT NULL COMMENT '银行代码',
  `telephone` varchar(45) DEFAULT NULL COMMENT '手机号',
  `arrivaltime` bigint(20) DEFAULT '0' COMMENT '回调时间',
  `resultmsg` varchar(128) DEFAULT '' COMMENT '回调信息',
  PRIMARY KEY (`id`),
  UNIQUE KEY `exchange_re_id` (`exchange_re_id`),
  UNIQUE KEY `orderid_UNIQUE` (`orderid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='玩家兑换清单';

-- Dumping data for table newstars.exchange_t: ~0 rows (大约)
/*!40000 ALTER TABLE `exchange_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `exchange_t` ENABLE KEYS */;

-- Dumping structure for table newstars.fish_cannon_t
CREATE TABLE IF NOT EXISTS `fish_cannon_t` (
  `pkid` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `id` int(11) NOT NULL COMMENT '炮台ID',
  `name` varchar(45) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL COMMENT '名称',
  `period_day` int(11) DEFAULT NULL COMMENT '有效天数',
  `cost_wealth` decimal(18,2) DEFAULT NULL COMMENT '消耗金币',
  `isneedbuy` int(11) DEFAULT '1' COMMENT '是否需要购买',
  `viplevel` int(11) DEFAULT '0',
  PRIMARY KEY (`pkid`),
  UNIQUE KEY `id_UNIQUE` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=16 DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='炮台配置表';

-- Dumping data for table newstars.fish_cannon_t: ~0 rows (大约)
/*!40000 ALTER TABLE `fish_cannon_t` DISABLE KEYS */;
INSERT INTO `fish_cannon_t` (`pkid`, `id`, `name`, `period_day`, `cost_wealth`, `isneedbuy`, `viplevel`) VALUES
	(4, 0, '我的炮台', 0, 0.00, 0, 0),
	(5, 1, '蓝色风暴', 30, 10.00, 1, 0),
	(6, 2, '赤炎魔羽', 30, 20.00, 1, 0),
	(7, 3, '狂暴绿焰', 30, 20.00, 1, 0),
	(10, 4, '红色杀戮', 0, 0.00, 0, 1),
	(11, 5, '毁灭激光', 0, 0.00, 0, 2),
	(12, 6, '风暴镭射', 0, 0.00, 0, 3),
	(13, 7, '爆裂脉冲', 0, 0.00, 0, 4),
	(14, 8, '龙炎之怒', 0, 0.00, 0, 5),
	(15, 9, '圣光裁决', 0, 0.00, 0, 6);
/*!40000 ALTER TABLE `fish_cannon_t` ENABLE KEYS */;

-- Dumping structure for table newstars.fish_kind_t
CREATE TABLE IF NOT EXISTS `fish_kind_t` (
  `pkid` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `id` int(11) NOT NULL COMMENT '种类ID',
  `kindtype` int(11) DEFAULT '0' COMMENT '分类',
  `kindname` varchar(45) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '鱼类名称',
  `score` int(11) NOT NULL COMMENT '分值',
  `kinddesc` varchar(500) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT '' COMMENT '描述',
  `paths` varchar(500) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT '0' COMMENT '路径',
  `bossroom` int(11) DEFAULT '0' COMMENT 'Boss鱼所在房间',
  `intervalsec` int(11) DEFAULT '100' COMMENT '出鱼间隔',
  PRIMARY KEY (`pkid`) USING BTREE,
  UNIQUE KEY `id_UNIQUE` (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=58 DEFAULT CHARSET=utf8 COLLATE=utf8_bin ROW_FORMAT=DYNAMIC COMMENT='捕鱼图鉴表';

-- Dumping data for table newstars.fish_kind_t: ~0 rows (大约)
/*!40000 ALTER TABLE `fish_kind_t` DISABLE KEYS */;
INSERT INTO `fish_kind_t` (`pkid`, `id`, `kindtype`, `kindname`, `score`, `kinddesc`, `paths`, `bossroom`, `intervalsec`) VALUES
	(29, 0, 1, '蓝藻鱼', 2, '', '0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,28,29,30,31,32,33,34,35,36,37,38,39,40', 0, 6),
	(30, 1, 1, '沙丁鱼', 2, '', '0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,28,29,30,31,32,33,34,35,36,37,38,39,40', 0, 6),
	(31, 2, 1, '螃蟹', 3, '', '0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,28,29,30,31,32,33,34,35,36,37,38,39,40', 0, 6),
	(32, 3, 1, '小丑鱼', 3, '', '0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,28,29,30,31,32,33,34,35,36,37,38,39,40', 0, 6),
	(33, 4, 1, '气球鱼', 4, '', '0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,28,29,30,31,32,33,34,35,36,37,38,39,40', 0, 6),
	(34, 5, 1, '小墨鱼', 5, '', '0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,28,29,30,31,32,33,34,35,36,37,38,39,40', 0, 6),
	(35, 6, 2, '蓝豆鱼', 7, '', '0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,28,29,30,31,32,33,34,35,36,37,38,39,40', 0, 10),
	(36, 7, 2, '海马', 10, '', '0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,28,29,30,31,32,33,34,35,36,37,38,39,40', 0, 10),
	(37, 8, 2, '红豆鱼', 12, '', '0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,28,29,30,31,32,33,34,35,36,37,38,39,40', 0, 10),
	(38, 9, 2, '乌龟', 15, '', '0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,28,29,30,31,32,33,34,35,36,37,38,39,40', 0, 10),
	(39, 10, 2, '海星', 18, '', '0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,28,29,30,31,32,33,34,35,36,37,38,39,40', 0, 10),
	(40, 11, 2, '蝴蝶鱼', 20, '', '0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,28,29,30,31,32,33,34,35,36,37,38,39,40', 0, 10),
	(41, 12, 2, '鳌虾', 25, '', '0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,28,29,30,31,32,33,34,35,36,37,38,39,40', 0, 10),
	(42, 13, 2, '鲨鱼', 30, '', '0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,28,29,30,31,32,33,34,35,36,37,38,39,40', 0, 10),
	(43, 14, 3, '银榔头鲨鱼', 35, '', '10,13,17,20,22,23,24,30,31,32,33,35,36,38,39,40', 0, 20),
	(44, 15, 3, '贝壳', 40, '', '10,13,17,20,22,23,24,30,31,32,33,35,36,38,39,40', 0, 20),
	(45, 16, 3, '大三元', 45, '', '10,13,17,20,22,23,24,30,31,32,33,35,36,38,39,40', 0, 20),
	(46, 17, 6, '魔鬼鱼', 50, '', '0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,28,29,30,31,32,33,34,35,36,37,38,39,40', 0, 20),
	(47, 18, 3, '大四喜', 55, '', '10,13,17,20,22,23,24,30,31,32,33,35,36,38,39,40', 0, 20),
	(48, 19, 6, '剑鱼', 60, '', '0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,28,29,30,31,32,33,34,35,36,37,38,39,40', 0, 20),
	(49, 20, 6, '神仙鱼', 65, '', '0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,28,29,30,31,32,33,34,35,36,37,38,39,40', 0, 20),
	(50, 21, 3, '五福临门', 70, '', '10,13,17,20,22,23,24,30,31,32,33,35,36,38,39,40', 0, 20),
	(51, 22, 6, '金海龟', 80, '', '0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,28,29,30,31,32,33,34,35,36,37,38,39,40', 0, 20),
	(52, 23, 6, '盔甲鱼', 100, '', '0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,28,29,30,31,32,33,34,35,36,37,38,39,40', 0, 20),
	(53, 24, 3, '金榔头鲨鱼', 150, '', '10,13,17,20,22,23,24,30,31,32,33,35,36,38,39,40', 0, 20),
	(54, 25, 3, '金龙鱼', 150, '', '10,13,17,20,22,23,24,30,31,32,33,35,36,38,39,40', 0, 20),
	(55, 26, 4, '龙', 200, '', '26', 1, 300),
	(56, 27, 4, '金蟾', 200, '', '27', 1, 300),
	(57, 28, 3, '海鳗', 50, '', '10,13,17,20,22,23,24,30,31,32,33,35,36,38,39,40', 0, 60);
/*!40000 ALTER TABLE `fish_kind_t` ENABLE KEYS */;

-- Dumping structure for table newstars.fish_path_t
CREATE TABLE IF NOT EXISTS `fish_path_t` (
  `pkid` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `id` int(11) NOT NULL COMMENT '路径id',
  `deadtime` int(11) NOT NULL COMMENT '路径走完时间',
  `rate` int(11) DEFAULT '100' COMMENT '出现概率',
  PRIMARY KEY (`pkid`,`id`) USING BTREE,
  UNIQUE KEY `id_UNIQUE` (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=4255 DEFAULT CHARSET=utf8 COLLATE=utf8_bin ROW_FORMAT=DYNAMIC COMMENT='路径表';

-- Dumping data for table newstars.fish_path_t: ~0 rows (大约)
/*!40000 ALTER TABLE `fish_path_t` DISABLE KEYS */;
INSERT INTO `fish_path_t` (`pkid`, `id`, `deadtime`, `rate`) VALUES
	(4054, 1000, 20200, 100),
	(4055, 1001, 20200, 100),
	(4056, 1002, 23800, 100),
	(4057, 1003, 23800, 100),
	(4058, 1004, 20200, 100),
	(4059, 1005, 20200, 100),
	(4060, 2000, 20200, 100),
	(4061, 2001, 20200, 100),
	(4062, 2002, 20200, 100),
	(4063, 2003, 20200, 100),
	(4064, 2004, 20200, 100),
	(4065, 2005, 20200, 100),
	(4066, 2006, 20200, 100),
	(4067, 3000, 20200, 100),
	(4068, 3001, 20200, 100),
	(4069, 3002, 20200, 100),
	(4070, 3003, 20200, 100),
	(4071, 3004, 20200, 100),
	(4072, 3005, 22600, 100),
	(4073, 3006, 20200, 100),
	(4074, 3007, 20200, 100),
	(4075, 3008, 20200, 100),
	(4076, 3009, 20200, 100),
	(4077, 3010, 20200, 100),
	(4078, 4000, 20200, 100),
	(4079, 4001, 20200, 100),
	(4080, 4002, 20200, 100),
	(4081, 4003, 20200, 100),
	(4082, 4004, 20200, 100),
	(4083, 4005, 20200, 100),
	(4084, 4006, 20200, 100),
	(4085, 4007, 20200, 100),
	(4086, 4008, 20200, 100),
	(4087, 4009, 20200, 100),
	(4088, 4010, 20200, 100),
	(4089, 4011, 20200, 100),
	(4090, 4012, 20200, 100),
	(4214, 0, 31037, 100),
	(4215, 1, 39439, 100),
	(4216, 2, 31559, 100),
	(4217, 3, 38321, 100),
	(4218, 4, 27968, 100),
	(4219, 5, 33402, 100),
	(4220, 6, 27750, 100),
	(4221, 7, 41979, 100),
	(4222, 8, 38037, 100),
	(4223, 9, 19233, 100),
	(4224, 10, 31245, 100),
	(4225, 11, 47805, 100),
	(4226, 12, 34272, 100),
	(4227, 13, 33541, 100),
	(4228, 14, 40135, 100),
	(4229, 15, 46365, 100),
	(4230, 16, 39233, 100),
	(4231, 17, 30001, 100),
	(4232, 18, 20000, 100),
	(4233, 19, 26698, 100),
	(4234, 20, 21705, 100),
	(4235, 21, 21480, 100),
	(4236, 22, 20229, 100),
	(4237, 23, 20112, 100),
	(4238, 24, 20112, 100),
	(4239, 25, 52098, 100),
	(4240, 26, 36718, 100),
	(4241, 27, 31012, 100),
	(4242, 28, 23946, 100),
	(4243, 29, 46489, 100),
	(4244, 30, 26412, 100),
	(4245, 31, 25601, 100),
	(4246, 32, 20707, 100),
	(4247, 33, 21095, 100),
	(4248, 34, 43910, 100),
	(4249, 35, 22332, 100),
	(4250, 36, 23139, 100),
	(4251, 37, 39053, 100),
	(4252, 38, 22876, 100),
	(4253, 39, 26757, 100),
	(4254, 40, 30050, 100);
/*!40000 ALTER TABLE `fish_path_t` ENABLE KEYS */;

-- Dumping structure for table newstars.fish_room_config
CREATE TABLE IF NOT EXISTS `fish_room_config` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `gameroomid` int(11) NOT NULL COMMENT '房间id',
  `capturerate` decimal(18,2) NOT NULL COMMENT '捕获概率',
  `poolamount` decimal(18,6) DEFAULT '0.000000' COMMENT '新手库存',
  `excludefishkinds` varchar(500) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT '' COMMENT '排除鱼类',
  PRIMARY KEY (`id`),
  UNIQUE KEY `gameroomid_UNIQUE` (`gameroomid`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='捕鱼房间配置表';

-- Dumping data for table newstars.fish_room_config: ~0 rows (大约)
/*!40000 ALTER TABLE `fish_room_config` DISABLE KEYS */;
INSERT INTO `fish_room_config` (`id`, `gameroomid`, `capturerate`, `poolamount`, `excludefishkinds`) VALUES
	(1, 17, 1.00, -23.956430, '23,24,25,26,27'),
	(2, 18, 1.00, 0.050000, ''),
	(3, 19, 1.00, 0.000000, ''),
	(4, 20, 1.00, 20.000000, '');
/*!40000 ALTER TABLE `fish_room_config` ENABLE KEYS */;

-- Dumping structure for table newstars.fish_skill_t
CREATE TABLE IF NOT EXISTS `fish_skill_t` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `skill_type` int(11) NOT NULL COMMENT '技能类型 0:冻结 1:加速 2:锁定',
  `skill_name` varchar(45) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL COMMENT '技能名称',
  `freeze_time` int(11) DEFAULT NULL COMMENT '冻结时间',
  `gameroomid` int(11) DEFAULT NULL COMMENT '房间ID',
  `cost_wealth` decimal(18,3) DEFAULT NULL COMMENT '消耗金币',
  PRIMARY KEY (`id`) USING BTREE,
  KEY `gameroomid_idx` (`gameroomid`) USING BTREE,
  CONSTRAINT `gameroomid` FOREIGN KEY (`gameroomid`) REFERENCES `gameroom_t` (`gameroomid`)
) ENGINE=InnoDB AUTO_INCREMENT=91 DEFAULT CHARSET=utf8 COLLATE=utf8_bin ROW_FORMAT=DYNAMIC COMMENT='技能配置表';

-- Dumping data for table newstars.fish_skill_t: ~0 rows (大约)
/*!40000 ALTER TABLE `fish_skill_t` DISABLE KEYS */;
INSERT INTO `fish_skill_t` (`id`, `skill_type`, `skill_name`, `freeze_time`, `gameroomid`, `cost_wealth`) VALUES
	(79, 0, '冰封', 10000, 17, 0.000),
	(80, 1, '自动', 0, 17, 0.000),
	(81, 2, '锁定', 0, 17, 0.000),
	(82, 0, '冰封', 10000, 18, 0.000),
	(83, 1, '自动', 0, 18, 0.000),
	(84, 2, '锁定', 0, 18, 0.000),
	(85, 0, '冰封', 10000, 19, 0.000),
	(86, 1, '自动', 0, 19, 0.000),
	(87, 2, '锁定', 0, 19, 0.000),
	(88, 0, '冰封', 10000, 20, 0.000),
	(89, 1, '自动', 0, 20, 0.000),
	(90, 2, '锁定', 0, 20, 0.000);
/*!40000 ALTER TABLE `fish_skill_t` ENABLE KEYS */;

-- Dumping structure for table newstars.fish_user_cannon_t
CREATE TABLE IF NOT EXISTS `fish_user_cannon_t` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `userid` int(11) DEFAULT NULL COMMENT '用户ID',
  `cannonid` int(11) DEFAULT NULL COMMENT '炮台ID',
  `starttime` bigint(20) DEFAULT NULL COMMENT '生效时间',
  `endtime` bigint(20) DEFAULT NULL COMMENT '失效时间',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin ROW_FORMAT=DYNAMIC COMMENT='用户炮台';

-- Dumping data for table newstars.fish_user_cannon_t: ~0 rows (大约)
/*!40000 ALTER TABLE `fish_user_cannon_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `fish_user_cannon_t` ENABLE KEYS */;

-- Dumping structure for table newstars.fish_user_extend_t
CREATE TABLE IF NOT EXISTS `fish_user_extend_t` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键ID',
  `userid` int(11) NOT NULL COMMENT '用户ID',
  `curr_cannon_id` int(11) NOT NULL COMMENT '当前使用炮台',
  `curr_cannon_ratio` decimal(18,3) NOT NULL COMMENT '当前炮台倍率',
  `skill_0_count` int(11) DEFAULT '0' COMMENT '技能消耗次数',
  `skill_0_amount` decimal(18,3) DEFAULT '0.000' COMMENT '技能消耗金币',
  `skill_1_count` int(11) DEFAULT '0' COMMENT '技能消耗次数',
  `skill_1_amount` decimal(18,3) DEFAULT '0.000' COMMENT '技能消耗金币',
  `skill_2_count` int(11) DEFAULT '0' COMMENT '技能消耗次数',
  `skill_2_amount` decimal(18,3) DEFAULT '0.000' COMMENT '技能消耗金币',
  `cannon_1_count` int(11) DEFAULT '0' COMMENT '炮台购买次数',
  `cannon_1_amount` decimal(18,3) DEFAULT '0.000' COMMENT '炮台购买金币',
  `cannon_2_count` int(11) DEFAULT '0' COMMENT '炮台购买次数',
  `cannon_2_amount` decimal(18,3) DEFAULT '0.000' COMMENT '炮台购买金币',
  `cannon_3_count` int(11) DEFAULT '0' COMMENT '炮台购买次数',
  `cannon_3_amount` decimal(18,3) DEFAULT '0.000' COMMENT '炮台购买金币',
  `onlinetimes` bigint(20) DEFAULT '0' COMMENT '在线时长',
  `inven` decimal(18,6) DEFAULT '0.000000' COMMENT '一人库存',
  `hisrevenue` decimal(18,6) NOT NULL DEFAULT '0.000000' COMMENT '历史税收',
  `isnewplayer` int(11) DEFAULT '0' COMMENT '是否新手',
  PRIMARY KEY (`id`),
  UNIQUE KEY `userid_UNIQUE` (`userid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='捕鱼用户扩展表';

-- Dumping data for table newstars.fish_user_extend_t: ~0 rows (大约)
/*!40000 ALTER TABLE `fish_user_extend_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `fish_user_extend_t` ENABLE KEYS */;

-- Dumping structure for table newstars.gamechannel_dailydetail_t
CREATE TABLE IF NOT EXISTS `gamechannel_dailydetail_t` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `userid` int(11) DEFAULT NULL,
  `playeruserid` int(11) DEFAULT NULL,
  `currdate` varchar(45) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL,
  `level` int(11) DEFAULT NULL,
  `revenue` decimal(18,6) DEFAULT NULL,
  `revenueamount` decimal(18,8) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

-- Dumping data for table newstars.gamechannel_dailydetail_t: ~0 rows (大约)
/*!40000 ALTER TABLE `gamechannel_dailydetail_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `gamechannel_dailydetail_t` ENABLE KEYS */;

-- Dumping structure for table newstars.gamechannel_dailysum_t
CREATE TABLE IF NOT EXISTS `gamechannel_dailysum_t` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `userid` int(11) NOT NULL,
  `currdate` varchar(45) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL,
  `level` int(11) DEFAULT NULL,
  `revenue` decimal(18,6) DEFAULT NULL,
  `revenueamount` decimal(18,8) DEFAULT NULL,
  `totalnums` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

-- Dumping data for table newstars.gamechannel_dailysum_t: ~0 rows (大约)
/*!40000 ALTER TABLE `gamechannel_dailysum_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `gamechannel_dailysum_t` ENABLE KEYS */;

-- Dumping structure for table newstars.gamechannel_level_t
CREATE TABLE IF NOT EXISTS `gamechannel_level_t` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `level` int(11) DEFAULT NULL,
  `exp` decimal(18,2) DEFAULT NULL,
  `mtask` decimal(18,2) DEFAULT NULL,
  `dtask` decimal(18,2) DEFAULT NULL,
  `dtaskexp` decimal(18,2) DEFAULT NULL,
  `rebaterate1` decimal(18,3) DEFAULT NULL,
  `rebaterate2` decimal(18,3) DEFAULT NULL,
  `rebaterate3` decimal(18,3) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

-- Dumping data for table newstars.gamechannel_level_t: ~0 rows (大约)
/*!40000 ALTER TABLE `gamechannel_level_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `gamechannel_level_t` ENABLE KEYS */;

-- Dumping structure for table newstars.gamechannel_revenue_t
CREATE TABLE IF NOT EXISTS `gamechannel_revenue_t` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `userid` int(11) DEFAULT NULL,
  `currdate` varchar(45) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL,
  `betamount` decimal(18,3) DEFAULT NULL,
  `revenue` decimal(18,6) DEFAULT NULL,
  `syncrevenue` decimal(18,6) DEFAULT '0.000000',
  `updaterevenue` decimal(18,6) DEFAULT '0.000000',
  `dtaskexp` decimal(18,6) DEFAULT '0.000000',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

-- Dumping data for table newstars.gamechannel_revenue_t: ~0 rows (大约)
/*!40000 ALTER TABLE `gamechannel_revenue_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `gamechannel_revenue_t` ENABLE KEYS */;

-- Dumping structure for table newstars.gamechannel_reward_t
CREATE TABLE IF NOT EXISTS `gamechannel_reward_t` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `userid` int(11) DEFAULT NULL COMMENT '玩家ID',
  `amount` decimal(18,2) DEFAULT NULL COMMENT '税收奖励',
  `rewardamount` decimal(18,2) DEFAULT NULL COMMENT '发放奖励',
  `currdate` varchar(45) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL COMMENT '税收产生日期',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

-- Dumping data for table newstars.gamechannel_reward_t: ~0 rows (大约)
/*!40000 ALTER TABLE `gamechannel_reward_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `gamechannel_reward_t` ENABLE KEYS */;

-- Dumping structure for table newstars.gamechannel_summary_t
CREATE TABLE IF NOT EXISTS `gamechannel_summary_t` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `userid` int(11) NOT NULL,
  `betamount` decimal(18,6) DEFAULT '0.000000',
  `revenueamount` decimal(18,6) DEFAULT '0.000000',
  `mtaskexp` decimal(18,6) DEFAULT '0.000000',
  `dtaskexp` decimal(18,6) DEFAULT '0.000000',
  `dailyexp` decimal(18,6) DEFAULT '0.000000',
  `dailyincexp` decimal(18,6) DEFAULT '0.000000' COMMENT '当天增加经验',
  `mtaskstartdt` varchar(45) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL,
  `mtaskenddt` varchar(45) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL,
  `currdate` varchar(45) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

-- Dumping data for table newstars.gamechannel_summary_t: ~0 rows (大约)
/*!40000 ALTER TABLE `gamechannel_summary_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `gamechannel_summary_t` ENABLE KEYS */;

-- Dumping structure for table newstars.gamechannel_user_t
CREATE TABLE IF NOT EXISTS `gamechannel_user_t` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `userid` int(11) DEFAULT NULL,
  `channel_b` int(11) DEFAULT '0',
  `channel_c` int(11) DEFAULT '0',
  `channel_d` int(11) DEFAULT '0',
  `currlevel` int(11) DEFAULT '0',
  `leveltimes` bigint(20) DEFAULT '0',
  `lastdaylevel` int(11) DEFAULT '0',
  `currLevelexp` decimal(18,6) DEFAULT '0.000000',
  `mtaskexp` decimal(18,6) DEFAULT '0.000000',
  `dtaskexp` decimal(18,6) DEFAULT '0.000000',
  `totaldtaskexp` decimal(18,6) DEFAULT '0.000000',
  `perioddays` int(11) DEFAULT '0',
  `totalLevelexp` decimal(18,6) DEFAULT '0.000000',
  `lastdayexp` decimal(18,6) DEFAULT '0.000000',
  `totalexp` decimal(18,6) DEFAULT '0.000000',
  `currdaybet` decimal(18,2) DEFAULT '0.00',
  `totalnums` int(11) DEFAULT '0',
  `protecttimes` bigint(20) DEFAULT '0',
  `updatetimes` bigint(20) DEFAULT '0',
  `protectdate` varchar(45) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT '20180101',
  `url` varchar(512) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT '',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

-- Dumping data for table newstars.gamechannel_user_t: ~0 rows (大约)
/*!40000 ALTER TABLE `gamechannel_user_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `gamechannel_user_t` ENABLE KEYS */;

-- Dumping structure for table newstars.gamechannel_website_t
CREATE TABLE IF NOT EXISTS `gamechannel_website_t` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `game_id` int(11) NOT NULL COMMENT '平台ID 0:亚星 1:晴天',
  `website` text CHARACTER SET utf8 COLLATE utf8_bin COMMENT '落地页地址',
  `clientstatus` int(11) DEFAULT '0' COMMENT '客户端开关状态 0:关 1:开',
  `revestatus` int(11) DEFAULT '0' COMMENT '税收计算开关状态 0:关 1:开',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

-- Dumping data for table newstars.gamechannel_website_t: ~0 rows (大约)
/*!40000 ALTER TABLE `gamechannel_website_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `gamechannel_website_t` ENABLE KEYS */;

-- Dumping structure for table newstars.gamekind_t
CREATE TABLE IF NOT EXISTS `gamekind_t` (
  `gamekindid` int(11) NOT NULL AUTO_INCREMENT COMMENT '类型ID',
  `gamekindname` varchar(45) DEFAULT NULL COMMENT '游戏名',
  `status` int(11) DEFAULT NULL COMMENT '状态',
  `icontype` int(11) DEFAULT NULL COMMENT '图标类型',
  `platformtablemap` text,
  PRIMARY KEY (`gamekindid`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=51 DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC COMMENT='游戏类型表';

-- Dumping data for table newstars.gamekind_t: ~0 rows (大约)
/*!40000 ALTER TABLE `gamekind_t` DISABLE KEYS */;
INSERT INTO `gamekind_t` (`gamekindid`, `gamekindname`, `status`, `icontype`, `platformtablemap`) VALUES
	(1, '斗地主', 1, 0, '{"0":0,"1":0,"2":0}'),
	(2, '炸金花', 1, 0, '{"0":0,"1":0,"2":0}'),
	(3, '百人牛牛', 1, 1, '{"0":0,"1":0,"2":0}'),
	(4, '红黑大战', 1, 0, '{"0":0,"1":0,"2":0}'),
	(5, '抢庄牛牛', 1, 0, '{"0":0,"1":0,"2":0}'),
	(6, '龙虎', 1, 0, '{"0":0,"1":0,"2":0}'),
	(7, '奔驰宝马', 1, 0, '{"0":0,"1":0,"2":0}'),
	(8, '捕鱼', 1, 0, '{"0":0,"1":0,"2":0}'),
	(9, '百家乐', 1, 2, '{"0":1,"1":1,"2":1}'),
	(11, '多福多财', 1, 0, '{"0":0,"1":0,"2":0}'),
	(50, 'test', 1, 0, '{"0":0,"1":0,"2":0}');
/*!40000 ALTER TABLE `gamekind_t` ENABLE KEYS */;

-- Dumping structure for table newstars.gameroom_t
CREATE TABLE IF NOT EXISTS `gameroom_t` (
  `gameroomid` int(11) NOT NULL AUTO_INCREMENT COMMENT '房间ID',
  `gameroomname` varchar(45) DEFAULT NULL COMMENT '房间名称',
  `tablescounts` int(11) DEFAULT NULL COMMENT '桌台总数',
  `minenteramount` int(11) DEFAULT NULL COMMENT '最低进入额度',
  `maxenteramount` bigint(20) DEFAULT NULL COMMENT '最大进入额度',
  `gamekindid` int(11) DEFAULT NULL COMMENT '游戏种类',
  `baseamount` decimal(18,3) DEFAULT NULL COMMENT '底分',
  `gameroomtype` int(11) DEFAULT NULL COMMENT '待定',
  `gamecommission` decimal(18,3) DEFAULT NULL COMMENT '税收比例',
  `robot` tinyint(4) DEFAULT '0' COMMENT '机器人状态',
  `robotlevel` tinyint(4) DEFAULT '0' COMMENT '待定',
  `robotnumbers` int(11) DEFAULT '0' COMMENT '待定',
  PRIMARY KEY (`gameroomid`) USING BTREE,
  KEY `FK_KindID_idx` (`gamekindid`) USING BTREE,
  CONSTRAINT `FK_KindID` FOREIGN KEY (`gamekindid`) REFERENCES `gamekind_t` (`gamekindid`)
) ENGINE=InnoDB AUTO_INCREMENT=27 DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC COMMENT='游戏房间';

-- Dumping data for table newstars.gameroom_t: ~0 rows (大约)
/*!40000 ALTER TABLE `gameroom_t` DISABLE KEYS */;
INSERT INTO `gameroom_t` (`gameroomid`, `gameroomname`, `tablescounts`, `minenteramount`, `maxenteramount`, `gamekindid`, `baseamount`, `gameroomtype`, `gamecommission`, `robot`, `robotlevel`, `robotnumbers`) VALUES
	(1, '斗地主', 200, 1, 200, 1, 0.010, 1, 0.950, 0, 0, 0),
	(2, '中级场', 500, 10, 2000, 1, 0.500, 2, 0.950, 1, 0, 0),
	(3, '高级场', 500, 40, 100000, 1, 1.000, 3, 0.950, 1, 0, 0),
	(4, '初级场', 0, 20, 0, 2, 1.000, 0, 0.950, 1, 0, 0),
	(5, '中级场', 0, 100, 0, 2, 2.000, 0, 0.950, 1, 0, 0),
	(6, '高级场', 0, 300, 0, 2, 5.000, 0, 0.950, 1, 0, 0),
	(7, '大师场', 0, 600, 0, 2, 10.000, 0, 0.950, 1, 0, 0),
	(8, '四倍场', 0, 50, 0, 3, 1.000, 0, 0.950, 1, 0, 0),
	(9, '十倍场', 0, 50, 0, 3, 1.000, 0, 0.950, 1, 0, 0),
	(10, '红黑场', 0, 50, 0, 4, 1.000, 0, 0.950, 1, 0, 0),
	(11, '初级场', 0, 50, 0, 5, 1.000, 0, 0.950, 1, 0, 0),
	(12, '中级场', 0, 250, 0, 5, 5.000, 0, 0.950, 1, 0, 0),
	(13, '高级场', 0, 600, 0, 5, 10.000, 0, 0.950, 1, 0, 0),
	(14, '大师场', 0, 1200, 0, 5, 20.000, 0, 0.950, 1, 0, 0),
	(15, '龙虎场', 0, 50, 0, 6, 1.000, 0, 0.950, 1, 0, 0),
	(16, '奔驰场', 200, 50, 0, 7, 1.000, 14, 0.950, 1, 0, 0),
	(17, '浅海散步', 200, 0, 0, 8, 0.001, 0, 0.995, 1, 0, 0),
	(18, '近海巡游', 200, 10, 0, 8, 0.010, 0, 0.995, 1, 0, 0),
	(19, '远海探险', 200, 60, 0, 8, 0.100, 0, 0.995, 0, 0, 0),
	(20, '深海解密', 200, 100, 0, 8, 1.000, 0, 0.995, 0, 0, 0),
	(21, '百家乐场', 0, 50, 0, 9, 1.000, 0, 0.950, 1, 0, 0),
	(22, '初级场', 200, 50, 0, 5, 1.000, 1, 0.950, 1, 0, 0),
	(23, '中级场', 200, 250, 0, 5, 5.000, 1, 0.950, 1, 0, 0),
	(24, '高级场', 200, 600, 0, 5, 10.000, 1, 0.950, 1, 0, 0),
	(25, '大师场', 200, 1200, 0, 5, 20.000, 1, 0.950, 1, 0, 0),
	(26, '多福多财', 0, 0, 0, 11, 1.000, 0, 0.950, 0, 0, 0);
/*!40000 ALTER TABLE `gameroom_t` ENABLE KEYS */;

-- Dumping structure for table newstars.gameserverinfo_t
CREATE TABLE IF NOT EXISTS `gameserverinfo_t` (
  `serverid` int(11) NOT NULL,
  `hostname` varchar(45) DEFAULT NULL,
  `port` int(11) DEFAULT NULL,
  `gamekindid` int(11) DEFAULT NULL,
  `status` int(11) DEFAULT NULL,
  `servername` varchar(45) DEFAULT NULL,
  PRIMARY KEY (`serverid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- Dumping data for table newstars.gameserverinfo_t: ~0 rows (大约)
/*!40000 ALTER TABLE `gameserverinfo_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `gameserverinfo_t` ENABLE KEYS */;

-- Dumping structure for table newstars.gameserver_t
CREATE TABLE IF NOT EXISTS `gameserver_t` (
  `id` int(20) NOT NULL AUTO_INCREMENT,
  `IP` varchar(50) DEFAULT NULL,
  `MAC` varchar(50) DEFAULT NULL,
  `hdd_serial` varchar(500) DEFAULT NULL,
  `cpu_serial` varchar(500) DEFAULT NULL,
  `mainboard_serial` varchar(500) DEFAULT NULL,
  `sys_uuid` varchar(500) DEFAULT NULL,
  `expired_days` varchar(10) DEFAULT NULL,
  `createtime` bigint(20) DEFAULT NULL,
  `connecttime` bigint(20) DEFAULT NULL,
  `connectstat` int(4) DEFAULT NULL COMMENT '0:已断开 1:已连接',
  PRIMARY KEY (`id`),
  UNIQUE KEY `IP_UNIQUE` (`IP`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- Dumping data for table newstars.gameserver_t: ~0 rows (大约)
/*!40000 ALTER TABLE `gameserver_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `gameserver_t` ENABLE KEYS */;

-- Dumping structure for table newstars.gametable_t
CREATE TABLE IF NOT EXISTS `gametable_t` (
  `gametableid` int(11) NOT NULL AUTO_INCREMENT COMMENT '桌台ID',
  `gametablename` varchar(45) DEFAULT NULL COMMENT '桌台名称',
  `gameroomid` int(11) DEFAULT NULL COMMENT '房间ID',
  `minbetamount` int(11) DEFAULT NULL COMMENT '待定',
  `maxbetamount` int(11) DEFAULT NULL COMMENT '待定',
  `seatnumbers` int(11) DEFAULT NULL COMMENT '桌位数',
  `gameid` int(11) DEFAULT '0',
  PRIMARY KEY (`gametableid`) USING BTREE,
  KEY `FK_RoomID_idx` (`gameroomid`) USING BTREE,
  CONSTRAINT `FK_RoomID` FOREIGN KEY (`gameroomid`) REFERENCES `gameroom_t` (`gameroomid`)
) ENGINE=InnoDB AUTO_INCREMENT=60 DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC COMMENT='桌台表';

-- Dumping data for table newstars.gametable_t: ~0 rows (大约)
/*!40000 ALTER TABLE `gametable_t` DISABLE KEYS */;
INSERT INTO `gametable_t` (`gametableid`, `gametablename`, `gameroomid`, `minbetamount`, `maxbetamount`, `seatnumbers`, `gameid`) VALUES
	(1, '', 21, 0, 0, 100, 0),
	(2, '', 17, 0, 0, 4, 0),
	(3, '', 20, 0, 0, 4, 0),
	(4, '', 8, 0, 0, 100, 0),
	(5, '', 9, 0, 0, 100, 0),
	(6, '', 15, 0, 0, 100, 0),
	(7, '', 10, 0, 0, 100, 0),
	(8, '', 16, 0, 0, 100, 0),
	(9, '', 11, 0, 0, 5, 0),
	(10, '', 11, 0, 0, 5, 0),
	(11, '', 11, 0, 0, 5, 0),
	(12, '', 11, 0, 0, 5, 0),
	(13, '', 11, 0, 0, 5, 0),
	(14, '', 11, 0, 0, 5, 0),
	(15, '', 14, 0, 0, 5, 0),
	(16, '', 14, 0, 0, 5, 0),
	(17, '', 14, 0, 0, 5, 0),
	(18, '', 14, 0, 0, 5, 0),
	(19, '', 14, 0, 0, 5, 0),
	(20, '', 14, 0, 0, 5, 0),
	(21, '', 3, 40, 100000, 3, 0),
	(22, '', 7, 0, 0, 5, 0),
	(23, '', 7, 0, 0, 5, 0),
	(24, '', 18, 0, 0, 4, 0);
/*!40000 ALTER TABLE `gametable_t` ENABLE KEYS */;

-- Dumping structure for event newstars.gc_event
DELIMITER //
CREATE DEFINER=`root`@`%` EVENT `gc_event` ON SCHEDULE EVERY 1 MINUTE STARTS '2019-02-27 16:25:16' ON COMPLETION PRESERVE ENABLE DO call delete_setttle()//
DELIMITER ;

-- Dumping structure for table newstars.global_config_t
CREATE TABLE IF NOT EXISTS `global_config_t` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `pay_switch` tinyint(4) NOT NULL DEFAULT '0' COMMENT '审核开关',
  `exchange_switch` tinyint(4) NOT NULL DEFAULT '0' COMMENT '兑换开关',
  `check_switch` tinyint(1) NOT NULL DEFAULT '0' COMMENT '检查开关',
  `website` text CHARACTER SET utf8 COLLATE utf8_bin COMMENT '官网',
  `gamesite` text CHARACTER SET utf8 COLLATE utf8_bin COMMENT '负载服务器',
  `gamesite_huanan` text CHARACTER SET utf8 COLLATE utf8_bin COMMENT '负载服务器',
  `gamesite_huadong` text CHARACTER SET utf8 COLLATE utf8_bin COMMENT '负载服务器',
  `gamesite_huabei` text CHARACTER SET utf8 COLLATE utf8_bin COMMENT '负载服务器',
  `pay_type` text CHARACTER SET utf8 COLLATE utf8_bin COMMENT '充值开关',
  `exchange_alipay` text CHARACTER SET utf8 COLLATE utf8_bin COMMENT '兑换配置',
  `exchange_bank` text CHARACTER SET utf8 COLLATE utf8_bin COMMENT '弃用',
  `gamesite_foreign` text CHARACTER SET utf8 COLLATE utf8_bin COMMENT '负载服务器',
  `vipconfig` text CHARACTER SET utf8 COLLATE utf8_bin,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8 COLLATE=utf8_bin ROW_FORMAT=DYNAMIC COMMENT='全局配置表';

-- Dumping data for table newstars.global_config_t: ~0 rows (大约)
/*!40000 ALTER TABLE `global_config_t` DISABLE KEYS */;
INSERT INTO `global_config_t` (`id`, `pay_switch`, `exchange_switch`, `check_switch`, `website`, `gamesite`, `gamesite_huanan`, `gamesite_huadong`, `gamesite_huabei`, `pay_type`, `exchange_alipay`, `exchange_bank`, `gamesite_foreign`, `vipconfig`) VALUES
	(1, 0, 0, 0, '192.168.1.8', '192.168.1.8', '192.168.1.8', '192.168.1.8', '192.168.1.8', '', '[{"Money":200,"Count":5},{"Type":1,"Open":true,"Money":50000},{"Type":2,"Money":100}]', '{"Open":true,"Money":5000,"Count":10,"Interval":5}', '192.168.1.8', '      \n{"VIPConf":[{"VipLvl":0,"VipValue":0,"FaceFrameids":[0]},{"VipLvl":1,"VipValue":30,"FaceFrameids":[1]},{"VipLvl":2,"VipValue":500,"FaceFrameids":[2]},{"VipLvl":3,"VipValue":3000,"FaceFrameids":[3]},{"VipLvl":4,"VipValue":10000,"FaceFrameids":[4]},{"VipLvl":5,"VipValue":30000,"FaceFrameids":[5]},{"VipLvl":6,"VipValue":70000,"FaceFrameids":[6]}]}');
/*!40000 ALTER TABLE `global_config_t` ENABLE KEYS */;

-- Dumping structure for table newstars.hall_mail_t
CREATE TABLE IF NOT EXISTS `hall_mail_t` (
  `mail_id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '邮件ID',
  `type` tinyint(1) DEFAULT NULL COMMENT '兑换申请:0,兑换成功:1,兑换失败:2,绑定成功:3',
  `mail_from_id` int(11) DEFAULT NULL COMMENT '发件人ID',
  `mail_to_id` int(11) DEFAULT NULL COMMENT '收件人ID',
  `title` varchar(50) DEFAULT NULL COMMENT '标题',
  `context` varchar(500) DEFAULT NULL COMMENT '邮件内容',
  `create_time` bigint(20) DEFAULT NULL COMMENT '创建时间',
  `expired_time` bigint(20) DEFAULT NULL COMMENT '过期时间',
  `mail_status` tinyint(1) DEFAULT NULL COMMENT '未读:0,已读:1',
  `send_time` bigint(20) DEFAULT NULL COMMENT '发送时间',
  `send_id` int(11) DEFAULT '0' COMMENT '操作人ID',
  `send_name` varchar(50) DEFAULT NULL COMMENT '操作人名称',
  `rollback_time` bigint(20) DEFAULT NULL COMMENT '撤回时间',
  `amount` decimal(18,3) DEFAULT '0.000' COMMENT '金币额',
  `amountstatus` int(11) DEFAULT '0' COMMENT '金币领取状态 0:未领取 1:已领取',
  PRIMARY KEY (`mail_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='大厅邮件信息';

-- Dumping data for table newstars.hall_mail_t: ~0 rows (大约)
/*!40000 ALTER TABLE `hall_mail_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `hall_mail_t` ENABLE KEYS */;

-- Dumping structure for table newstars.hall_mail_template_t
CREATE TABLE IF NOT EXISTS `hall_mail_template_t` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `name` varchar(50) NOT NULL COMMENT '模版名称',
  `value` varchar(500) DEFAULT NULL COMMENT '模版内容',
  `desc` varchar(500) DEFAULT NULL COMMENT '描述',
  PRIMARY KEY (`id`) USING BTREE,
  UNIQUE KEY `key_UNIQUE` (`name`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC COMMENT='邮件模版表';

-- Dumping data for table newstars.hall_mail_template_t: ~0 rows (大约)
/*!40000 ALTER TABLE `hall_mail_template_t` DISABLE KEYS */;
INSERT INTO `hall_mail_template_t` (`id`, `name`, `value`, `desc`) VALUES
	(1, 'EXCHANGE_APPLY', '您发起的“%0.2f元提现到%s，账号：%s 姓名：%s”兑换申请已提交至系统，系统正在处理中请稍等片刻。', '兑换申请邮件模板'),
	(2, 'EXCHANGE_SUCCESS', '您发起兑换申请“%0.2f元提现到%s，账号：%s 姓名：%s”已成功。', '兑换成功邮件模板'),
	(3, 'EXCHANGE_FAIL', '您发起的兑换申请“%0.2f元提现到%s，账号：%s 姓名：%s”系统处理失败。金币已退至保险箱，请注意查收。稍后核实您提交的账号名与真实姓名正确无误后，联系客服处理。', '兑换失败邮件模板'),
	(4, 'BIND_SUCCESS', '恭喜您注册成为正式会员，并获得%0.2f金币奖励。祝您游戏愉快！', '手机绑定成功邮件模板'),
	(5, 'PAY_SUCCESS', '恭喜您在%s年%s月%s日%s:%s通过专员充值成功充值%0.2f金币。金币已发放至保险箱，祝您游戏愉快！', '充值成功邮件'),
	(6, 'REFOUND_PAY', '您在%s年%s月%s日 %s:%s收到了一笔%0.2f元错误的订单。系统已经回收，对您带来的不便敬请谅解。', '充值订单退回邮件'),
	(7, 'FAST_RECHARGE', '恭喜您在%s年%s月%s日%s:%s使用%s成功充值%0.2f金币。金币已发放至携带金币，祝您游戏愉快！', '快捷充值');
/*!40000 ALTER TABLE `hall_mail_template_t` ENABLE KEYS */;

-- Dumping structure for event newstars.hour_event
DELIMITER //
CREATE DEFINER=`root`@`%` EVENT `hour_event` ON SCHEDULE EVERY 1 HOUR STARTS '2019-02-02 00:00:00' ON COMPLETION PRESERVE ENABLE DO call day_plan()//
DELIMITER ;

-- Dumping structure for table newstars.inventory_config_t
CREATE TABLE IF NOT EXISTS `inventory_config_t` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `game_kind_id` int(11) NOT NULL DEFAULT '0' COMMENT '游戏类型',
  `conotrol_type` tinyint(4) NOT NULL DEFAULT '0' COMMENT '0系统保护. 1送分',
  `low_threshold` decimal(18,2) NOT NULL DEFAULT '0.00' COMMENT '低阈值',
  `high_threshold` decimal(18,2) NOT NULL DEFAULT '0.00' COMMENT '高阈值',
  `percent` decimal(10,2) NOT NULL DEFAULT '0.00' COMMENT '控制概率百分比，0-100',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=41 DEFAULT CHARSET=utf8 COLLATE=utf8_bin ROW_FORMAT=DYNAMIC;

-- Dumping data for table newstars.inventory_config_t: ~0 rows (大约)
/*!40000 ALTER TABLE `inventory_config_t` DISABLE KEYS */;
INSERT INTO `inventory_config_t` (`id`, `game_kind_id`, `conotrol_type`, `low_threshold`, `high_threshold`, `percent`) VALUES
	(2, 3, 0, -9999999999.00, -80000.00, 50.00),
	(3, 3, 0, -80000.00, -60000.00, 25.00),
	(4, 3, 0, -60000.00, -40000.00, 20.00),
	(5, 3, 0, -40000.00, -20000.00, 15.00),
	(6, 3, 0, -20000.00, 0.00, 10.00),
	(7, 3, 0, 0.00, 20000.00, 5.00),
	(8, 6, 0, -999999999.00, -80000.00, 50.00),
	(9, 6, 0, -80000.00, -60000.00, 25.00),
	(10, 6, 0, -60000.00, -40000.00, 20.00),
	(11, 6, 0, -40000.00, -20000.00, 15.00),
	(12, 6, 0, -20000.00, 0.00, 10.00),
	(13, 6, 0, 0.00, 20000.00, 5.00),
	(14, 4, 0, -999999999.00, -80000.00, 50.00),
	(15, 4, 0, -80000.00, -60000.00, 25.00),
	(16, 4, 0, -60000.00, -40000.00, 20.00),
	(17, 4, 0, -40000.00, -20000.00, 15.00),
	(18, 4, 0, -20000.00, 0.00, 10.00),
	(19, 4, 0, 0.00, 20000.00, 5.00),
	(20, 7, 0, -999999999.00, -80000.00, 50.00),
	(21, 7, 0, -80000.00, -60000.00, 25.00),
	(22, 7, 0, -60000.00, -40000.00, 20.00),
	(23, 7, 0, -40000.00, -20000.00, 15.00),
	(24, 7, 0, -20000.00, 0.00, 10.00),
	(25, 7, 0, 0.00, 20000.00, 5.00),
	(26, 9, 0, -9999999999.00, -80000.00, 50.00),
	(27, 9, 0, -80000.00, -60000.00, 25.00),
	(28, 9, 0, -60000.00, -40000.00, 20.00),
	(29, 9, 0, -40000.00, -20000.00, 15.00),
	(39, 9, 0, -20000.00, 0.00, 10.00),
	(40, 9, 0, 0.00, 20000.00, 5.00);
/*!40000 ALTER TABLE `inventory_config_t` ENABLE KEYS */;

-- Dumping structure for table newstars.inventory_t
CREATE TABLE IF NOT EXISTS `inventory_t` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `roomid` int(11) DEFAULT NULL COMMENT '房间ID',
  `tableid` int(11) DEFAULT NULL COMMENT '桌台ID',
  `kindid` int(11) DEFAULT NULL COMMENT '游戏ID',
  `poolamount` decimal(18,6) DEFAULT NULL COMMENT '库存',
  `updatetime` bigint(20) DEFAULT NULL COMMENT '更新时间',
  `revenue` decimal(18,6) DEFAULT NULL COMMENT '营收',
  `threshold` decimal(18,6) DEFAULT '0.000000' COMMENT '阀值',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC COMMENT='库存表';

-- Dumping data for table newstars.inventory_t: ~0 rows (大约)
/*!40000 ALTER TABLE `inventory_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `inventory_t` ENABLE KEYS */;

-- Dumping structure for table newstars.inventory_user_t
CREATE TABLE IF NOT EXISTS `inventory_user_t` (
  `ID` int(11) NOT NULL AUTO_INCREMENT,
  `userid` int(11) DEFAULT NULL,
  `gamekindid` int(5) DEFAULT NULL,
  `amount` decimal(18,6) DEFAULT NULL,
  PRIMARY KEY (`ID`),
  KEY `Index_userid` (`userid`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

-- Dumping data for table newstars.inventory_user_t: ~0 rows (大约)
/*!40000 ALTER TABLE `inventory_user_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `inventory_user_t` ENABLE KEYS */;

-- Dumping structure for table newstars.login_info_t
CREATE TABLE IF NOT EXISTS `login_info_t` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `userid` int(11) DEFAULT NULL COMMENT '用户ID',
  `optime` bigint(20) DEFAULT NULL COMMENT '登陆时间',
  `type` tinyint(1) DEFAULT NULL COMMENT '登陆类型',
  `ip` varchar(45) DEFAULT NULL COMMENT 'IP',
  `iparea` varchar(45) DEFAULT NULL COMMENT 'Ip区域',
  `terminaltype` int(11) DEFAULT NULL COMMENT '终端类型',
  `osvesion` varchar(45) DEFAULT NULL COMMENT '版本号',
  `terminaldetail` varchar(45) DEFAULT NULL COMMENT '终端描述',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='操作日志表';

-- Dumping data for table newstars.login_info_t: ~0 rows (大约)
/*!40000 ALTER TABLE `login_info_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `login_info_t` ENABLE KEYS */;

-- Dumping structure for table newstars.lucky_list_t
CREATE TABLE IF NOT EXISTS `lucky_list_t` (
  `ID` int(11) NOT NULL AUTO_INCREMENT,
  `userid` int(11) DEFAULT NULL,
  `profit` decimal(18,6) DEFAULT NULL,
  `luckyprofit` decimal(18,6) DEFAULT NULL,
  `luckytime` bigint(20) DEFAULT NULL,
  `gamekindid` int(5) DEFAULT NULL,
  `gameids` varchar(500) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL,
  PRIMARY KEY (`ID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

-- Dumping data for table newstars.lucky_list_t: ~0 rows (大约)
/*!40000 ALTER TABLE `lucky_list_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `lucky_list_t` ENABLE KEYS */;

-- Dumping structure for table newstars.money_config_city_t
CREATE TABLE IF NOT EXISTS `money_config_city_t` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `city` varchar(128) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '城市',
  `pay` longtext CHARACTER SET utf8 COLLATE utf8_bin COMMENT '充值渠道',
  `vip` int(11) DEFAULT '1' COMMENT 'Vip充值开关',
  `exchange` longtext CHARACTER SET utf8 COLLATE utf8_bin COMMENT '兑换渠道',
  PRIMARY KEY (`id`),
  UNIQUE KEY `money_config_city_t_city_uindex` (`city`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='计费点城市配置表';

-- Dumping data for table newstars.money_config_city_t: ~0 rows (大约)
/*!40000 ALTER TABLE `money_config_city_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `money_config_city_t` ENABLE KEYS */;

-- Dumping structure for table newstars.money_config_province_t
CREATE TABLE IF NOT EXISTS `money_config_province_t` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `province` varchar(64) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '省份',
  `pay` longtext CHARACTER SET utf8 COLLATE utf8_bin COMMENT '充值渠道',
  `vip` int(11) DEFAULT '1' COMMENT 'Vip充值开关',
  `exchange` longtext CHARACTER SET utf8 COLLATE utf8_bin COMMENT '兑换渠道',
  PRIMARY KEY (`id`),
  UNIQUE KEY `money_config_province_t_province_uindex` (`province`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='计费点省份配置表';

-- Dumping data for table newstars.money_config_province_t: ~0 rows (大约)
/*!40000 ALTER TABLE `money_config_province_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `money_config_province_t` ENABLE KEYS */;

-- Dumping structure for table newstars.notice_t
CREATE TABLE IF NOT EXISTS `notice_t` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `device` tinyint(4) NOT NULL DEFAULT '0' COMMENT '设备类型',
  `type` tinyint(4) NOT NULL DEFAULT '0' COMMENT '公告类型',
  `title` varchar(50) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL DEFAULT '' COMMENT '标题',
  `context` varchar(500) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL DEFAULT '' COMMENT '公告内容',
  `start_time` bigint(20) NOT NULL DEFAULT '0' COMMENT '开始时间',
  `end_time` bigint(20) NOT NULL DEFAULT '0' COMMENT '结束时间',
  `create_time` bigint(20) NOT NULL DEFAULT '0' COMMENT '创建时间',
  `game_id` int(11) NOT NULL DEFAULT '0' COMMENT '平台',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='游戏公告';

-- Dumping data for table newstars.notice_t: ~0 rows (大约)
/*!40000 ALTER TABLE `notice_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `notice_t` ENABLE KEYS */;

-- Dumping structure for table newstars.pay_channel_config_t
CREATE TABLE IF NOT EXISTS `pay_channel_config_t` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `channel_id` int(11) NOT NULL COMMENT '通道编号',
  `status` tinyint(4) NOT NULL DEFAULT '0' COMMENT '0关闭. 1开启',
  `type` int(11) NOT NULL COMMENT '1: 支付宝 2: 微信 4: 银行卡  8:云闪付 9:外部支付宝 10:外部微信 11:外部银行卡 12:外部云闪付',
  `name` varchar(45) COLLATE utf8_bin NOT NULL,
  `priority` tinyint(4) NOT NULL DEFAULT '100' COMMENT '优先级，范围0-100，默认100',
  `limit_min` int(11) NOT NULL DEFAULT '0' COMMENT '随机额度最小金额',
  `limit_max` int(11) NOT NULL DEFAULT '0' COMMENT '随机额度最大金额',
  `fixed_amount` varchar(256) COLLATE utf8_bin NOT NULL DEFAULT '' COMMENT '定额，以","分割，如:"100,500,1000"',
  `base_amount` int(11) NOT NULL DEFAULT '1' COMMENT '基础金额，默认1。如配置100，则代表支付金额只支持随机额度内100的整数倍。',
  `pay_type` int(11) DEFAULT NULL COMMENT '对应pay_order_t充值订单的支付类型',
  `rate` decimal(18,3) DEFAULT '0.020' COMMENT '费率',
  `enable` tinyint(4) unsigned NOT NULL DEFAULT '1',
  `give_rate` decimal(18,3) DEFAULT '0.000',
  PRIMARY KEY (`id`) USING BTREE,
  UNIQUE KEY `channel_id_UNIQUE` (`channel_id`) USING BTREE,
  UNIQUE KEY `payType_UNIQUE` (`pay_type`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin ROW_FORMAT=DYNAMIC;

-- Dumping data for table newstars.pay_channel_config_t: ~96 rows (大约)
/*!40000 ALTER TABLE `pay_channel_config_t` DISABLE KEYS */;
INSERT INTO `pay_channel_config_t` (`id`, `channel_id`, `status`, `type`, `name`, `priority`, `limit_min`, `limit_max`, `fixed_amount`, `base_amount`, `pay_type`, `rate`, `enable`, `give_rate`) VALUES
	(1, 201, 0, 1, '小叮当支付宝', 100, 100, 5000, '', 1, 201, 0.020, 1, 0.000),
	(2, 202, 0, 2, '小叮当微信', 100, 100, 5000, '', 1, 202, 0.020, 1, 0.000),
	(3, 204, 0, 4, '小叮当联合支付', 100, 100, 5000, '', 1, 204, 0.020, 1, 0.000),
	(4, 211, 0, 1, '叮支付支付宝个码H5', 100, 100, 5000, '', 1, 211, 0.020, 1, 0.000),
	(5, 212, 0, 1, '叮支付洋洋H5支付宝', 100, 100, 5000, '', 1, 212, 0.020, 1, 0.000),
	(6, 213, 0, 2, '叮支付微信原生扫码', 100, 100, 5000, '', 1, 213, 0.020, 1, 0.000),
	(7, 214, 0, 2, '叮支付来米微信个码', 100, 100, 5000, '', 1, 214, 0.020, 1, 0.000),
	(8, 215, 0, 1, '叮支付来米支付宝个码', 100, 100, 5000, '', 1, 215, 0.020, 1, 0.000),
	(9, 216, 0, 2, '小叮当Square微信', 100, 500, 5000, '', 1, 216, 0.020, 1, 0.000),
	(10, 217, 0, 1, '小叮当Square支付宝', 100, 50, 100, '', 1, 217, 0.020, 1, 0.000),
	(11, 218, 0, 4, '小叮当Square银联', 100, 500, 5000, '', 1, 218, 0.020, 1, 0.000),
	(12, 219, 0, 2, '星光微信', 100, 1, 5000, '', 1, 219, 0.020, 1, 0.000),
	(13, 220, 1, 1, '星光支付宝', 100, 50, 5000, '', 1, 220, 0.020, 1, 0.000),
	(14, 221, 1, 2, 'IN Service 微信', 100, 500, 10000, '', 1, 221, 0.020, 1, 0.000),
	(15, 222, 1, 1, 'IN Service 支付宝', 100, 50, 10000, '50,100,300,500,1000,2000,5000,10000', 1, 222, 0.020, 1, 0.000),
	(16, 223, 1, 4, 'IN Service 银联', 100, 10, 3000, '', 1, 223, 0.020, 1, 0.000),
	(17, 224, 1, 8, 'IN Service 银闪付', 100, 100, 10000, '', 1, 224, 0.020, 1, 0.000),
	(18, 230, 1, 1, '牛牛支付宝', 100, 50, 10000, '', 1, 230, 0.020, 1, 0.000);
/*!40000 ALTER TABLE `pay_channel_config_t` ENABLE KEYS */;

-- Dumping structure for table newstars.pay_duplicate_order_t
CREATE TABLE IF NOT EXISTS `pay_duplicate_order_t` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `order_number` varchar(64) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT '' COMMENT '订单号',
  `user_id` int(11) DEFAULT NULL COMMENT '玩家ID',
  `status` tinyint(4) NOT NULL DEFAULT '0' COMMENT '支付状态',
  `pay_type` tinyint(4) NOT NULL DEFAULT '0' COMMENT '支付方式',
  `channel_money` decimal(18,2) NOT NULL DEFAULT '0.00' COMMENT '手续费',
  `real_money` decimal(18,2) NOT NULL DEFAULT '0.00' COMMENT '实际金额',
  `get_money` decimal(18,2) NOT NULL DEFAULT '0.00' COMMENT '到账金额',
  `time` bigint(20) NOT NULL DEFAULT '0' COMMENT '订单时间',
  `device` tinyint(4) NOT NULL DEFAULT '0' COMMENT '设备类型',
  `day_key` int(11) NOT NULL DEFAULT '0' COMMENT '日期',
  `hour_key` int(11) NOT NULL DEFAULT '0' COMMENT '小时',
  `platform_order_number` varchar(64) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL COMMENT '第三方订单号',
  `ip` varchar(45) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL COMMENT 'ip',
  `mac` varchar(45) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL COMMENT '机器码',
  `arrivaltime` bigint(20) DEFAULT '0' COMMENT '回调时间',
  `upstream_order` varchar(100) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT '' COMMENT '流水号',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='重复订单';

-- Dumping data for table newstars.pay_duplicate_order_t: ~0 rows (大约)
/*!40000 ALTER TABLE `pay_duplicate_order_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `pay_duplicate_order_t` ENABLE KEYS */;

-- Dumping structure for table newstars.pay_money_config_t
CREATE TABLE IF NOT EXISTS `pay_money_config_t` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `type` tinyint(4) NOT NULL DEFAULT '0' COMMENT '支付类型',
  `value` varchar(255) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL COMMENT '金额列表',
  `ok` tinyint(1) NOT NULL DEFAULT '0' COMMENT '打开状态 1:打开 2：关闭',
  `success_count` bigint(20) NOT NULL DEFAULT '0' COMMENT '成功次数',
  `all_count` bigint(20) NOT NULL DEFAULT '0' COMMENT '所有次数',
  `money` double NOT NULL DEFAULT '0' COMMENT '充值总金额',
  `name` varchar(45) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL COMMENT '渠道名称',
  PRIMARY KEY (`id`),
  UNIQUE KEY `type` (`type`)
) ENGINE=InnoDB AUTO_INCREMENT=16 DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='支付渠道';

-- Dumping data for table newstars.pay_money_config_t: ~0 rows (大约)
/*!40000 ALTER TABLE `pay_money_config_t` DISABLE KEYS */;
INSERT INTO `pay_money_config_t` (`id`, `type`, `value`, `ok`, `success_count`, `all_count`, `money`, `name`) VALUES
	(1, 1, '10,50,100,300,500,600,1000,5000', 1, 0, 0, 1700, '支付宝'),
	(2, 2, '10,50,100,300,500,600,1000,2000', 1, 0, 0, 1012200, '微信'),
	(3, 3, '49,99,499,999,1499,1999,2999,4999', 1, 0, 0, 6400, 'QQ'),
	(4, 4, '49,99,499,999,1499,1999,2999,4999', 1, 0, 0, 0, '银行卡'),
	(5, 5, '49,99,499,999,1499,1999,2999,4999', 1, 0, 0, 0, '京东'),
	(6, 6, 'http://hello.com', 1, 0, 0, 0, 'PC'),
	(8, 0, '48,98,168,268,368,518,668,948', 1, 0, 0, 0, '专员'),
	(9, 100, '10,100,300,500,1000,3000,5000,10000', 1, 0, 0, 0, '易充纵游卡'),
	(10, 101, '10,100,300,500,1000,3000,5000,10000', 1, 0, 0, 0, '移动话费卡'),
	(11, 102, '10,100,300,500,1000,3000,5000,10000', 1, 0, 0, 0, '电信话费卡'),
	(12, 103, '10,100,300,500,1000,3000,5000,10000', 1, 0, 0, 0, '联通话费卡'),
	(13, 99, '10,50,100,300,500,600,1000,5000', 1, 0, 0, 0, 'W1支付宝'),
	(14, 98, '10,50,100,300,500,600,1000,5000', 1, 0, 0, 0, '乐付'),
	(15, 97, '10,50,100,300,500,600,1000,5000', 1, 0, 0, 0, '好付H5');
/*!40000 ALTER TABLE `pay_money_config_t` ENABLE KEYS */;

-- Dumping structure for table newstars.pay_order_t
CREATE TABLE IF NOT EXISTS `pay_order_t` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `order_number` varchar(64) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '订单号',
  `user_id` int(11) NOT NULL COMMENT '玩家ID',
  `status` tinyint(4) NOT NULL DEFAULT '0' COMMENT '支付状态',
  `pay_type` int(11) NOT NULL DEFAULT '0' COMMENT '支付方式',
  `channel_money` decimal(18,2) NOT NULL DEFAULT '0.00' COMMENT '手续费',
  `real_money` decimal(18,2) NOT NULL DEFAULT '0.00' COMMENT '订单金额',
  `get_money` decimal(18,2) NOT NULL DEFAULT '0.00' COMMENT '到账金额',
  `time` bigint(20) NOT NULL DEFAULT '0' COMMENT '订单时间',
  `device` tinyint(4) NOT NULL DEFAULT '0' COMMENT '设备类型',
  `day_key` int(11) NOT NULL DEFAULT '0' COMMENT '日期',
  `hour_key` int(11) NOT NULL DEFAULT '0' COMMENT '小时',
  `platform_order_number` varchar(64) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL COMMENT '第三方订单号',
  `ip` varchar(45) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL COMMENT 'IP',
  `mac` varchar(45) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL COMMENT '机器码',
  `arrivaltime` bigint(20) DEFAULT '0' COMMENT '回调时间',
  `upstream_order` varchar(100) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT '' COMMENT '流水号',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='充值订单';

-- Dumping data for table newstars.pay_order_t: ~0 rows (大约)
/*!40000 ALTER TABLE `pay_order_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `pay_order_t` ENABLE KEYS */;

-- Dumping structure for table newstars.phone_info_t
CREATE TABLE IF NOT EXISTS `phone_info_t` (
  `machinecode` varchar(50) NOT NULL COMMENT '机器码',
  `manufacturer` varchar(100) DEFAULT NULL COMMENT '厂商',
  `phone_model` varchar(100) DEFAULT NULL COMMENT '手机型号',
  `phone_code` varchar(100) DEFAULT NULL COMMENT '手机码',
  `resolution` varchar(100) DEFAULT NULL COMMENT '分辨率',
  `init_system_version` varchar(100) DEFAULT NULL COMMENT '初始系统版本号',
  `last_system_version` varchar(100) DEFAULT NULL COMMENT '最新系统版本号',
  `client_version` varchar(100) DEFAULT NULL COMMENT '客户端版本',
  `inside_ip` varchar(45) DEFAULT NULL COMMENT '内部IP',
  PRIMARY KEY (`machinecode`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='设备信息表';

-- Dumping data for table newstars.phone_info_t: ~0 rows (大约)
/*!40000 ALTER TABLE `phone_info_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `phone_info_t` ENABLE KEYS */;

-- Dumping structure for table newstars.record_amount_0_t
CREATE TABLE IF NOT EXISTS `record_amount_0_t` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `userid` int(11) NOT NULL COMMENT '用户ID',
  `type` int(11) NOT NULL COMMENT '变更类型',
  `roundcode` varchar(45) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT '' COMMENT '局号',
  `startamount` decimal(18,3) DEFAULT NULL COMMENT '开始金额',
  `endamount` decimal(18,3) DEFAULT NULL COMMENT '结束金额',
  `alteramount` decimal(18,3) DEFAULT NULL COMMENT '变更金额',
  `bankamount` decimal(18,2) DEFAULT NULL COMMENT '保险箱金额',
  `starttime` bigint(20) DEFAULT NULL COMMENT '开始时间',
  `endtime` bigint(20) DEFAULT NULL COMMENT '结束时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='金币记录表';

-- Dumping data for table newstars.record_amount_0_t: ~0 rows (大约)
/*!40000 ALTER TABLE `record_amount_0_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `record_amount_0_t` ENABLE KEYS */;

-- Dumping structure for table newstars.record_amount_1_t
CREATE TABLE IF NOT EXISTS `record_amount_1_t` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `userid` int(11) NOT NULL COMMENT '用户ID',
  `type` int(11) NOT NULL COMMENT '变更类型',
  `roundcode` varchar(45) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT '' COMMENT '局号',
  `startamount` decimal(18,3) DEFAULT NULL COMMENT '开始金额',
  `endamount` decimal(18,3) DEFAULT NULL COMMENT '结束金额',
  `alteramount` decimal(18,3) DEFAULT NULL COMMENT '变更金额',
  `bankamount` decimal(18,2) DEFAULT NULL COMMENT '保险箱金额',
  `starttime` bigint(20) DEFAULT NULL COMMENT '开始时间',
  `endtime` bigint(20) DEFAULT NULL COMMENT '结束时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='金币记录表';

-- Dumping data for table newstars.record_amount_1_t: ~0 rows (大约)
/*!40000 ALTER TABLE `record_amount_1_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `record_amount_1_t` ENABLE KEYS */;

-- Dumping structure for table newstars.record_amount_2_t
CREATE TABLE IF NOT EXISTS `record_amount_2_t` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `userid` int(11) NOT NULL COMMENT '用户ID',
  `type` int(11) NOT NULL COMMENT '变更类型',
  `roundcode` varchar(45) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT '' COMMENT '局号',
  `startamount` decimal(18,3) DEFAULT NULL COMMENT '开始金额',
  `endamount` decimal(18,3) DEFAULT NULL COMMENT '结束金额',
  `alteramount` decimal(18,3) DEFAULT NULL COMMENT '变更金额',
  `bankamount` decimal(18,2) DEFAULT NULL COMMENT '保险箱金额',
  `starttime` bigint(20) DEFAULT NULL COMMENT '开始时间',
  `endtime` bigint(20) DEFAULT NULL COMMENT '结束时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='金币记录表';

-- Dumping data for table newstars.record_amount_2_t: ~0 rows (大约)
/*!40000 ALTER TABLE `record_amount_2_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `record_amount_2_t` ENABLE KEYS */;

-- Dumping structure for table newstars.record_amount_3_t
CREATE TABLE IF NOT EXISTS `record_amount_3_t` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `userid` int(11) NOT NULL COMMENT '用户ID',
  `type` int(11) NOT NULL COMMENT '变更类型',
  `roundcode` varchar(45) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT '' COMMENT '局号',
  `startamount` decimal(18,3) DEFAULT NULL COMMENT '开始金额',
  `endamount` decimal(18,3) DEFAULT NULL COMMENT '结束金额',
  `alteramount` decimal(18,3) DEFAULT NULL COMMENT '变更金额',
  `bankamount` decimal(18,2) DEFAULT NULL COMMENT '保险箱金额',
  `starttime` bigint(20) DEFAULT NULL COMMENT '开始时间',
  `endtime` bigint(20) DEFAULT NULL COMMENT '结束时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='金币记录表';

-- Dumping data for table newstars.record_amount_3_t: ~0 rows (大约)
/*!40000 ALTER TABLE `record_amount_3_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `record_amount_3_t` ENABLE KEYS */;

-- Dumping structure for table newstars.record_amount_4_t
CREATE TABLE IF NOT EXISTS `record_amount_4_t` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `userid` int(11) NOT NULL COMMENT '用户ID',
  `type` int(11) NOT NULL COMMENT '变更类型',
  `roundcode` varchar(45) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT '' COMMENT '局号',
  `startamount` decimal(18,3) DEFAULT NULL COMMENT '开始金额',
  `endamount` decimal(18,3) DEFAULT NULL COMMENT '结束金额',
  `alteramount` decimal(18,3) DEFAULT NULL COMMENT '变更金额',
  `bankamount` decimal(18,2) DEFAULT NULL COMMENT '保险箱金额',
  `starttime` bigint(20) DEFAULT NULL COMMENT '开始时间',
  `endtime` bigint(20) DEFAULT NULL COMMENT '结束时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='金币记录表';

-- Dumping data for table newstars.record_amount_4_t: ~0 rows (大约)
/*!40000 ALTER TABLE `record_amount_4_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `record_amount_4_t` ENABLE KEYS */;

-- Dumping structure for table newstars.record_amount_5_t
CREATE TABLE IF NOT EXISTS `record_amount_5_t` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `userid` int(11) NOT NULL COMMENT '用户ID',
  `type` int(11) NOT NULL COMMENT '变更类型',
  `roundcode` varchar(45) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT '' COMMENT '局号',
  `startamount` decimal(18,3) DEFAULT NULL COMMENT '开始金额',
  `endamount` decimal(18,3) DEFAULT NULL COMMENT '结束金额',
  `alteramount` decimal(18,3) DEFAULT NULL COMMENT '变更金额',
  `bankamount` decimal(18,2) DEFAULT NULL COMMENT '保险箱金额',
  `starttime` bigint(20) DEFAULT NULL COMMENT '开始时间',
  `endtime` bigint(20) DEFAULT NULL COMMENT '结束时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='金币记录表';

-- Dumping data for table newstars.record_amount_5_t: ~0 rows (大约)
/*!40000 ALTER TABLE `record_amount_5_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `record_amount_5_t` ENABLE KEYS */;

-- Dumping structure for table newstars.record_amount_6_t
CREATE TABLE IF NOT EXISTS `record_amount_6_t` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `userid` int(11) NOT NULL COMMENT '用户ID',
  `type` int(11) NOT NULL COMMENT '变更类型',
  `roundcode` varchar(45) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT '' COMMENT '局号',
  `startamount` decimal(18,3) DEFAULT NULL COMMENT '开始金额',
  `endamount` decimal(18,3) DEFAULT NULL COMMENT '结束金额',
  `alteramount` decimal(18,3) DEFAULT NULL COMMENT '变更金额',
  `bankamount` decimal(18,2) DEFAULT NULL COMMENT '保险箱金额',
  `starttime` bigint(20) DEFAULT NULL COMMENT '开始时间',
  `endtime` bigint(20) DEFAULT NULL COMMENT '结束时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='金币记录表';

-- Dumping data for table newstars.record_amount_6_t: ~0 rows (大约)
/*!40000 ALTER TABLE `record_amount_6_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `record_amount_6_t` ENABLE KEYS */;

-- Dumping structure for table newstars.record_amount_7_t
CREATE TABLE IF NOT EXISTS `record_amount_7_t` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `userid` int(11) NOT NULL COMMENT '用户ID',
  `type` int(11) NOT NULL COMMENT '变更类型',
  `roundcode` varchar(45) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT '' COMMENT '局号',
  `startamount` decimal(18,3) DEFAULT NULL COMMENT '开始金额',
  `endamount` decimal(18,3) DEFAULT NULL COMMENT '结束金额',
  `alteramount` decimal(18,3) DEFAULT NULL COMMENT '变更金额',
  `bankamount` decimal(18,2) DEFAULT NULL COMMENT '保险箱金额',
  `starttime` bigint(20) DEFAULT NULL COMMENT '开始时间',
  `endtime` bigint(20) DEFAULT NULL COMMENT '结束时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='金币记录表';

-- Dumping data for table newstars.record_amount_7_t: ~0 rows (大约)
/*!40000 ALTER TABLE `record_amount_7_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `record_amount_7_t` ENABLE KEYS */;

-- Dumping structure for table newstars.record_amount_8_t
CREATE TABLE IF NOT EXISTS `record_amount_8_t` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `userid` int(11) NOT NULL COMMENT '用户ID',
  `type` int(11) NOT NULL COMMENT '变更类型',
  `roundcode` varchar(45) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT '' COMMENT '局号',
  `startamount` decimal(18,3) DEFAULT NULL COMMENT '开始金额',
  `endamount` decimal(18,3) DEFAULT NULL COMMENT '结束金额',
  `alteramount` decimal(18,3) DEFAULT NULL COMMENT '变更金额',
  `bankamount` decimal(18,2) DEFAULT NULL COMMENT '保险箱金额',
  `starttime` bigint(20) DEFAULT NULL COMMENT '开始时间',
  `endtime` bigint(20) DEFAULT NULL COMMENT '结束时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='金币记录表';

-- Dumping data for table newstars.record_amount_8_t: ~0 rows (大约)
/*!40000 ALTER TABLE `record_amount_8_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `record_amount_8_t` ENABLE KEYS */;

-- Dumping structure for table newstars.record_amount_9_t
CREATE TABLE IF NOT EXISTS `record_amount_9_t` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `userid` int(11) NOT NULL COMMENT '用户ID',
  `type` int(11) NOT NULL COMMENT '变更类型',
  `roundcode` varchar(45) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT '' COMMENT '局号',
  `startamount` decimal(18,3) DEFAULT NULL COMMENT '开始金额',
  `endamount` decimal(18,3) DEFAULT NULL COMMENT '结束金额',
  `alteramount` decimal(18,3) DEFAULT NULL COMMENT '变更金额',
  `bankamount` decimal(18,2) DEFAULT NULL COMMENT '保险箱金额',
  `starttime` bigint(20) DEFAULT NULL COMMENT '开始时间',
  `endtime` bigint(20) DEFAULT NULL COMMENT '结束时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='金币记录表';

-- Dumping data for table newstars.record_amount_9_t: ~0 rows (大约)
/*!40000 ALTER TABLE `record_amount_9_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `record_amount_9_t` ENABLE KEYS */;

-- Dumping structure for table newstars.record_bankinout_t
CREATE TABLE IF NOT EXISTS `record_bankinout_t` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `userid` int(11) DEFAULT NULL COMMENT '玩家ID',
  `amount` decimal(18,2) DEFAULT NULL COMMENT '操作金币',
  `optype` int(11) DEFAULT NULL COMMENT '操作类型',
  `optime` bigint(20) DEFAULT NULL COMMENT '操作时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='保险箱存取记录';

-- Dumping data for table newstars.record_bankinout_t: ~0 rows (大约)
/*!40000 ALTER TABLE `record_bankinout_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `record_bankinout_t` ENABLE KEYS */;

-- Dumping structure for table newstars.record_exchange_t
CREATE TABLE IF NOT EXISTS `record_exchange_t` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `userid` int(11) DEFAULT NULL,
  `exchangetype` int(11) DEFAULT NULL,
  `exchangeamount` decimal(18,2) DEFAULT NULL,
  `description` varchar(45) DEFAULT NULL,
  `starttime` bigint(20) DEFAULT NULL,
  `endtime` bigint(20) DEFAULT NULL,
  `result` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `userid_UNIQUE` (`userid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- Dumping data for table newstars.record_exchange_t: ~0 rows (大约)
/*!40000 ALTER TABLE `record_exchange_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `record_exchange_t` ENABLE KEYS */;

-- Dumping structure for table newstars.record_ox_t
CREATE TABLE IF NOT EXISTS `record_ox_t` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `roundname` varchar(45) DEFAULT NULL,
  `creattime` bigint(20) DEFAULT NULL,
  `area1` tinyint(4) DEFAULT NULL,
  `area2` tinyint(4) DEFAULT NULL,
  `area3` tinyint(4) DEFAULT NULL,
  `area4` tinyint(4) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `Index_time` (`creattime`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- Dumping data for table newstars.record_ox_t: ~0 rows (大约)
/*!40000 ALTER TABLE `record_ox_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `record_ox_t` ENABLE KEYS */;

-- Dumping structure for table newstars.record_recharge_t
CREATE TABLE IF NOT EXISTS `record_recharge_t` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `srcid` int(11) DEFAULT NULL,
  `userid` int(11) DEFAULT NULL,
  `recharge` decimal(18,2) DEFAULT NULL,
  `optime` bigint(20) DEFAULT NULL,
  `type` int(11) DEFAULT NULL,
  `rechargebank` decimal(18,2) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- Dumping data for table newstars.record_recharge_t: ~0 rows (大约)
/*!40000 ALTER TABLE `record_recharge_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `record_recharge_t` ENABLE KEYS */;

-- Dumping structure for table newstars.refound_exchange_t
CREATE TABLE IF NOT EXISTS `refound_exchange_t` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `userid` int(11) DEFAULT NULL COMMENT '用户ID',
  `orderid` varchar(45) DEFAULT NULL COMMENT '订单号',
  `amount` decimal(18,2) DEFAULT NULL COMMENT '金额',
  `time` bigint(20) DEFAULT NULL COMMENT '订单时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='冲正清单';

-- Dumping data for table newstars.refound_exchange_t: ~0 rows (大约)
/*!40000 ALTER TABLE `refound_exchange_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `refound_exchange_t` ENABLE KEYS */;

-- Dumping structure for table newstars.refound_pay_t
CREATE TABLE IF NOT EXISTS `refound_pay_t` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `userid` int(11) DEFAULT NULL COMMENT '玩家ID',
  `payid` int(11) DEFAULT NULL COMMENT '订单ID',
  `amount` decimal(18,2) DEFAULT NULL COMMENT '金额',
  `creatime` bigint(20) DEFAULT NULL COMMENT '创建时间',
  `status` tinyint(1) DEFAULT NULL COMMENT '状态',
  PRIMARY KEY (`id`),
  UNIQUE KEY `payid_UNIQUE` (`payid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='撤单';

-- Dumping data for table newstars.refound_pay_t: ~0 rows (大约)
/*!40000 ALTER TABLE `refound_pay_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `refound_pay_t` ENABLE KEYS */;

-- Dumping structure for table newstars.roll_text_t
CREATE TABLE IF NOT EXISTS `roll_text_t` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `device` tinyint(4) NOT NULL DEFAULT '0' COMMENT '设备类型',
  `status` tinyint(1) NOT NULL DEFAULT '0' COMMENT '状态',
  `circle` int(11) NOT NULL DEFAULT '1' COMMENT '循环间隔',
  `context` varchar(255) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL DEFAULT '' COMMENT '内容',
  `start_time` bigint(20) DEFAULT NULL COMMENT '开始时间',
  `end_time` bigint(20) DEFAULT NULL COMMENT '结束时间',
  `game_id` int(11) NOT NULL DEFAULT '0' COMMENT '平台ID',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='跑马灯';

-- Dumping data for table newstars.roll_text_t: ~0 rows (大约)
/*!40000 ALTER TABLE `roll_text_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `roll_text_t` ENABLE KEYS */;

-- Dumping structure for table newstars.round_record_duofu_t
CREATE TABLE IF NOT EXISTS `round_record_duofu_t` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `roundname` varchar(45) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL,
  `history` blob,
  `settletime` bigint(20) DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE,
  UNIQUE KEY `roundname_UNIQUE` (`roundname`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin ROW_FORMAT=DYNAMIC;

-- Dumping data for table newstars.round_record_duofu_t: ~0 rows (大约)
/*!40000 ALTER TABLE `round_record_duofu_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `round_record_duofu_t` ENABLE KEYS */;

-- Dumping structure for table newstars.round_record_t
CREATE TABLE IF NOT EXISTS `round_record_t` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `roundname` varchar(45) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL COMMENT '局号',
  `history` blob COMMENT '牌局详情',
  `settletime` bigint(20) DEFAULT NULL COMMENT '结算时间',
  `kind` int(11) DEFAULT NULL COMMENT '游戏类型',
  PRIMARY KEY (`id`),
  UNIQUE KEY `roundname_UNIQUE` (`roundname`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='牌局记录';

-- Dumping data for table newstars.round_record_t: ~0 rows (大约)
/*!40000 ALTER TABLE `round_record_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `round_record_t` ENABLE KEYS */;

-- Dumping structure for table newstars.settlement_baccarat_t
CREATE TABLE IF NOT EXISTS `settlement_baccarat_t` (
  `settleid` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `roundcode` varchar(45) DEFAULT NULL COMMENT '局号',
  `gametableid` int(11) DEFAULT NULL COMMENT '桌台ID',
  `userid` int(11) DEFAULT NULL COMMENT '玩家ID',
  `betamount` decimal(18,2) DEFAULT NULL COMMENT '下注金额',
  `actualamount` decimal(18,2) DEFAULT NULL COMMENT '实际金额',
  `odds` decimal(18,2) DEFAULT NULL COMMENT '倍率',
  `bettype` int(11) DEFAULT NULL COMMENT '下注类型',
  `payoffvalue` decimal(18,2) DEFAULT NULL COMMENT '结算值',
  `results` text COMMENT '开局结果',
  `bettime` bigint(20) DEFAULT NULL COMMENT '下注时间',
  `settletime` bigint(20) DEFAULT NULL COMMENT '结算时间',
  `revenue` decimal(18,2) DEFAULT '0.00' COMMENT '税收',
  PRIMARY KEY (`settleid`),
  KEY `Index_settletime` (`settletime`),
  KEY `Index_code` (`roundcode`),
  KEY `Index_userid` (`userid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='百家乐结算表';

-- Dumping data for table newstars.settlement_baccarat_t: ~0 rows (大约)
/*!40000 ALTER TABLE `settlement_baccarat_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `settlement_baccarat_t` ENABLE KEYS */;

-- Dumping structure for table newstars.settlement_benz_t
CREATE TABLE IF NOT EXISTS `settlement_benz_t` (
  `settleid` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `roundcode` varchar(45) DEFAULT NULL COMMENT '局号',
  `gametableid` int(11) DEFAULT NULL COMMENT '桌台号',
  `userid` int(11) DEFAULT NULL COMMENT '用户ID',
  `betamount` decimal(18,2) DEFAULT NULL COMMENT '下注金额',
  `actualamount` decimal(18,2) DEFAULT NULL COMMENT '实际金额',
  `odds` decimal(18,2) DEFAULT NULL COMMENT '倍率',
  `bettype` int(11) DEFAULT NULL COMMENT '下注类型',
  `payoffvalue` decimal(18,2) DEFAULT NULL COMMENT '结算值',
  `results` text COMMENT '开局结果',
  `bettime` bigint(20) DEFAULT NULL COMMENT '下注时间',
  `settletime` bigint(20) DEFAULT NULL COMMENT '结算时间',
  `revenue` decimal(18,2) DEFAULT '0.00' COMMENT '税收',
  PRIMARY KEY (`settleid`),
  KEY `Index_settletime` (`settletime`),
  KEY `Index_code` (`roundcode`),
  KEY `Index_userid` (`userid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='奔驰宝马结算表';

-- Dumping data for table newstars.settlement_benz_t: ~0 rows (大约)
/*!40000 ALTER TABLE `settlement_benz_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `settlement_benz_t` ENABLE KEYS */;

-- Dumping structure for table newstars.settlement_dt_t
CREATE TABLE IF NOT EXISTS `settlement_dt_t` (
  `settleid` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `roundcode` varchar(45) DEFAULT NULL COMMENT '局号',
  `gametableid` int(11) DEFAULT NULL COMMENT '桌台号',
  `userid` int(11) DEFAULT NULL COMMENT '用户ID',
  `betamount` decimal(18,2) DEFAULT NULL COMMENT '下注金额',
  `actualamount` decimal(18,2) DEFAULT NULL COMMENT '实际金额',
  `odds` decimal(18,2) DEFAULT NULL COMMENT '倍率',
  `bettype` int(11) DEFAULT NULL COMMENT '下注类型',
  `payoffvalue` decimal(18,2) DEFAULT NULL COMMENT '结算值',
  `results` text COMMENT '开牌结果',
  `bettime` bigint(20) DEFAULT NULL COMMENT '下注时间',
  `settletime` bigint(20) DEFAULT NULL COMMENT '结算时间',
  `revenue` decimal(18,2) DEFAULT '0.00' COMMENT '税收',
  PRIMARY KEY (`settleid`),
  KEY `Index_settletime` (`settletime`) USING BTREE,
  KEY `Index_code` (`roundcode`) USING BTREE,
  KEY `Index_userid` (`userid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='龙虎结算表';

-- Dumping data for table newstars.settlement_dt_t: ~0 rows (大约)
/*!40000 ALTER TABLE `settlement_dt_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `settlement_dt_t` ENABLE KEYS */;

-- Dumping structure for table newstars.settlement_duofu_free_t
CREATE TABLE IF NOT EXISTS `settlement_duofu_free_t` (
  `settleid` int(11) NOT NULL AUTO_INCREMENT,
  `roundcode` varchar(45) DEFAULT NULL,
  `gametableid` int(11) DEFAULT NULL,
  `userid` int(11) DEFAULT NULL,
  `betamount` decimal(18,2) DEFAULT NULL,
  `actualamount` decimal(18,2) DEFAULT NULL,
  `odds` decimal(18,2) DEFAULT NULL,
  `bettype` int(11) DEFAULT NULL,
  `payoffvalue` decimal(18,6) DEFAULT NULL,
  `results` text,
  `bettime` bigint(20) DEFAULT NULL,
  `settletime` bigint(20) DEFAULT NULL,
  `revenue` decimal(18,6) DEFAULT '0.000000',
  PRIMARY KEY (`settleid`) USING BTREE,
  KEY `Index_settletime` (`settletime`) USING BTREE,
  KEY `Index_code` (`roundcode`) USING BTREE,
  KEY `Index_userid` (`userid`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC;

-- Dumping data for table newstars.settlement_duofu_free_t: ~0 rows (大约)
/*!40000 ALTER TABLE `settlement_duofu_free_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `settlement_duofu_free_t` ENABLE KEYS */;

-- Dumping structure for table newstars.settlement_duofu_t
CREATE TABLE IF NOT EXISTS `settlement_duofu_t` (
  `settleid` int(11) NOT NULL AUTO_INCREMENT,
  `roundcode` varchar(45) DEFAULT NULL,
  `gametableid` int(11) DEFAULT NULL,
  `userid` int(11) DEFAULT NULL,
  `betamount` decimal(18,2) DEFAULT NULL,
  `actualamount` decimal(18,2) DEFAULT NULL,
  `odds` decimal(18,2) DEFAULT NULL,
  `bettype` int(11) DEFAULT NULL,
  `payoffvalue` decimal(18,6) DEFAULT NULL,
  `results` text,
  `bettime` bigint(20) DEFAULT NULL,
  `settletime` bigint(20) DEFAULT NULL,
  `revenue` decimal(18,6) DEFAULT '0.000000',
  PRIMARY KEY (`settleid`) USING BTREE,
  KEY `Index_settletime` (`settletime`) USING BTREE,
  KEY `Index_code` (`roundcode`) USING BTREE,
  KEY `Index_userid` (`userid`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC;

-- Dumping data for table newstars.settlement_duofu_t: ~0 rows (大约)
/*!40000 ALTER TABLE `settlement_duofu_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `settlement_duofu_t` ENABLE KEYS */;

-- Dumping structure for table newstars.settlement_fish_t
CREATE TABLE IF NOT EXISTS `settlement_fish_t` (
  `settleid` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `roundcode` varchar(45) DEFAULT NULL COMMENT '局号',
  `gametableid` int(11) DEFAULT NULL COMMENT '桌台号',
  `userid` int(11) DEFAULT NULL COMMENT '用户ID',
  `betamount` decimal(18,3) DEFAULT NULL COMMENT '下注金额',
  `actualamount` decimal(18,3) DEFAULT NULL COMMENT '实际金额',
  `odds` decimal(18,3) DEFAULT NULL COMMENT '倍率',
  `bettype` int(11) DEFAULT NULL COMMENT '下注类型',
  `payoffvalue` decimal(18,3) DEFAULT NULL COMMENT '结算值',
  `results` text COMMENT '开牌结果',
  `bettime` bigint(20) DEFAULT NULL COMMENT '下注时间',
  `settletime` bigint(20) DEFAULT NULL COMMENT '结算时间',
  `revenue` decimal(18,6) DEFAULT '0.000000' COMMENT '税收',
  PRIMARY KEY (`settleid`),
  KEY `Index_settletime` (`settletime`) USING BTREE,
  KEY `Index_code` (`roundcode`) USING BTREE,
  KEY `Index_userid` (`userid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='捕鱼结算表';

-- Dumping data for table newstars.settlement_fish_t: ~0 rows (大约)
/*!40000 ALTER TABLE `settlement_fish_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `settlement_fish_t` ENABLE KEYS */;

-- Dumping structure for table newstars.settlement_ox100_t
CREATE TABLE IF NOT EXISTS `settlement_ox100_t` (
  `settleid` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `roundcode` varchar(45) DEFAULT NULL COMMENT '局号',
  `gametableid` int(11) DEFAULT NULL COMMENT '桌台号',
  `userid` int(11) DEFAULT NULL COMMENT '用户ID',
  `betamount` decimal(18,2) DEFAULT NULL COMMENT '下注金额',
  `actualamount` decimal(18,2) DEFAULT NULL COMMENT '实际金额',
  `odds` decimal(18,2) DEFAULT NULL COMMENT '倍率',
  `bettype` int(11) DEFAULT NULL COMMENT '下注类型',
  `payoffvalue` decimal(18,2) DEFAULT NULL COMMENT '结算值',
  `results` text COMMENT '开牌结果',
  `bettime` bigint(20) DEFAULT NULL COMMENT '下注时间',
  `settletime` bigint(20) DEFAULT NULL COMMENT '结算时间',
  `revenue` decimal(18,2) DEFAULT '0.00' COMMENT '税收',
  PRIMARY KEY (`settleid`),
  KEY `index2` (`roundcode`),
  KEY `index3` (`settletime`),
  KEY `Index_userid` (`userid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='百人牛牛结算表';

-- Dumping data for table newstars.settlement_ox100_t: ~0 rows (大约)
/*!40000 ALTER TABLE `settlement_ox100_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `settlement_ox100_t` ENABLE KEYS */;

-- Dumping structure for table newstars.settlement_ox5_t
CREATE TABLE IF NOT EXISTS `settlement_ox5_t` (
  `settleid` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `roundcode` varchar(45) DEFAULT NULL COMMENT '局号',
  `gametableid` int(11) DEFAULT NULL COMMENT '桌台号',
  `userid` int(11) DEFAULT NULL COMMENT '用户ID',
  `betamount` decimal(18,2) DEFAULT NULL COMMENT '下注金额',
  `actualamount` decimal(18,2) DEFAULT NULL COMMENT '实际金额',
  `odds` decimal(18,2) DEFAULT NULL COMMENT '倍率',
  `bettype` int(11) DEFAULT NULL COMMENT '下注类型',
  `payoffvalue` decimal(18,2) DEFAULT NULL COMMENT '结算值',
  `results` text COMMENT '开牌结果',
  `bettime` bigint(20) DEFAULT NULL COMMENT '下注时间',
  `settletime` bigint(20) DEFAULT NULL COMMENT '结算时间',
  `revenue` decimal(18,2) DEFAULT '0.00' COMMENT '税收',
  PRIMARY KEY (`settleid`),
  KEY `idx_settletime` (`settletime`),
  KEY `idx_code` (`roundcode`),
  KEY `Index_userid` (`userid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='抢庄牛牛结算表';

-- Dumping data for table newstars.settlement_ox5_t: ~0 rows (大约)
/*!40000 ALTER TABLE `settlement_ox5_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `settlement_ox5_t` ENABLE KEYS */;

-- Dumping structure for table newstars.settlement_redblack_t
CREATE TABLE IF NOT EXISTS `settlement_redblack_t` (
  `settleid` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `roundcode` varchar(45) DEFAULT NULL COMMENT '局号',
  `gametableid` int(11) DEFAULT NULL COMMENT '桌台号',
  `userid` int(11) DEFAULT NULL COMMENT '用户ID',
  `betamount` decimal(18,2) DEFAULT NULL COMMENT '下注金额',
  `actualamount` decimal(18,2) DEFAULT NULL COMMENT '实际金额',
  `odds` decimal(18,2) DEFAULT NULL COMMENT '倍率',
  `bettype` int(11) DEFAULT NULL COMMENT '下注类型',
  `payoffvalue` decimal(18,2) DEFAULT NULL COMMENT '结算值',
  `results` text COMMENT '开牌结果',
  `bettime` bigint(20) DEFAULT NULL COMMENT '下注时间',
  `settletime` bigint(20) DEFAULT NULL COMMENT '结算时间',
  `revenue` decimal(18,2) DEFAULT '0.00' COMMENT '税收',
  PRIMARY KEY (`settleid`),
  KEY `index2` (`roundcode`),
  KEY `index3` (`settletime`),
  KEY `Index_userid` (`userid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='红黑结算表';

-- Dumping data for table newstars.settlement_redblack_t: ~0 rows (大约)
/*!40000 ALTER TABLE `settlement_redblack_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `settlement_redblack_t` ENABLE KEYS */;

-- Dumping structure for table newstars.settlement_t
CREATE TABLE IF NOT EXISTS `settlement_t` (
  `settleid` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `roundcode` varchar(45) DEFAULT NULL COMMENT '局号',
  `gametableid` int(11) DEFAULT NULL COMMENT '桌台号',
  `userid` int(11) DEFAULT NULL COMMENT '用户ID',
  `betamount` decimal(18,3) DEFAULT NULL,
  `actualamount` decimal(18,3) DEFAULT NULL,
  `odds` decimal(18,2) DEFAULT NULL COMMENT '倍率',
  `bettype` int(11) DEFAULT NULL COMMENT '下注类型',
  `payoffvalue` decimal(18,3) DEFAULT NULL,
  `results` text COMMENT '出牌结果',
  `bettime` bigint(20) DEFAULT NULL COMMENT '下注时间',
  `settletime` bigint(20) DEFAULT NULL COMMENT '结算时间',
  `revenue` decimal(18,3) DEFAULT NULL,
  PRIMARY KEY (`settleid`),
  KEY `idx_settletime` (`settletime`),
  KEY `idx_code` (`roundcode`),
  KEY `Index_userid` (`userid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='斗地主结算表';

-- Dumping data for table newstars.settlement_t: ~0 rows (大约)
/*!40000 ALTER TABLE `settlement_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `settlement_t` ENABLE KEYS */;

-- Dumping structure for table newstars.settlement_threecard_t
CREATE TABLE IF NOT EXISTS `settlement_threecard_t` (
  `settleid` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `roundcode` varchar(45) DEFAULT NULL COMMENT '局号',
  `gametableid` int(11) DEFAULT NULL COMMENT '桌台号',
  `userid` int(11) DEFAULT NULL COMMENT '用户ID',
  `betamount` decimal(18,2) DEFAULT NULL COMMENT '下注金额',
  `actualamount` decimal(18,2) DEFAULT NULL COMMENT '实际金额',
  `odds` decimal(18,2) DEFAULT NULL COMMENT '倍率',
  `bettype` int(11) DEFAULT NULL COMMENT '下注类型',
  `payoffvalue` decimal(18,2) DEFAULT NULL COMMENT '结算值',
  `results` text COMMENT '开牌结果',
  `bettime` bigint(20) DEFAULT NULL COMMENT '下注时间',
  `settletime` bigint(20) DEFAULT NULL COMMENT '结算时间',
  `revenue` decimal(18,2) DEFAULT '0.00' COMMENT '税收',
  PRIMARY KEY (`settleid`),
  KEY `idx_settletime` (`settletime`),
  KEY `idx_code` (`roundcode`),
  KEY `Index_userid` (`userid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='炸金花结算表';

-- Dumping data for table newstars.settlement_threecard_t: ~0 rows (大约)
/*!40000 ALTER TABLE `settlement_threecard_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `settlement_threecard_t` ENABLE KEYS */;

-- Dumping structure for table newstars.slot_winner_t
CREATE TABLE IF NOT EXISTS `slot_winner_t` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `userid` int(11) NOT NULL,
  `gamekindid` int(5) NOT NULL,
  `gameroomid` int(5) NOT NULL,
  `award` decimal(18,6) NOT NULL,
  `time` int(11) DEFAULT NULL,
  `status` tinyint(1) DEFAULT '0' COMMENT '0：未发奖 1:已发奖',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

-- Dumping data for table newstars.slot_winner_t: ~0 rows (大约)
/*!40000 ALTER TABLE `slot_winner_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `slot_winner_t` ENABLE KEYS */;

-- Dumping structure for table newstars.stop_server_t
CREATE TABLE IF NOT EXISTS `stop_server_t` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `start_time` bigint(20) NOT NULL DEFAULT '0' COMMENT '开始时间',
  `end_time` bigint(20) NOT NULL DEFAULT '0' COMMENT '结束时间',
  `status` tinyint(4) NOT NULL DEFAULT '0' COMMENT '状态',
  `edit_time` bigint(20) NOT NULL DEFAULT '0' COMMENT '编辑时间',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin ROW_FORMAT=DYNAMIC COMMENT='停机维护配置';

-- Dumping data for table newstars.stop_server_t: ~0 rows (大约)
/*!40000 ALTER TABLE `stop_server_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `stop_server_t` ENABLE KEYS */;

-- Dumping structure for table newstars.stop_white_list_t
CREATE TABLE IF NOT EXISTS `stop_white_list_t` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `user_id` int(11) NOT NULL DEFAULT '0' COMMENT '用户id',
  `time` bigint(20) NOT NULL DEFAULT '0' COMMENT '添加时间',
  PRIMARY KEY (`id`),
  UNIQUE KEY `user_id` (`user_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='停机白名单';

-- Dumping data for table newstars.stop_white_list_t: ~0 rows (大约)
/*!40000 ALTER TABLE `stop_white_list_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `stop_white_list_t` ENABLE KEYS */;

-- Dumping structure for table newstars.sync_t
CREATE TABLE IF NOT EXISTS `sync_t` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `ts` bigint(20) DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `date_UNIQUE` (`ts`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

-- Dumping data for table newstars.sync_t: ~0 rows (大约)
/*!40000 ALTER TABLE `sync_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `sync_t` ENABLE KEYS */;

-- Dumping structure for table newstars.userbank_t
CREATE TABLE IF NOT EXISTS `userbank_t` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `userid` int(11) DEFAULT NULL COMMENT '用户ID',
  `bankamount` decimal(18,3) DEFAULT NULL COMMENT '保险箱金额',
  `currency` varchar(45) DEFAULT NULL COMMENT '货币',
  `password` varchar(45) DEFAULT NULL COMMENT '密码',
  PRIMARY KEY (`id`),
  UNIQUE KEY `userid_UNIQUE` (`userid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='保险箱';

-- Dumping data for table newstars.userbank_t: ~0 rows (大约)
/*!40000 ALTER TABLE `userbank_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `userbank_t` ENABLE KEYS */;

-- Dumping structure for table newstars.userextend_blacklist_t
CREATE TABLE IF NOT EXISTS `userextend_blacklist_t` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `userid` varchar(45) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL COMMENT '用户ID',
  `acctno` varchar(128) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL COMMENT '账号',
  `acctname` varchar(128) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL COMMENT '名称',
  `acctype` int(11) DEFAULT NULL COMMENT '账号类型 0:支付宝 1:银行卡',
  `createtime` bigint(20) DEFAULT NULL COMMENT '创建时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='支付宝银行卡黑名单';

-- Dumping data for table newstars.userextend_blacklist_t: ~0 rows (大约)
/*!40000 ALTER TABLE `userextend_blacklist_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `userextend_blacklist_t` ENABLE KEYS */;

-- Dumping structure for table newstars.userextend_t
CREATE TABLE IF NOT EXISTS `userextend_t` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `userid` int(11) DEFAULT NULL COMMENT '用户ID',
  `alipay` varchar(128) DEFAULT NULL COMMENT '支付宝名称',
  `alipaydetail` varchar(128) DEFAULT NULL COMMENT '支付宝账号',
  `bankaccount` varchar(128) DEFAULT NULL COMMENT '银行卡账号',
  `bankno` varchar(20) DEFAULT NULL COMMENT '银行卡号',
  `bankname` varchar(45) DEFAULT NULL COMMENT '银行名称',
  `bankdetail` varchar(128) DEFAULT NULL COMMENT '银行卡代码',
  `bindalipaytime` bigint(20) DEFAULT NULL COMMENT '支付宝绑定时间',
  `bindbanktime` bigint(20) DEFAULT NULL COMMENT '银行卡绑定',
  PRIMARY KEY (`id`),
  UNIQUE KEY `userid_UNIQUE` (`userid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='用户扩展信息';

-- Dumping data for table newstars.userextend_t: ~0 rows (大约)
/*!40000 ALTER TABLE `userextend_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `userextend_t` ENABLE KEYS */;

-- Dumping structure for table newstars.userwealth_t
CREATE TABLE IF NOT EXISTS `userwealth_t` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `userid` int(11) DEFAULT NULL COMMENT '玩家ID',
  `profit` decimal(18,3) DEFAULT '0.000' COMMENT '输赢',
  `wincounts` int(11) DEFAULT '0' COMMENT '胜局次数',
  `losecounts` int(11) DEFAULT '0' COMMENT '败局次数',
  `tiecounts` int(11) DEFAULT '0' COMMENT '和局次数',
  `fleecounts` int(11) DEFAULT '0' COMMENT '逃跑次数',
  `wealth` decimal(18,3) DEFAULT '0.000' COMMENT '钱包金额',
  PRIMARY KEY (`id`) USING BTREE,
  UNIQUE KEY `userid_UNIQUE` (`userid`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=1686 DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC COMMENT='钱包';

-- Dumping data for table newstars.userwealth_t: ~0 rows (大约)
/*!40000 ALTER TABLE `userwealth_t` DISABLE KEYS */;
INSERT INTO `userwealth_t` (`id`, `userid`, `profit`, `wincounts`, `losecounts`, `tiecounts`, `fleecounts`, `wealth`) VALUES
	(966, 4127, 0.456, 1, 0, 0, 0, 10.467),
	(967, 4128, -0.240, 0, 1, 0, 0, 12.644),
	(968, 4129, 0.000, 0, 0, 0, 0, 2285.400),
	(969, 4130, 0.000, 0, 0, 0, 0, 736.300),
	(970, 4131, 0.000, 0, 0, 0, 0, 1730.900),
	(971, 4132, 0.000, 0, 0, 0, 0, 1560.450),
	(972, 4133, 0.000, 0, 0, 0, 0, 46.560),
	(973, 4134, 0.000, 0, 0, 0, 0, 4081.950),
	(974, 4135, 0.000, 0, 0, 0, 0, 3754.000),
	(975, 4136, 0.000, 0, 0, 0, 0, 5112.850),
	(976, 4137, 0.000, 0, 0, 0, 0, 4987.450),
	(977, 4138, 0.000, 0, 0, 0, 0, 907.900),
	(978, 4139, 0.000, 0, 0, 0, 0, 1297.150),
	(979, 4140, 0.000, 0, 0, 0, 0, 2818.850),
	(980, 4141, 0.000, 0, 0, 0, 0, 3603.300),
	(981, 4142, 0.000, 0, 0, 0, 0, 78.750),
	(982, 4143, 0.000, 0, 0, 0, 0, 1330.950),
	(983, 4144, 0.000, 0, 0, 0, 0, 2164.450),
	(984, 4145, 0.000, 0, 0, 0, 0, 1692.950),
	(985, 4146, 0.000, 0, 0, 0, 0, 3665.150),
	(986, 4147, 0.000, 0, 0, 0, 0, 868.950),
	(987, 4148, 0.000, 0, 0, 0, 0, 2876.500),
	(988, 4149, 0.000, 0, 0, 0, 0, 525.500),
	(989, 4150, 0.000, 0, 0, 0, 0, 2938.100),
	(990, 4151, 0.000, 0, 0, 0, 0, 2349.250),
	(991, 4152, 0.000, 0, 0, 0, 0, 4083.800),
	(992, 4153, 0.000, 0, 0, 0, 0, 1650.450),
	(993, 4154, 0.000, 0, 0, 0, 0, 2318.050),
	(994, 4155, 0.000, 0, 0, 0, 0, 4216.950),
	(995, 4156, 0.000, 0, 0, 0, 0, 2794.750),
	(996, 4157, 0.000, 0, 0, 0, 0, 1988.300),
	(997, 4158, 0.000, 0, 0, 0, 0, 2089.150),
	(998, 4159, 0.000, 0, 0, 0, 0, 1520.300),
	(999, 4160, 0.000, 0, 0, 0, 0, 3355.000),
	(1000, 4161, 0.000, 0, 0, 0, 0, 2118.550),
	(1001, 4162, 0.000, 0, 0, 0, 0, 2991.350),
	(1002, 4163, 0.000, 0, 0, 0, 0, 1572.300),
	(1003, 4164, 0.000, 0, 0, 0, 0, 2400.500),
	(1004, 4165, 0.000, 0, 0, 0, 0, 1706.250),
	(1005, 4166, 0.000, 0, 0, 0, 0, 4778.400),
	(1006, 4167, 0.000, 0, 0, 0, 0, 511.750),
	(1007, 4168, 0.000, 0, 0, 0, 0, 1239.150),
	(1008, 4169, 0.000, 0, 0, 0, 0, 1744.100),
	(1009, 4170, 0.000, 0, 0, 0, 0, 3970.150),
	(1010, 4171, 0.000, 0, 0, 0, 0, 1427.900),
	(1011, 4172, 0.000, 0, 0, 0, 0, 4868.100),
	(1012, 4173, 0.000, 0, 0, 0, 0, 9314.350),
	(1013, 4174, 0.000, 0, 0, 0, 0, 3198.250),
	(1014, 4175, 0.000, 0, 0, 0, 0, 1628.300),
	(1015, 4176, 0.000, 0, 0, 0, 0, 1400.350),
	(1016, 4177, 0.000, 0, 0, 0, 0, 3218.200),
	(1017, 4178, 0.000, 0, 0, 0, 0, 9472.850),
	(1018, 4179, 0.000, 0, 0, 0, 0, 462.480),
	(1019, 4180, 0.000, 0, 0, 0, 0, 2137.850),
	(1020, 4181, 0.000, 0, 0, 0, 0, 70.560),
	(1021, 4182, 0.000, 0, 0, 0, 0, 4062.430),
	(1022, 4183, 0.000, 0, 0, 0, 0, 4171.750),
	(1023, 4184, 0.000, 0, 0, 0, 0, 2000.490),
	(1024, 4185, 0.000, 0, 0, 0, 0, 1425.840),
	(1025, 4186, 0.000, 0, 0, 0, 0, 2135.450),
	(1026, 4187, 0.000, 0, 0, 0, 0, 40.530),
	(1027, 4188, 0.000, 0, 0, 0, 0, 841.600),
	(1028, 4189, 0.000, 0, 0, 0, 0, 4468.750),
	(1029, 4190, 0.000, 0, 0, 0, 0, 5333.750),
	(1030, 4191, 0.000, 0, 0, 0, 0, 1905.600),
	(1031, 4192, 0.000, 0, 0, 0, 0, 948.450),
	(1032, 4193, 0.000, 0, 0, 0, 0, 857.400),
	(1033, 4194, 0.000, 0, 0, 0, 0, 1382.400),
	(1034, 4195, 0.000, 0, 0, 0, 0, 1927.150),
	(1035, 4196, 0.000, 0, 0, 0, 0, 3685.650),
	(1036, 4197, 0.000, 0, 0, 0, 0, 4936.850),
	(1037, 4198, 0.000, 0, 0, 0, 0, 3406.100),
	(1038, 4199, 0.000, 0, 0, 0, 0, 5068.500),
	(1039, 4200, 0.000, 0, 0, 0, 0, 5445.300),
	(1040, 4201, 0.000, 0, 0, 0, 0, 5416.250),
	(1041, 4202, 0.000, 0, 0, 0, 0, 3116.900),
	(1042, 4203, 0.000, 0, 0, 0, 0, 1640.400),
	(1043, 4204, 0.000, 0, 0, 0, 0, 2637.650),
	(1044, 4205, 0.000, 0, 0, 0, 0, 3083.100),
	(1045, 4206, 0.000, 0, 0, 0, 0, 4044.250),
	(1046, 4207, 0.000, 0, 0, 0, 0, 2927.500),
	(1047, 4208, 0.000, 0, 0, 0, 0, 3191.000),
	(1048, 4209, 0.000, 0, 0, 0, 0, 4501.900),
	(1049, 4210, 0.000, 0, 0, 0, 0, 1365.100),
	(1050, 4211, 0.000, 0, 0, 0, 0, 74.850),
	(1051, 4212, 0.000, 0, 0, 0, 0, 5226.450),
	(1052, 4213, 0.000, 0, 0, 0, 0, 51.820),
	(1053, 4214, 0.000, 0, 0, 0, 0, 4945.850),
	(1054, 4215, 0.000, 0, 0, 0, 0, 96.700),
	(1055, 4216, 0.000, 0, 0, 0, 0, 2389.450),
	(1056, 4217, 0.000, 0, 0, 0, 0, 5453.700),
	(1057, 4218, 0.000, 0, 0, 0, 0, 3497.250),
	(1058, 4219, 0.000, 0, 0, 0, 0, 10.000),
	(1059, 4220, 0.000, 0, 0, 0, 0, 44.900),
	(1060, 4221, 0.000, 0, 0, 0, 0, 1549.150),
	(1061, 4222, 0.000, 0, 0, 0, 0, 2227.150),
	(1062, 4223, 0.000, 0, 0, 0, 0, 5224.300),
	(1063, 4224, 0.000, 0, 0, 0, 0, 4664.150),
	(1064, 4225, 0.000, 0, 0, 0, 0, 5191.200),
	(1065, 4226, 0.000, 0, 0, 0, 0, 2062.650),
	(1066, 4227, 0.000, 0, 0, 0, 0, 2160.800),
	(1067, 4228, 0.000, 0, 0, 0, 0, 3364.900),
	(1068, 4229, 0.000, 0, 0, 0, 0, 13.390),
	(1069, 4230, 0.000, 0, 0, 0, 0, 3277.000),
	(1070, 4231, 0.000, 0, 0, 0, 0, 1217.370),
	(1071, 4232, 0.000, 0, 0, 0, 0, 1606.070),
	(1072, 4233, 0.000, 0, 0, 0, 0, 2069.250),
	(1073, 4234, 0.000, 0, 0, 0, 0, 5048.650),
	(1074, 4235, 0.000, 0, 0, 0, 0, 2224.050),
	(1075, 4236, 0.000, 0, 0, 0, 0, 82.500),
	(1076, 4237, 0.000, 0, 0, 0, 0, 7218.150),
	(1077, 4238, 0.000, 0, 0, 0, 0, 3974.700),
	(1078, 4239, 0.000, 0, 0, 0, 0, 1041.950),
	(1079, 4240, 0.000, 0, 0, 0, 0, 3950.400),
	(1080, 4241, 0.000, 0, 0, 0, 0, 16.400),
	(1081, 4242, 0.000, 0, 0, 0, 0, 3229.000),
	(1082, 4243, 0.000, 0, 0, 0, 0, 5385.550),
	(1083, 4244, 0.000, 0, 0, 0, 0, 98.150),
	(1084, 4245, 0.000, 0, 0, 0, 0, 16.400),
	(1085, 4246, 0.000, 0, 0, 0, 0, 7783.550),
	(1086, 4247, 0.000, 0, 0, 0, 0, 4791.250),
	(1087, 4248, 0.000, 0, 0, 0, 0, 2036.450),
	(1088, 4249, 0.000, 0, 0, 0, 0, 85.500),
	(1089, 4250, 0.000, 0, 0, 0, 0, 4508.850),
	(1090, 4251, 0.000, 0, 0, 0, 0, 27.700),
	(1091, 4252, 0.000, 0, 0, 0, 0, 72.600),
	(1092, 4253, 0.000, 0, 0, 0, 0, 98.100),
	(1093, 4254, 0.000, 0, 0, 0, 0, 2046.950),
	(1094, 4255, 0.000, 0, 0, 0, 0, 4477.450),
	(1095, 4256, 0.000, 0, 0, 0, 0, 2605.950),
	(1096, 4257, 0.000, 0, 0, 0, 0, 6408.350),
	(1097, 4258, 0.000, 0, 0, 0, 0, 72.550),
	(1098, 4259, 0.000, 0, 0, 0, 0, 9678.300),
	(1099, 4260, 0.000, 0, 0, 0, 0, 4107.000),
	(1100, 4261, 0.000, 0, 0, 0, 0, 46.600),
	(1101, 4262, 0.000, 0, 0, 0, 0, 51.650),
	(1102, 4263, 0.000, 0, 0, 0, 0, 4877.050),
	(1103, 4264, 0.000, 0, 0, 0, 0, 80.700),
	(1104, 4265, 0.000, 0, 0, 0, 0, 2945.800),
	(1105, 4266, 0.000, 0, 0, 0, 0, 3341.950),
	(1106, 4267, 0.000, 0, 0, 0, 0, 96.000),
	(1107, 4268, 0.000, 0, 0, 0, 0, 2819.900),
	(1108, 4269, 0.000, 0, 0, 0, 0, 48.080),
	(1109, 4270, 0.000, 0, 0, 0, 0, 5706.400),
	(1110, 4271, 0.000, 0, 0, 0, 0, 4213.100),
	(1111, 4272, 0.000, 0, 0, 0, 0, 3673.500),
	(1112, 4273, 0.000, 0, 0, 0, 0, 79.200),
	(1113, 4274, 0.000, 0, 0, 0, 0, 86.750),
	(1114, 4275, 0.000, 0, 0, 0, 0, 87.150),
	(1115, 4276, 0.000, 0, 0, 0, 0, 93.150),
	(1116, 4277, 0.000, 0, 0, 0, 0, 3023.950),
	(1117, 4278, 0.000, 0, 0, 0, 0, 4820.600),
	(1118, 4279, 0.000, 0, 0, 0, 0, 2762.100),
	(1119, 4280, 0.000, 0, 0, 0, 0, 3676.800),
	(1120, 4281, 0.000, 0, 0, 0, 0, 5347.800),
	(1121, 4282, 0.000, 0, 0, 0, 0, 94.950),
	(1122, 4283, 0.000, 0, 0, 0, 0, 91.600),
	(1123, 4284, 0.000, 0, 0, 0, 0, 4655.450),
	(1124, 4285, 0.000, 0, 0, 0, 0, 5893.550),
	(1125, 4286, 0.000, 0, 0, 0, 0, 5271.300),
	(1126, 4287, 0.000, 0, 0, 0, 0, -1774.300),
	(1127, 4288, 0.000, 0, 0, 0, 0, 2050.850),
	(1128, 4289, 0.000, 0, 0, 0, 0, 6692.850),
	(1129, 4290, 0.000, 0, 0, 0, 0, 3828.250),
	(1130, 4291, 0.000, 0, 0, 0, 0, 7880.750),
	(1131, 4292, 0.000, 0, 0, 0, 0, 5984.150),
	(1132, 4293, 0.000, 0, 0, 0, 0, 3556.350),
	(1133, 4294, 0.000, 0, 0, 0, 0, 4904.000),
	(1134, 4295, 0.000, 0, 0, 0, 0, 4264.800),
	(1135, 4296, 0.000, 0, 0, 0, 0, 3022.950),
	(1136, 4297, 0.000, 0, 0, 0, 0, 7466.200),
	(1137, 4298, 0.000, 0, 0, 0, 0, 4520.900),
	(1138, 4299, 0.000, 0, 0, 0, 0, 3488.400),
	(1139, 4300, 0.000, 0, 0, 0, 0, 971.750),
	(1140, 4301, 0.000, 0, 0, 0, 0, 3040.800),
	(1141, 4302, 0.000, 0, 0, 0, 0, 7453.250),
	(1142, 4303, 0.000, 0, 0, 0, 0, 3533.600),
	(1143, 4304, 0.000, 0, 0, 0, 0, 3790.900),
	(1144, 4305, 0.000, 0, 0, 0, 0, 4938.100),
	(1145, 4306, 0.000, 0, 0, 0, 0, 5321.000),
	(1146, 4307, 0.000, 0, 0, 0, 0, 4009.550),
	(1147, 4308, 0.000, 0, 0, 0, 0, 1114.350),
	(1148, 4309, 0.000, 0, 0, 0, 0, 2288.500),
	(1149, 4310, 0.000, 0, 0, 0, 0, 1139.500),
	(1150, 4311, 0.000, 0, 0, 0, 0, 4418.200),
	(1151, 4312, 0.000, 0, 0, 0, 0, 5177.650),
	(1152, 4313, 0.000, 0, 0, 0, 0, 3683.300),
	(1153, 4314, 0.000, 0, 0, 0, 0, 3986.450),
	(1154, 4315, 0.000, 0, 0, 0, 0, 4510.050),
	(1155, 4316, 0.000, 0, 0, 0, 0, 4011.000),
	(1156, 4317, 0.000, 0, 0, 0, 0, 5164.600),
	(1157, 4318, 0.000, 0, 0, 0, 0, 2631.400),
	(1158, 4319, 0.000, 0, 0, 0, 0, 2774.450),
	(1159, 4320, 0.000, 0, 0, 0, 0, 2693.800),
	(1160, 4321, 0.000, 0, 0, 0, 0, 2204.100),
	(1161, 4322, 0.000, 0, 0, 0, 0, 5943.200),
	(1162, 4323, 0.000, 0, 0, 0, 0, 2748.150),
	(1163, 4324, 0.000, 0, 0, 0, 0, 3130.700),
	(1164, 4325, 0.000, 0, 0, 0, 0, 2662.750),
	(1165, 4326, 0.000, 0, 0, 0, 0, 4739.850),
	(1166, 4327, 0.000, 0, 0, 0, 0, 1623.900),
	(1167, 4328, 0.000, 0, 0, 0, 0, 2210.100),
	(1168, 4329, 0.000, 0, 0, 0, 0, 3120.100),
	(1169, 4330, 0.000, 0, 0, 0, 0, 4452.850),
	(1170, 4331, 0.000, 0, 0, 0, 0, 5401.700),
	(1171, 4332, 0.000, 0, 0, 0, 0, 3221.300),
	(1172, 4333, 0.000, 0, 0, 0, 0, 1236.500),
	(1173, 4334, 0.000, 0, 0, 0, 0, 2512.750),
	(1174, 4335, 0.000, 0, 0, 0, 0, 1495.650),
	(1175, 4336, 0.000, 0, 0, 0, 0, 1258.600),
	(1176, 4337, 0.000, 0, 0, 0, 0, 4862.250),
	(1177, 4338, 0.000, 0, 0, 0, 0, 5774.650),
	(1178, 4339, 0.000, 0, 0, 0, 0, 1913.500),
	(1179, 4340, 0.000, 0, 0, 0, 0, 4098.000),
	(1180, 4341, 0.000, 0, 0, 0, 0, 2471.700),
	(1181, 4342, 0.000, 0, 0, 0, 0, 1607.850),
	(1182, 4343, 0.000, 0, 0, 0, 0, 4789.300),
	(1183, 4344, 0.000, 0, 0, 0, 0, 4556.950),
	(1184, 4345, 0.000, 0, 0, 0, 0, 1510.200),
	(1185, 4346, 0.000, 0, 0, 0, 0, 4020.000),
	(1186, 4347, 0.000, 0, 0, 0, 0, 2588.850),
	(1187, 4348, 0.000, 0, 0, 0, 0, 2036.500),
	(1188, 4349, 0.000, 0, 0, 0, 0, 3679.700),
	(1189, 4350, 0.000, 0, 0, 0, 0, 3478.850),
	(1190, 4351, 0.000, 0, 0, 0, 0, 3365.100),
	(1191, 4352, 0.000, 0, 0, 0, 0, 4097.000),
	(1192, 4353, 0.000, 0, 0, 0, 0, 5142.300),
	(1193, 4354, 0.000, 0, 0, 0, 0, 1215.300),
	(1194, 4355, 0.000, 0, 0, 0, 0, 2253.900),
	(1195, 4356, 0.000, 0, 0, 0, 0, 3475.950),
	(1196, 4357, 0.000, 0, 0, 0, 0, 3617.000),
	(1197, 4358, 0.000, 0, 0, 0, 0, 2849.800),
	(1198, 4359, 0.000, 0, 0, 0, 0, 5057.450),
	(1199, 4360, 0.000, 0, 0, 0, 0, 2513.050),
	(1200, 4361, 0.000, 0, 0, 0, 0, 528.050),
	(1201, 4362, 0.000, 0, 0, 0, 0, 2028.700),
	(1202, 4363, 0.000, 0, 0, 0, 0, 5529.750),
	(1203, 4364, 0.000, 0, 0, 0, 0, 4736.450),
	(1204, 4365, 0.000, 0, 0, 0, 0, 729.450),
	(1205, 4366, 0.000, 0, 0, 0, 0, 518.700),
	(1206, 4367, 0.000, 0, 0, 0, 0, 2173.200),
	(1207, 4368, 0.000, 0, 0, 0, 0, 2556.250),
	(1208, 4369, 0.000, 0, 0, 0, 0, 2915.300),
	(1209, 4370, 0.000, 0, 0, 0, 0, 2936.400),
	(1210, 4371, 0.000, 0, 0, 0, 0, 1601.850),
	(1211, 4372, 0.000, 0, 0, 0, 0, 2498.500),
	(1212, 4373, 0.000, 0, 0, 0, 0, 4112.450),
	(1213, 4374, 0.000, 0, 0, 0, 0, 5388.500),
	(1214, 4375, 0.000, 0, 0, 0, 0, 5276.950),
	(1215, 4376, 0.000, 0, 0, 0, 0, 6101.500),
	(1216, 4377, 0.000, 0, 0, 0, 0, 1252.050),
	(1217, 4378, 0.000, 0, 0, 0, 0, 255.000),
	(1218, 4379, 0.000, 0, 0, 0, 0, 2625.800),
	(1219, 4380, 0.000, 0, 0, 0, 0, 4125.900),
	(1220, 4381, 0.000, 0, 0, 0, 0, 1545.000),
	(1221, 4382, 0.000, 0, 0, 0, 0, 1779.650),
	(1222, 4383, 0.000, 0, 0, 0, 0, 4694.250),
	(1223, 4384, 0.000, 0, 0, 0, 0, 5146.350),
	(1224, 4385, 0.000, 0, 0, 0, 0, 4837.250),
	(1225, 4386, 0.000, 0, 0, 0, 0, 722.050),
	(1226, 4387, 0.000, 0, 0, 0, 0, 4610.750),
	(1227, 4388, 0.000, 0, 0, 0, 0, 5234.000),
	(1228, 4389, 0.000, 0, 0, 0, 0, 3561.000),
	(1229, 4390, 0.000, 0, 0, 0, 0, 4615.000),
	(1230, 4391, 0.000, 0, 0, 0, 0, 2597.000),
	(1231, 4392, 0.000, 0, 0, 0, 0, 5342.000),
	(1232, 4393, 0.000, 0, 0, 0, 0, 4342.000),
	(1233, 4394, 0.000, 0, 0, 0, 0, 3503.000),
	(1234, 4395, 0.000, 0, 0, 0, 0, 4366.000),
	(1235, 4396, 0.000, 0, 0, 0, 0, 2761.000),
	(1236, 4397, 0.000, 0, 0, 0, 0, 3043.000),
	(1237, 4398, 0.000, 0, 0, 0, 0, 3652.000),
	(1238, 4399, 0.000, 0, 0, 0, 0, 1553.000),
	(1239, 4400, 0.000, 0, 0, 0, 0, 4798.000),
	(1240, 4401, -120.200, 106, 344, 0, 0, 80.123),
	(1241, 4402, -258.350, 90, 360, 0, 0, 215.890),
	(1242, 4403, 403.100, 173, 280, 0, 0, 22.802),
	(1243, 4404, -241.100, 83, 369, 0, 0, 194.192),
	(1244, 4405, -62.900, 111, 339, 0, 0, 129.813),
	(1245, 4406, -188.550, 100, 351, 0, 0, 21.869),
	(1246, 4407, 86.050, 123, 325, 0, 0, 52.362),
	(1247, 4408, -27.450, 119, 329, 0, 0, 219.457),
	(1248, 4409, 7.250, 117, 310, 0, 0, 134.611),
	(1249, 4410, -13.900, 112, 317, 0, 0, 176.264),
	(1250, 4411, 279.450, 145, 280, 0, 0, 51.126),
	(1251, 4412, -319.250, 71, 358, 0, 0, 91.961),
	(1252, 4413, 0.000, 0, 0, 0, 0, 4572.000),
	(1253, 4414, 0.000, 0, 0, 0, 0, 2135.000),
	(1254, 4415, 0.000, 0, 0, 0, 0, 3046.000),
	(1255, 4416, 0.000, 0, 0, 0, 0, 4580.000),
	(1256, 4417, 0.000, 0, 0, 0, 0, 3123.000),
	(1257, 4418, 0.000, 0, 0, 0, 0, 3795.000),
	(1258, 4419, 0.000, 0, 0, 0, 0, 2530.000),
	(1259, 4420, 0.000, 0, 0, 0, 0, 1309.000),
	(1260, 4421, 0.000, 0, 0, 0, 0, 628.000),
	(1261, 4422, 0.000, 0, 0, 0, 0, 663.000),
	(1262, 4423, 0.000, 0, 0, 0, 0, 1029.000),
	(1263, 4424, 0.000, 0, 0, 0, 0, 2911.000),
	(1264, 4425, 0.000, 0, 0, 0, 0, 3651.000),
	(1265, 4426, 0.000, 0, 0, 0, 0, 3398.000),
	(1266, 4427, 0.000, 0, 0, 0, 0, 2411.000),
	(1267, 4428, 0.000, 0, 0, 0, 0, 4244.000),
	(1268, 4429, 0.000, 0, 0, 0, 0, 3408.000),
	(1269, 4430, 0.000, 0, 0, 0, 0, 5318.000),
	(1270, 4431, 0.000, 0, 0, 0, 0, 2128.000),
	(1271, 4432, 0.000, 0, 0, 0, 0, 3248.000),
	(1272, 4433, 0.000, 0, 0, 0, 0, 2196.000),
	(1273, 4434, 0.000, 0, 0, 0, 0, 2616.000),
	(1274, 4435, 0.000, 0, 0, 0, 0, 4718.000),
	(1275, 4436, 0.000, 0, 0, 0, 0, 1273.000),
	(1276, 4437, 0.000, 0, 0, 0, 0, 3885.000),
	(1277, 4438, 0.000, 0, 0, 0, 0, 4047.000),
	(1278, 4439, 0.000, 0, 0, 0, 0, 5026.000),
	(1279, 4440, 0.000, 0, 0, 0, 0, 4102.000),
	(1280, 4441, 0.000, 0, 0, 0, 0, 4473.000),
	(1281, 4442, 0.000, 0, 0, 0, 0, 3980.000),
	(1282, 4443, 0.000, 0, 0, 0, 0, 1184.000),
	(1283, 4444, 0.000, 0, 0, 0, 0, 4843.000),
	(1284, 4445, 0.000, 0, 0, 0, 0, 2590.000),
	(1285, 4446, 0.000, 0, 0, 0, 0, 5014.000),
	(1286, 4447, 0.000, 0, 0, 0, 0, 676.000),
	(1287, 4448, 0.000, 0, 0, 0, 0, 1529.000),
	(1288, 4449, 0.000, 0, 0, 0, 0, 1924.000),
	(1289, 4450, 0.000, 0, 0, 0, 0, 607.000),
	(1290, 4451, 0.000, 0, 0, 0, 0, 3429.000),
	(1291, 4452, 0.000, 0, 0, 0, 0, 2215.000),
	(1292, 4453, 0.000, 0, 0, 0, 0, 3750.000),
	(1293, 4454, 0.000, 0, 0, 0, 0, 5109.000),
	(1294, 4455, 0.000, 0, 0, 0, 0, 1728.000),
	(1295, 4456, 0.000, 0, 0, 0, 0, 1616.000),
	(1296, 4457, 0.000, 0, 0, 0, 0, 697.000),
	(1297, 4458, 0.000, 0, 0, 0, 0, 1673.000),
	(1298, 4459, 0.000, 0, 0, 0, 0, 3767.000),
	(1299, 4460, 0.000, 0, 0, 0, 0, 4366.000),
	(1300, 4461, 0.000, 0, 0, 0, 0, 4019.000),
	(1301, 4462, 0.000, 0, 0, 0, 0, 3394.000),
	(1302, 4463, 0.000, 0, 0, 0, 0, 3717.000),
	(1303, 4464, 0.000, 0, 0, 0, 0, 3356.000),
	(1304, 4465, 0.000, 0, 0, 0, 0, 1732.000),
	(1305, 4466, 0.000, 0, 0, 0, 0, 2320.000),
	(1306, 4467, 0.000, 0, 0, 0, 0, 4544.000),
	(1307, 4468, 0.000, 0, 0, 0, 0, 3988.000),
	(1308, 4469, 0.000, 0, 0, 0, 0, 4146.000),
	(1309, 4470, 0.000, 0, 0, 0, 0, 3523.000),
	(1310, 4471, 0.000, 0, 0, 0, 0, 3638.000),
	(1311, 4472, 0.000, 0, 0, 0, 0, 1252.000),
	(1312, 4473, 0.000, 0, 0, 0, 0, 5327.000),
	(1313, 4474, 0.000, 0, 0, 0, 0, 3636.000),
	(1314, 4475, 0.000, 0, 0, 0, 0, 2929.000),
	(1315, 4476, 0.000, 0, 0, 0, 0, 916.000),
	(1316, 4477, 0.000, 0, 0, 0, 0, 3234.000),
	(1317, 4478, 0.000, 0, 0, 0, 0, 3869.000),
	(1318, 4479, 0.000, 0, 0, 0, 0, 1403.000),
	(1319, 4480, 0.000, 0, 0, 0, 0, 5107.000),
	(1320, 4481, 0.000, 0, 0, 0, 0, 3498.000),
	(1321, 4482, 0.000, 0, 0, 0, 0, 1885.000),
	(1322, 4483, 0.000, 0, 0, 0, 0, 857.000),
	(1323, 4484, 0.000, 0, 0, 0, 0, 1892.000),
	(1324, 4485, 0.000, 0, 0, 0, 0, 2284.000),
	(1325, 4486, 0.000, 0, 0, 0, 0, 504.000),
	(1326, 4487, 0.000, 0, 0, 0, 0, 1502.000),
	(1327, 4488, 0.000, 0, 0, 0, 0, 3264.000),
	(1328, 4489, 0.000, 0, 0, 0, 0, 807.000),
	(1329, 4490, 0.000, 0, 0, 0, 0, 3334.000),
	(1330, 4491, 0.000, 0, 0, 0, 0, 3659.000),
	(1331, 4492, 0.000, 0, 0, 0, 0, 4814.000),
	(1332, 4493, 0.000, 0, 0, 0, 0, 4455.000),
	(1333, 4494, 0.000, 0, 0, 0, 0, 5102.000),
	(1334, 4495, 0.000, 0, 0, 0, 0, 1388.000),
	(1335, 4496, 0.000, 0, 0, 0, 0, 5289.000),
	(1336, 4497, 0.000, 0, 0, 0, 0, 3886.000),
	(1337, 4498, 0.000, 0, 0, 0, 0, 1858.000),
	(1338, 4499, 0.000, 0, 0, 0, 0, 1020.000),
	(1339, 4500, 0.000, 0, 0, 0, 0, 3847.000),
	(1340, 4501, 0.000, 0, 0, 0, 0, 2825.000),
	(1341, 4502, 0.000, 0, 0, 0, 0, 1342.000),
	(1342, 4503, 0.000, 0, 0, 0, 0, 1628.000),
	(1343, 4504, 0.000, 0, 0, 0, 0, 4908.000),
	(1344, 4505, 0.000, 0, 0, 0, 0, 1887.000),
	(1345, 4506, 0.000, 0, 0, 0, 0, 5361.000),
	(1346, 4507, 0.000, 0, 0, 0, 0, 3368.000),
	(1347, 4508, 0.000, 0, 0, 0, 0, 1043.000),
	(1348, 4509, 0.000, 0, 0, 0, 0, 1200.000),
	(1349, 4510, 0.000, 0, 0, 0, 0, 2114.000),
	(1350, 4511, 0.000, 0, 0, 0, 0, 4605.000),
	(1351, 4512, 0.000, 0, 0, 0, 0, 3207.000),
	(1352, 4513, 0.000, 0, 0, 0, 0, 2561.000),
	(1353, 4514, 0.000, 0, 0, 0, 0, 4402.000),
	(1354, 4515, 0.000, 0, 0, 0, 0, 3194.000),
	(1355, 4516, 0.000, 0, 0, 0, 0, 4963.000),
	(1356, 4517, 0.000, 0, 0, 0, 0, 4183.000),
	(1357, 4518, 0.000, 0, 0, 0, 0, 3936.000),
	(1358, 4519, 0.000, 0, 0, 0, 0, 4193.000),
	(1359, 4520, 0.000, 0, 0, 0, 0, 2034.000),
	(1360, 4521, 0.000, 0, 0, 0, 0, 5476.000),
	(1361, 4522, 0.000, 0, 0, 0, 0, 771.000),
	(1362, 4523, 0.000, 0, 0, 0, 0, 5452.000),
	(1363, 4524, 0.000, 0, 0, 0, 0, 3012.000),
	(1364, 4525, 0.000, 0, 0, 0, 0, 3534.000),
	(1365, 4526, 0.000, 0, 0, 0, 0, 2312.000),
	(1366, 4527, 0.000, 0, 0, 0, 0, 3102.000),
	(1367, 4528, 0.000, 0, 0, 0, 0, 4271.000),
	(1368, 4529, 0.000, 0, 0, 0, 0, 1415.000),
	(1369, 4530, 0.000, 0, 0, 0, 0, 2306.000),
	(1370, 4531, 0.000, 0, 0, 0, 0, 4084.000),
	(1371, 4532, 0.000, 0, 0, 0, 0, 956.000),
	(1372, 4533, 0.000, 0, 0, 0, 0, 1886.000),
	(1373, 4534, 0.000, 0, 0, 0, 0, 4994.000),
	(1374, 4535, 0.000, 0, 0, 0, 0, 1556.000),
	(1375, 4536, 0.000, 0, 0, 0, 0, 522.000),
	(1376, 4537, 0.000, 0, 0, 0, 0, 4031.000),
	(1377, 4538, 0.000, 0, 0, 0, 0, 945.000),
	(1378, 4539, 0.000, 0, 0, 0, 0, 2465.000),
	(1379, 4540, 0.000, 0, 0, 0, 0, 3005.000),
	(1380, 4541, 0.000, 0, 0, 0, 0, 4097.000),
	(1381, 4542, 0.000, 0, 0, 0, 0, 5148.000),
	(1382, 4543, 0.000, 0, 0, 0, 0, 1539.000),
	(1383, 4544, 0.000, 0, 0, 0, 0, 3644.000),
	(1384, 4545, 0.000, 0, 0, 0, 0, 3491.000),
	(1385, 4546, 0.000, 0, 0, 0, 0, 1979.000),
	(1386, 4547, 0.000, 0, 0, 0, 0, 811.000),
	(1387, 4548, 0.000, 0, 0, 0, 0, 3212.000),
	(1388, 4549, 0.000, 0, 0, 0, 0, 1260.000),
	(1389, 4550, 0.000, 0, 0, 0, 0, 3427.000),
	(1390, 4551, 0.000, 0, 0, 0, 0, 2234.000),
	(1391, 4552, 0.000, 0, 0, 0, 0, 4559.000),
	(1392, 4553, 0.000, 0, 0, 0, 0, 3500.000),
	(1393, 4554, 0.000, 0, 0, 0, 0, 1269.000),
	(1394, 4555, 0.000, 0, 0, 0, 0, 690.000),
	(1395, 4556, 0.000, 0, 0, 0, 0, 2785.000),
	(1396, 4557, 0.000, 0, 0, 0, 0, 664.000),
	(1397, 4558, 0.000, 0, 0, 0, 0, 2117.000),
	(1398, 4559, 0.000, 0, 0, 0, 0, 3439.000),
	(1399, 4560, 0.000, 0, 0, 0, 0, 3591.000),
	(1400, 4561, 0.000, 0, 0, 0, 0, 952.000),
	(1401, 4562, 0.000, 0, 0, 0, 0, 1690.000),
	(1402, 4563, 0.000, 0, 0, 0, 0, 5333.000),
	(1403, 4564, 0.000, 0, 0, 0, 0, 1639.000),
	(1404, 4565, 0.000, 0, 0, 0, 0, 4646.000),
	(1405, 4566, 0.000, 0, 0, 0, 0, 3248.000),
	(1406, 4567, 0.000, 0, 0, 0, 0, 4910.000),
	(1407, 4568, 0.000, 0, 0, 0, 0, 4190.000),
	(1408, 4569, 0.000, 0, 0, 0, 0, 5218.000),
	(1409, 4570, 0.000, 0, 0, 0, 0, 3887.000),
	(1410, 4571, 0.000, 0, 0, 0, 0, 1851.000),
	(1411, 4572, 0.000, 0, 0, 0, 0, 3612.000),
	(1412, 4573, 0.000, 0, 0, 0, 0, 1198.000),
	(1413, 4574, 0.000, 0, 0, 0, 0, 5306.000),
	(1414, 4575, 0.000, 0, 0, 0, 0, 1373.000),
	(1415, 4576, 0.000, 0, 0, 0, 0, 3597.000),
	(1416, 4577, 0.000, 0, 0, 0, 0, 798.000),
	(1417, 4578, 0.000, 0, 0, 0, 0, 722.000),
	(1418, 4579, 0.000, 0, 0, 0, 0, 2230.000),
	(1419, 4580, 0.000, 0, 0, 0, 0, 1625.000),
	(1420, 4581, 0.000, 0, 0, 0, 0, 933.000),
	(1421, 4582, 0.000, 0, 0, 0, 0, 4243.000),
	(1422, 4583, 0.000, 0, 0, 0, 0, 5195.000),
	(1423, 4584, 0.000, 0, 0, 0, 0, 3429.000),
	(1424, 4585, 0.000, 0, 0, 0, 0, 4524.000),
	(1425, 4586, 0.000, 0, 0, 0, 0, 3355.000),
	(1426, 4587, 0.000, 0, 0, 0, 0, 4387.000),
	(1427, 4588, 0.000, 0, 0, 0, 0, 981.000),
	(1428, 4589, 0.000, 0, 0, 0, 0, 3047.000),
	(1429, 4590, 0.000, 0, 0, 0, 0, 4359.000),
	(1430, 4591, 0.000, 0, 0, 0, 0, 3878.000),
	(1431, 4592, 0.000, 0, 0, 0, 0, 5214.000),
	(1432, 4593, 0.000, 0, 0, 0, 0, 2795.000),
	(1433, 4594, 0.000, 0, 0, 0, 0, 603.000),
	(1434, 4595, 0.000, 0, 0, 0, 0, 2109.000),
	(1435, 4596, 0.000, 0, 0, 0, 0, 3182.000),
	(1436, 4597, 0.000, 0, 0, 0, 0, 5072.000),
	(1437, 4598, 0.000, 0, 0, 0, 0, 4451.000),
	(1438, 4599, 0.000, 0, 0, 0, 0, 1267.000),
	(1439, 4600, 0.000, 0, 0, 0, 0, 1624.000),
	(1440, 4601, 0.000, 0, 0, 0, 0, 3737.000),
	(1441, 4602, 0.000, 0, 0, 0, 0, 5351.000),
	(1442, 4603, 0.000, 0, 0, 0, 0, 2164.000),
	(1443, 4604, 0.000, 0, 0, 0, 0, 2437.000),
	(1444, 4605, 0.000, 0, 0, 0, 0, 3398.000),
	(1445, 4606, 0.000, 0, 0, 0, 0, 2075.000),
	(1446, 4607, 0.000, 0, 0, 0, 0, 1337.000),
	(1447, 4608, 0.000, 0, 0, 0, 0, 935.000),
	(1448, 4609, 0.000, 0, 0, 0, 0, 5220.000),
	(1449, 4610, 0.000, 0, 0, 0, 0, 1143.000),
	(1450, 4611, 0.000, 0, 0, 0, 0, 2860.000),
	(1451, 4612, 0.000, 0, 0, 0, 0, 2257.000),
	(1452, 4613, 0.000, 0, 0, 0, 0, 4374.000),
	(1453, 4614, 0.000, 0, 0, 0, 0, 3502.000),
	(1454, 4615, 0.000, 0, 0, 0, 0, 864.000),
	(1455, 4616, 0.000, 0, 0, 0, 0, 5038.000),
	(1456, 4617, 0.000, 0, 0, 0, 0, 3795.000),
	(1457, 4618, 0.000, 0, 0, 0, 0, 4260.000),
	(1458, 4619, 0.000, 0, 0, 0, 0, 3956.000),
	(1459, 4620, 0.000, 0, 0, 0, 0, 1111.000),
	(1460, 4621, 0.000, 0, 0, 0, 0, 907.000),
	(1461, 4622, 0.000, 0, 0, 0, 0, 2236.000),
	(1462, 4623, 0.000, 0, 0, 0, 0, 3061.000),
	(1463, 4624, 0.000, 0, 0, 0, 0, 4378.000),
	(1464, 4625, 0.000, 0, 0, 0, 0, 3725.000),
	(1465, 4626, 0.000, 0, 0, 0, 0, 2545.000),
	(1466, 4627, 0.000, 0, 0, 0, 0, 4336.000),
	(1467, 4628, 0.000, 0, 0, 0, 0, 1525.000),
	(1468, 4629, 0.000, 0, 0, 0, 0, 5082.000),
	(1469, 4630, 0.000, 0, 0, 0, 0, 3869.000),
	(1470, 4631, 0.000, 0, 0, 0, 0, 2765.000),
	(1471, 4632, 0.000, 0, 0, 0, 0, 1944.000),
	(1472, 4633, 0.000, 0, 0, 0, 0, 969.000),
	(1473, 4634, 0.000, 0, 0, 0, 0, 4755.000),
	(1474, 4635, 0.000, 0, 0, 0, 0, 3313.000),
	(1475, 4636, 0.000, 0, 0, 0, 0, 3264.000),
	(1476, 4637, 0.000, 0, 0, 0, 0, 2886.000),
	(1477, 4638, 0.000, 0, 0, 0, 0, 2216.000),
	(1478, 4639, 0.000, 0, 0, 0, 0, 4697.000),
	(1479, 4640, 0.000, 0, 0, 0, 0, 1060.000),
	(1480, 4641, 0.000, 0, 0, 0, 0, 1571.000),
	(1481, 4642, 0.000, 0, 0, 0, 0, 4753.000),
	(1482, 4643, 0.000, 0, 0, 0, 0, 2496.000),
	(1483, 4644, 0.000, 0, 0, 0, 0, 2558.000),
	(1484, 4645, 0.000, 0, 0, 0, 0, 2040.000),
	(1485, 4646, 0.000, 0, 0, 0, 0, 1646.000),
	(1486, 4647, 0.000, 0, 0, 0, 0, 4555.000),
	(1487, 4648, 0.000, 0, 0, 0, 0, 4856.000),
	(1488, 4649, 0.000, 0, 0, 0, 0, 1853.000),
	(1489, 4650, 0.000, 0, 0, 0, 0, 3761.000),
	(1490, 4651, 0.000, 0, 0, 0, 0, 1341.000),
	(1491, 4652, 0.000, 0, 0, 0, 0, 4533.000),
	(1492, 4653, 0.000, 0, 0, 0, 0, 2891.000),
	(1493, 4654, 0.000, 0, 0, 0, 0, 4645.000),
	(1494, 4655, 0.000, 0, 0, 0, 0, 902.000),
	(1495, 4656, 0.000, 0, 0, 0, 0, 2158.000),
	(1496, 4657, 0.000, 0, 0, 0, 0, 4784.000),
	(1497, 4658, 0.000, 0, 0, 0, 0, 5253.000),
	(1498, 4659, 0.000, 0, 0, 0, 0, 2233.000),
	(1499, 4660, 0.000, 0, 0, 0, 0, 4753.000),
	(1500, 4661, 0.000, 0, 0, 0, 0, 2813.000),
	(1501, 4662, 0.000, 0, 0, 0, 0, 4192.000),
	(1502, 4663, 0.000, 0, 0, 0, 0, 1407.000),
	(1503, 4664, 0.000, 0, 0, 0, 0, 2873.000),
	(1504, 4665, 0.000, 0, 0, 0, 0, 536.000),
	(1505, 4666, 0.000, 0, 0, 0, 0, 632.000),
	(1506, 4667, 0.000, 0, 0, 0, 0, 5227.000),
	(1507, 4668, 0.000, 0, 0, 0, 0, 580.000),
	(1508, 4669, 0.000, 0, 0, 0, 0, 656.000),
	(1509, 4670, 0.000, 0, 0, 0, 0, 1627.000),
	(1510, 4671, 0.000, 0, 0, 0, 0, 4590.000),
	(1511, 4672, 0.000, 0, 0, 0, 0, 933.000),
	(1512, 4673, 0.000, 0, 0, 0, 0, 4615.000),
	(1513, 4674, 0.000, 0, 0, 0, 0, 3031.000),
	(1514, 4675, 0.000, 0, 0, 0, 0, 3424.000),
	(1515, 4676, 0.000, 0, 0, 0, 0, 2967.000),
	(1516, 4677, 0.000, 0, 0, 0, 0, 2382.000),
	(1517, 4678, 0.000, 0, 0, 0, 0, 4360.000),
	(1518, 4679, 0.000, 0, 0, 0, 0, 694.000),
	(1519, 4680, 0.000, 0, 0, 0, 0, 4379.000),
	(1520, 4681, 0.000, 0, 0, 0, 0, 778.000),
	(1521, 4682, 0.000, 0, 0, 0, 0, 5326.000),
	(1522, 4683, 0.000, 0, 0, 0, 0, 605.000),
	(1523, 4684, 0.000, 0, 0, 0, 0, 5140.000),
	(1524, 4685, 0.000, 0, 0, 0, 0, 4919.000),
	(1525, 4686, 0.000, 0, 0, 0, 0, 4774.000),
	(1526, 4687, 0.000, 0, 0, 0, 0, 1121.000),
	(1527, 4688, 0.000, 0, 0, 0, 0, 1732.000),
	(1528, 4689, 0.000, 0, 0, 0, 0, 1798.000),
	(1529, 4690, 0.000, 0, 0, 0, 0, 3537.000),
	(1530, 4691, 0.000, 0, 0, 0, 0, 2530.000),
	(1531, 4692, 0.000, 0, 0, 0, 0, 860.000),
	(1532, 4693, 0.000, 0, 0, 0, 0, 5359.000),
	(1533, 4694, 0.000, 0, 0, 0, 0, 4497.000),
	(1534, 4695, 0.000, 0, 0, 0, 0, 1336.000),
	(1535, 4696, 0.000, 0, 0, 0, 0, 5231.000),
	(1536, 4697, 0.000, 0, 0, 0, 0, 1139.000),
	(1537, 4698, 0.000, 0, 0, 0, 0, 1396.000),
	(1538, 4699, 0.000, 0, 0, 0, 0, 1778.000),
	(1539, 4700, 0.000, 0, 0, 0, 0, 2971.000),
	(1540, 4701, 0.000, 0, 0, 0, 0, 5443.000),
	(1541, 4702, 0.000, 0, 0, 0, 0, 2128.000),
	(1542, 4703, 0.000, 0, 0, 0, 0, 3375.000),
	(1543, 4704, 0.000, 0, 0, 0, 0, 4288.000),
	(1544, 4705, 0.000, 0, 0, 0, 0, 1773.000),
	(1545, 4706, 0.000, 0, 0, 0, 0, 1918.000),
	(1546, 4707, 0.000, 0, 0, 0, 0, 1042.000),
	(1547, 4708, 0.000, 0, 0, 0, 0, 3673.000),
	(1548, 4709, 0.000, 0, 0, 0, 0, 2462.000),
	(1549, 4710, 0.000, 0, 0, 0, 0, 2819.000),
	(1550, 4711, 0.000, 0, 0, 0, 0, 687.000),
	(1551, 4712, 0.000, 0, 0, 0, 0, 5006.000),
	(1552, 4713, 0.000, 0, 0, 0, 0, 5295.000),
	(1553, 4714, 0.000, 0, 0, 0, 0, 3168.000),
	(1554, 4715, 0.000, 0, 0, 0, 0, 5119.000),
	(1555, 4716, 0.000, 0, 0, 0, 0, 3972.000),
	(1556, 4717, 0.000, 0, 0, 0, 0, 1170.000),
	(1557, 4718, 0.000, 0, 0, 0, 0, 2654.000),
	(1558, 4719, 0.000, 0, 0, 0, 0, 2697.000),
	(1559, 4720, 0.000, 0, 0, 0, 0, 4077.000),
	(1560, 4721, 0.000, 0, 0, 0, 0, 4399.000),
	(1561, 4722, 0.000, 0, 0, 0, 0, 4646.000),
	(1562, 4723, 0.000, 0, 0, 0, 0, 823.000),
	(1563, 4724, 0.000, 0, 0, 0, 0, 3362.000),
	(1564, 4725, 0.000, 0, 0, 0, 0, 3046.000),
	(1565, 4726, 0.000, 0, 0, 0, 0, 3459.000),
	(1566, 4727, 0.000, 0, 0, 0, 0, 906.000),
	(1567, 4728, 0.000, 0, 0, 0, 0, 2550.000),
	(1568, 4729, 0.000, 0, 0, 0, 0, 3901.000),
	(1569, 4730, 0.000, 0, 0, 0, 0, 2476.000),
	(1570, 4731, 0.000, 0, 0, 0, 0, 5276.000),
	(1571, 4732, 0.000, 0, 0, 0, 0, 2193.000),
	(1572, 4733, 0.000, 0, 0, 0, 0, 4773.000),
	(1573, 4734, 0.000, 0, 0, 0, 0, 4638.000),
	(1574, 4735, 0.000, 0, 0, 0, 0, 1156.000),
	(1575, 4736, 0.000, 0, 0, 0, 0, 3664.000),
	(1576, 4737, 0.000, 0, 0, 0, 0, 1832.000),
	(1577, 4738, 0.000, 0, 0, 0, 0, 1086.000),
	(1578, 4739, 0.000, 0, 0, 0, 0, 4925.000),
	(1579, 4740, 0.000, 0, 0, 0, 0, 3479.000),
	(1580, 4741, 0.000, 0, 0, 0, 0, 5352.000),
	(1581, 4742, 0.000, 0, 0, 0, 0, 3000.000),
	(1582, 4743, 0.000, 0, 0, 0, 0, 1705.000),
	(1583, 4744, 0.000, 0, 0, 0, 0, 5133.000),
	(1584, 4745, 0.000, 0, 0, 0, 0, 3826.000),
	(1585, 4746, 0.000, 0, 0, 0, 0, 2408.000),
	(1586, 4747, 0.000, 0, 0, 0, 0, 5136.000),
	(1587, 4748, 0.000, 0, 0, 0, 0, 4664.000),
	(1588, 4749, 0.000, 0, 0, 0, 0, 4078.000),
	(1589, 4750, 0.000, 0, 0, 0, 0, 1095.000),
	(1590, 4751, 0.000, 0, 0, 0, 0, 903.000),
	(1591, 4752, 0.000, 0, 0, 0, 0, 5223.000),
	(1592, 4753, 0.000, 0, 0, 0, 0, 5216.000),
	(1593, 4754, 0.000, 0, 0, 0, 0, 2494.000),
	(1594, 4755, 0.000, 0, 0, 0, 0, 1282.000),
	(1595, 4756, 0.000, 0, 0, 0, 0, 526.000),
	(1596, 4757, 0.000, 0, 0, 0, 0, 1570.000),
	(1597, 4758, 0.000, 0, 0, 0, 0, 3538.000),
	(1598, 4759, 0.000, 0, 0, 0, 0, 4389.000),
	(1599, 4760, 0.000, 0, 0, 0, 0, 4012.000),
	(1600, 4761, 0.000, 0, 0, 0, 0, 2348.000),
	(1601, 4762, 0.000, 0, 0, 0, 0, 4330.000),
	(1602, 4763, 0.000, 0, 0, 0, 0, 1394.000),
	(1603, 4764, 0.000, 0, 0, 0, 0, 4880.000),
	(1604, 4765, 0.000, 0, 0, 0, 0, 706.000),
	(1605, 4766, 0.000, 0, 0, 0, 0, 2653.000),
	(1606, 4767, 0.000, 0, 0, 0, 0, 3304.000),
	(1607, 4768, 0.000, 0, 0, 0, 0, 1410.000),
	(1608, 4769, 0.000, 0, 0, 0, 0, 1204.000),
	(1609, 4770, 0.000, 0, 0, 0, 0, 1093.000),
	(1610, 4771, 0.000, 0, 0, 0, 0, 1114.000),
	(1611, 4772, 0.000, 0, 0, 0, 0, 2913.000),
	(1612, 4773, 0.000, 0, 0, 0, 0, 5059.000),
	(1613, 4774, 0.000, 0, 0, 0, 0, 4365.000),
	(1614, 4775, 0.000, 0, 0, 0, 0, 1711.000),
	(1615, 4776, 0.000, 0, 0, 0, 0, 1375.000),
	(1616, 4777, 0.000, 0, 0, 0, 0, 3942.000),
	(1617, 4778, 0.000, 0, 0, 0, 0, 4947.000),
	(1618, 4779, 0.000, 0, 0, 0, 0, 2921.000),
	(1619, 4780, 0.000, 0, 0, 0, 0, 1636.000),
	(1620, 4781, 0.000, 0, 0, 0, 0, 565.000),
	(1621, 4782, 0.000, 0, 0, 0, 0, 1212.000),
	(1622, 4783, 0.000, 0, 0, 0, 0, 794.000),
	(1623, 4784, 0.000, 0, 0, 0, 0, 3280.000),
	(1624, 4785, 0.000, 0, 0, 0, 0, 5288.000),
	(1625, 4786, 0.000, 0, 0, 0, 0, 3493.000),
	(1626, 4787, 0.000, 0, 0, 0, 0, 1008.000),
	(1627, 4788, 0.000, 0, 0, 0, 0, 5052.000),
	(1628, 4789, 0.000, 0, 0, 0, 0, 4529.000),
	(1629, 4790, 0.000, 0, 0, 0, 0, 1931.000),
	(1630, 4791, 0.000, 0, 0, 0, 0, 1916.000),
	(1631, 4792, 0.000, 0, 0, 0, 0, 2032.000),
	(1632, 4793, 0.000, 0, 0, 0, 0, 5449.000),
	(1633, 4794, 0.000, 0, 0, 0, 0, 3094.000),
	(1634, 4795, 0.000, 0, 0, 0, 0, 3663.000),
	(1635, 4796, 0.000, 0, 0, 0, 0, 1709.000),
	(1636, 4797, 0.000, 0, 0, 0, 0, 2094.000),
	(1637, 4798, 0.000, 0, 0, 0, 0, 3558.000),
	(1638, 4799, 0.000, 0, 0, 0, 0, 1803.000),
	(1639, 4800, 0.000, 0, 0, 0, 0, 1529.000),
	(1640, 4801, 0.000, 0, 0, 0, 0, 2892.000),
	(1641, 4802, 0.000, 0, 0, 0, 0, 1022.000),
	(1642, 4803, 0.000, 0, 0, 0, 0, 5209.000),
	(1643, 4804, 0.000, 0, 0, 0, 0, 3131.000),
	(1644, 4805, 0.000, 0, 0, 0, 0, 2108.000),
	(1645, 4806, 0.000, 0, 0, 0, 0, 3027.000),
	(1646, 4807, 0.000, 0, 0, 0, 0, 1922.000),
	(1647, 4808, 0.000, 0, 0, 0, 0, 2727.000),
	(1648, 4809, 0.000, 0, 0, 0, 0, 4942.000),
	(1649, 4810, 0.000, 0, 0, 0, 0, 4884.000),
	(1650, 4811, 0.000, 0, 0, 0, 0, 1821.000),
	(1651, 4812, 0.000, 0, 0, 0, 0, 3032.000),
	(1652, 4813, 0.000, 0, 0, 0, 0, 4584.000),
	(1653, 4814, 0.000, 0, 0, 0, 0, 2456.000),
	(1654, 4815, 0.000, 0, 0, 0, 0, 3902.000),
	(1655, 4816, 0.000, 0, 0, 0, 0, 4914.000),
	(1656, 4817, 0.000, 0, 0, 0, 0, 2675.000),
	(1657, 4818, 0.000, 0, 0, 0, 0, 2642.000),
	(1658, 4819, 0.000, 0, 0, 0, 0, 2483.000),
	(1659, 4820, 0.000, 0, 0, 0, 0, 2590.000),
	(1660, 4821, 0.000, 0, 0, 0, 0, 1990.000),
	(1661, 4822, 0.000, 0, 0, 0, 0, 3083.000),
	(1662, 4823, 0.000, 0, 0, 0, 0, 1759.000),
	(1663, 4824, 0.000, 0, 0, 0, 0, 2623.000),
	(1664, 4825, 0.000, 0, 0, 0, 0, 4333.000),
	(1665, 4826, 0.000, 0, 0, 0, 0, 1641.000),
	(1666, 4827, 0.000, 0, 0, 0, 0, 2244.000),
	(1667, 4828, 0.000, 0, 0, 0, 0, 4039.000),
	(1668, 4829, 0.000, 0, 0, 0, 0, 3866.000),
	(1669, 4830, 0.000, 0, 0, 0, 0, 691.000),
	(1670, 4831, 0.000, 0, 0, 0, 0, 1890.000),
	(1671, 4832, 0.000, 0, 0, 0, 0, 2837.000),
	(1672, 4833, 0.000, 0, 0, 0, 0, 2007.000),
	(1673, 4834, 0.000, 0, 0, 0, 0, 1742.000),
	(1674, 4835, 0.000, 0, 0, 0, 0, 4270.000),
	(1675, 4836, 0.000, 0, 0, 0, 0, 2328.000),
	(1676, 4837, 0.000, 0, 0, 0, 0, 2246.000),
	(1677, 4838, 0.000, 0, 0, 0, 0, 840.000),
	(1678, 4839, 0.000, 0, 0, 0, 0, 1509.000),
	(1679, 4840, 0.000, 0, 0, 0, 0, 2092.000),
	(1680, 4841, 0.000, 0, 0, 0, 0, 3398.000),
	(1681, 4842, 0.000, 0, 0, 0, 0, 550.000),
	(1682, 4843, 0.000, 0, 0, 0, 0, 824.000),
	(1683, 4844, 0.000, 0, 0, 0, 0, 4872.000),
	(1684, 4845, 0.000, 0, 0, 0, 0, 3115.000),
	(1685, 4846, 0.000, 0, 0, 0, 0, 5442.000);
/*!40000 ALTER TABLE `userwealth_t` ENABLE KEYS */;

-- Dumping structure for table newstars.user_phone_t
CREATE TABLE IF NOT EXISTS `user_phone_t` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `userid` int(11) unsigned NOT NULL,
  `first_model` varchar(45) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL DEFAULT '',
  `first_version` varchar(45) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL DEFAULT '',
  `last_model` varchar(45) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL DEFAULT '',
  `last_version` varchar(45) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL DEFAULT '',
  PRIMARY KEY (`id`),
  UNIQUE KEY `userid_UNIQUE` (`userid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

-- Dumping data for table newstars.user_phone_t: ~0 rows (大约)
/*!40000 ALTER TABLE `user_phone_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `user_phone_t` ENABLE KEYS */;

-- Dumping structure for table newstars.vip_level_t
CREATE TABLE IF NOT EXISTS `vip_level_t` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `userid` int(11) DEFAULT NULL COMMENT '用户ID',
  `vipvalue` decimal(18,3) DEFAULT NULL COMMENT '充值金额',
  `svipvalue` decimal(18,6) DEFAULT NULL COMMENT '税收金额',
  `vvipvalue` int(11) DEFAULT NULL COMMENT '充值次数',
  `viplevel` int(11) DEFAULT NULL COMMENT 'vip等级',
  PRIMARY KEY (`id`),
  UNIQUE KEY `userid_UNIQUE` (`userid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='vip等级';

-- Dumping data for table newstars.vip_level_t: ~0 rows (大约)
/*!40000 ALTER TABLE `vip_level_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `vip_level_t` ENABLE KEYS */;

-- Dumping structure for event newstars.wagencytask
DELIMITER //
CREATE DEFINER=`root`@`%` EVENT `wagencytask` ON SCHEDULE EVERY 1 DAY STARTS '2019-05-15 00:00:00' ON COMPLETION PRESERVE ENABLE DO call calc_wagency_reve()//
DELIMITER ;

-- Dumping structure for table newstars.wagency_amount_detailsum_t
CREATE TABLE IF NOT EXISTS `wagency_amount_detailsum_t` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `userid` int(11) DEFAULT NULL COMMENT '代理编号',
  `playeruid` int(11) DEFAULT NULL COMMENT '玩家编号',
  `amount` decimal(18,6) DEFAULT NULL,
  `createtime` bigint(20) DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `userid_playeruid_unique` (`userid`,`playeruid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

-- Dumping data for table newstars.wagency_amount_detailsum_t: ~0 rows (大约)
/*!40000 ALTER TABLE `wagency_amount_detailsum_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `wagency_amount_detailsum_t` ENABLE KEYS */;

-- Dumping structure for table newstars.wagency_amount_detail_t
CREATE TABLE IF NOT EXISTS `wagency_amount_detail_t` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `userid` int(11) DEFAULT NULL COMMENT '代理编号',
  `playeruid` int(11) DEFAULT NULL COMMENT '玩家编号',
  `amount` decimal(18,6) DEFAULT NULL,
  `bizdate` varchar(45) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL,
  `issum` int(5) DEFAULT '0',
  `createtime` bigint(20) DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `userid_playeruid_bizdate_unique` (`userid`,`bizdate`,`playeruid`),
  KEY `index_bizdate` (`bizdate`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

-- Dumping data for table newstars.wagency_amount_detail_t: ~0 rows (大约)
/*!40000 ALTER TABLE `wagency_amount_detail_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `wagency_amount_detail_t` ENABLE KEYS */;

-- Dumping structure for table newstars.wagency_amount_record_t
CREATE TABLE IF NOT EXISTS `wagency_amount_record_t` (
  `ID` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `userid` int(11) DEFAULT NULL COMMENT '用户ID',
  `direamount` decimal(18,6) DEFAULT NULL COMMENT '直属玩家奖励',
  `otheramount` decimal(18,6) DEFAULT NULL COMMENT '其他玩家奖励',
  `bizdate` varchar(45) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL COMMENT '税收日期',
  `amountstatus` int(5) DEFAULT '0' COMMENT '0:未累计 1:已累计',
  `createtime` bigint(20) DEFAULT NULL COMMENT '创建时间',
  PRIMARY KEY (`ID`),
  UNIQUE KEY `userid_bizdate_UNIQUE` (`userid`,`bizdate`),
  KEY `bizdate_idx` (`bizdate`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

-- Dumping data for table newstars.wagency_amount_record_t: ~0 rows (大约)
/*!40000 ALTER TABLE `wagency_amount_record_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `wagency_amount_record_t` ENABLE KEYS */;

-- Dumping structure for table newstars.wagency_amount_tmp_t
CREATE TABLE IF NOT EXISTS `wagency_amount_tmp_t` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `userid` int(11) DEFAULT NULL,
  `amount` decimal(18,6) DEFAULT NULL,
  `agencylevel` int(11) DEFAULT NULL,
  `bizdate` varchar(45) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `userid_agencylevel` (`userid`,`agencylevel`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

-- Dumping data for table newstars.wagency_amount_tmp_t: ~0 rows (大约)
/*!40000 ALTER TABLE `wagency_amount_tmp_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `wagency_amount_tmp_t` ENABLE KEYS */;

-- Dumping structure for table newstars.wagency_eventlog_t
CREATE TABLE IF NOT EXISTS `wagency_eventlog_t` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `errcode` int(11) DEFAULT NULL,
  `errmsg` text CHARACTER SET utf8 COLLATE utf8_bin,
  `bizdate` varchar(45) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL,
  `createtime` bigint(20) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

-- Dumping data for table newstars.wagency_eventlog_t: ~0 rows (大约)
/*!40000 ALTER TABLE `wagency_eventlog_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `wagency_eventlog_t` ENABLE KEYS */;

-- Dumping structure for table newstars.wagency_getamount_record_t
CREATE TABLE IF NOT EXISTS `wagency_getamount_record_t` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `userid` int(11) DEFAULT NULL,
  `amount` decimal(18,2) DEFAULT NULL,
  `hisamount` decimal(18,2) DEFAULT NULL COMMENT '所有领取金币',
  `createtime` bigint(20) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

-- Dumping data for table newstars.wagency_getamount_record_t: ~0 rows (大约)
/*!40000 ALTER TABLE `wagency_getamount_record_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `wagency_getamount_record_t` ENABLE KEYS */;

-- Dumping structure for table newstars.wagency_reve_record_t
CREATE TABLE IF NOT EXISTS `wagency_reve_record_t` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `userid` int(11) NOT NULL,
  `startrevenue` decimal(18,6) DEFAULT NULL,
  `endrevenue` decimal(18,6) DEFAULT NULL,
  `bizdate` varchar(45) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL,
  `createtime` bigint(20) DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `userid_bizdate_UNIQUE` (`userid`,`bizdate`),
  KEY `bizdate_idx` (`bizdate`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

-- Dumping data for table newstars.wagency_reve_record_t: ~0 rows (大约)
/*!40000 ALTER TABLE `wagency_reve_record_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `wagency_reve_record_t` ENABLE KEYS */;

-- Dumping structure for table newstars.wagency_user_t
CREATE TABLE IF NOT EXISTS `wagency_user_t` (
  `ID` int(11) NOT NULL AUTO_INCREMENT,
  `userid` int(11) NOT NULL,
  `direnums` int(11) DEFAULT '0',
  `othernums` int(11) DEFAULT '0',
  `revenue` decimal(18,6) DEFAULT '0.000000',
  `syncrevenue` decimal(18,6) DEFAULT '0.000000',
  `hisamount` decimal(18,2) DEFAULT '0.00',
  `ungetamount` decimal(18,2) DEFAULT '0.00',
  `parentuid` int(11) DEFAULT '0',
  `parentuids` text CHARACTER SET utf8 COLLATE utf8_bin,
  `createtime` bigint(20) DEFAULT NULL,
  PRIMARY KEY (`ID`),
  UNIQUE KEY `userid_UNIQUE` (`userid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

-- Dumping data for table newstars.wagency_user_t: ~0 rows (大约)
/*!40000 ALTER TABLE `wagency_user_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `wagency_user_t` ENABLE KEYS */;

-- Dumping structure for table newstars.wagency_website_t
CREATE TABLE IF NOT EXISTS `wagency_website_t` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `game_id` int(11) NOT NULL COMMENT '平台ID 0:亚星 1:晴天 2:火箭',
  `website` text CHARACTER SET utf8 COLLATE utf8_bin COMMENT '落地页地址',
  `clientstatus` int(11) DEFAULT '0' COMMENT '客户端开关状态 0:关 1:开',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin ROW_FORMAT=DYNAMIC;

-- Dumping data for table newstars.wagency_website_t: ~0 rows (大约)
/*!40000 ALTER TABLE `wagency_website_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `wagency_website_t` ENABLE KEYS */;

-- Dumping structure for table newstars.wagency_weektop_t
CREATE TABLE IF NOT EXISTS `wagency_weektop_t` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `userid` int(11) DEFAULT NULL,
  `nickname` varchar(45) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL,
  `amount` decimal(18,6) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

-- Dumping data for table newstars.wagency_weektop_t: ~0 rows (大约)
/*!40000 ALTER TABLE `wagency_weektop_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `wagency_weektop_t` ENABLE KEYS */;

-- Dumping structure for table newstars.warn_ip_t
CREATE TABLE IF NOT EXISTS `warn_ip_t` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `ip` varchar(45) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL DEFAULT '' COMMENT 'IP地址',
  PRIMARY KEY (`id`),
  UNIQUE KEY `ip` (`ip`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='高危IP';

-- Dumping data for table newstars.warn_ip_t: ~0 rows (大约)
/*!40000 ALTER TABLE `warn_ip_t` DISABLE KEYS */;
/*!40000 ALTER TABLE `warn_ip_t` ENABLE KEYS */;

/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IF(@OLD_FOREIGN_KEY_CHECKS IS NULL, 1, @OLD_FOREIGN_KEY_CHECKS) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
